[
  {
    "uuid": "59b980bf-b25c-319c-be89-9b4ef55882cb",
    "related_symbols": "['APP' 'AVGO' 'GOOG' 'NVDA' 'PLTR' 'WSFX.BO']",
    "title": "Top Funds Get Googly-Eyed Over This Breakout AI Stock Not Named Nvidia Or Palantir",
    "publisher": "Investor's Business Daily",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/m/59b980bf-b25c-319c-be89-9b4ef55882cb/top-funds-get-googly-eyed.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': 'The best mutual funds keep pouring massive sums into AppLovin stock as it breaks out. Meanwhile, Nvidia, Palantir remain under pressure.'}]"
  },
  {
    "uuid": "8deacb11-6858-3c62-ad25-db0491b44efc",
    "related_symbols": "['GOOG' 'MSFT' 'XLK']",
    "title": "Sector Update: Tech",
    "publisher": "MT Newswires",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/sector-tech-202623766.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': 'Tech stocks were higher late Friday afternoon, with the Technology Select Sector SPDR Fund (XLK) up'}]"
  },
  {
    "uuid": "cbb10629-c6b0-35e3-9a67-dc6411880b89",
    "related_symbols": "['AAPL' 'GOOG' 'SSNLF']",
    "title": "Google Must Limit Default Contracts to One Year, Judge Rules",
    "publisher": "Bloomberg",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/google-must-limit-default-contracts-222442639.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': '(Bloomberg) -- Alphabet Inc.’s Google must renegotiate any contract to make its search engine or artificial intelligence app the default for smartphones and other devices every year, a federal judge ruled.\\nJudge Amit Mehta in Washington sided with the US Justice Department on the one year limitation in his final ruling on what changes the search giant must make in the wake of a landmark ruling that the company illegally monopolized online search. The yearly renegotiation will give rivals — particularly those in the burgeoning generative AI field — a chance to compete for key placements.\\nMost Read from Bloomberg\\nWealthy County in New York Must Pay $112 Million Over Immigrant Rights Violations\\nTrump Replaces Architect to Lead $300 Million Ballroom Design\\nA Bright Idea for Road Safety: Traffic Light Timing\\nWealthy New Jersey Town’s Vote on Fixing School Deficit Canceled\\nOwner of NYC’s Fordham Landing Housing Project Files Bankruptcy\\nThe final judgment will still allow Google to offer its products to Apple Inc. for use in its popular iPhone and pay other electronics makers like Samsung Electronics Co. for default placement. But the judge said those contracts must be renegotiated annually.\\nMehta noted in his ruling that both Google and the US government said they could work with the one-year limitation on default contracts. As such, “the court holds that a hard-and-fast termination requirement after one year would best carry out the purpose of the injunctive relief.”\\nGoogle and the Justice Department didn’t immediately respond to requests for comment.\\nFollowing a 10-week trial, Mehta found in August 2024 that Google illegally monopolized online search and search advertising markets. He then held a second trial in the spring of 2025 to consider the Justice Department’s request that Google be forced to sell off its popular web browser, Chrome.\\nMehta rejected that request, ruling instead in September 2025 that Google must share some of the data underpinning its search results with rivals. Friday’s decision expands on that ruling, outlining the specific circumstances in which the company must share its data and with whom.\\nIn the September decision, Mehta ruled that Google could no longer pay companies to exclusively use its Search, Chrome web browser or Google Play Store, though he declined to bar all payments outright. That ruling incorporated aspects of proposals from Google and the Justice Department, requiring him to issue a second one defining some of the decision’s technical terms.\\nGoogle has said it plans to appeal Mehta’s initial ruling that its contracts, which require companies like Apple and Samsung to make its search engine the default on browsers and phones, violate US antitrust law. The Justice Department could also seek to appeal Mehta’s remedy decision.\\nMost Read from Bloomberg Businessweek\\nYouTube Creators Find a New Consumer for AI Slop: Babies\\nChina’s Biggest Beauty Firm Lays Out Strategy to Rival L’Oréal\\nHow Impoverished People Selling Their Blood Fuels Drug Profits\\nEurope’s Banned Pesticides Are Poisoning Nigeria\\nNetflix Has a Huge Opportunity With the DC Studios Superheroes\\n©2025 Bloomberg L.P.'}]"
  },
  {
    "uuid": "7d9fabd4-3c8e-366e-ac06-f585110585d3",
    "related_symbols": "['AAPL' 'AVGO' 'GOOG' 'META']",
    "title": "Broadcom Stock Is Rising -- Mizuho Bets Big on AI Boom Ahead of Earnings",
    "publisher": "GuruFocus.com",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/broadcom-stock-rising-mizuho-bets-191607285.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': \"This article first appeared on GuruFocus.\\nBroadcom (NASDAQ:AVGO) shares climbed about 2% on Friday morning trade as Mizuho highlighted the chipmaker's growing AI opportunities ahead of next week's earnings.\\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\\nIs AVGO fairly valued? Test your thesis with our free DCF calculator.\\nAnalyst Vijay Rakesh maintained an Outperform rating with a $435 price target, noting Broadcom (NASDAQ:AVGO) is positioned to benefit from Google's Gemini 3 ramp and wider TPU adoption by major AI developers including Alphabet (NASDAQ:GOOGL), Meta (NASDAQ:META) and Apple (NASDAQ:AAPL).\\nMizuho said Broadcom's (NASDAQ:AVGO) TPUv7p and TPUv8p chips, with estimated average selling prices of $10,000 and $15,000, could drive significant revenue upside. Networking catalysts, including the Tomahawk 6-Davisson switch and Thor Ultra 800G NIC, were also cited as strengths for the company's growth.\\nFor fiscal 2026, Mizuho projects Broadcom (NASDAQ:AVGO) revenue of $86.9 billion, EPS of $9.34, and AI-related revenue of $41.1 billion, all above Street estimates. Revenue growth is expected to exceed 30% next year, with further acceleration into 2027. Multiple ASIC ramps through 2026-28 leave additional upside potential, Mizuho noted.\"}]"
  },
  {
    "uuid": "3a9044a8-cdb6-3a09-9747-e37a25890a62",
    "related_symbols": "['AMD' 'AVGO' 'CIEN' 'COST' 'CRM' 'GOOG' 'NVDA' 'OPAI.PVT' 'ORCL' 'TOL']",
    "title": "Broadcom Stock, With Google's Gemini Premium, Holds Near Highs Ahead Of Q4 Results",
    "publisher": "Investor's Business Daily",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/m/3a9044a8-cdb6-3a09-9747-e37a25890a62/broadcom-stock%2C-with-google%27s.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': \"Google's Gemini AI chatbot has been gaining market share, and that's been good news for Broadcom stock, which reports earnings late Thursday.\"}]"
  },
  {
    "uuid": "f5b8cce4-7c34-384a-88a8-1f433759ac9a",
    "related_symbols": "['AMD' 'AMZN' 'AVGO' 'GOOG' 'NVDA' 'QCOM' 'TSM']",
    "title": "Nvidia vs. Everybody Else: Competition Mounts Against the Top AI Chip Company",
    "publisher": "The Wall Street Journal",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/m/f5b8cce4-7c34-384a-88a8-1f433759ac9a/nvidia-vs.-everybody-else%3A.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': 'Armed with the most advanced blueprints for graphics processing units, or GPUs, and helped by the rapid pace of innovation at Taiwan Semiconductor Manufacturing the contract fabricator that makes 90% of the world’s advanced AI chips, Nvidia has become synonymous with AI processors. New entrants to the AI chip-design business, including Google and Amazon are talking about selling their most advanced chips, which rival Nvidia’s GPUs in power and efficiency, to an array of outside customers. Smaller rivals like Advanced Micro Devices, Qualcomm and Broadcom are introducing products that help them focus more intently on AI data-center computing.'}]"
  },
  {
    "uuid": "7e2bfcfa-36dc-3437-bb87-abdb08062eac",
    "related_symbols": "['AAPL' 'GOOG' 'LLY' 'MSFT' 'NVDA']",
    "title": "Meet the Supercharged Growth Stock That Could Join Apple, Nvidia, Microsoft, and Alphabet in the $2 Trillion Club by 2028",
    "publisher": "Motley Fool",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/m/7e2bfcfa-36dc-3437-bb87-abdb08062eac/meet-the-supercharged-growth.html",
    "news": "[{'paragraph_number': 1, 'highlight': 'Key Points', 'paragraph': \"Lilly's market cap recently touched $1 trillion.\\nForecasts for the GLP-1 market are evolving.\\nNew applications for GLP-1 drugs are emerging.\\n10 stocks we like better than Eli Lilly ›\\nApple was the first company in history to reach $1 trillion in market value, a milestone that it hit in August 2018. Just seven years later the maker of iPhones, iPads, and Macs is valued at a stunning $4.2 trillion, while five other technology companies now have market caps that exceed $2 trillion.\\nThis growth shows just how fast companies that are first to embrace a world-changing new technology -- in this case artificial intelligence -- can scale. I predict, however, that another, quite different technology will push the market cap of a company outside the tech sector above the $2 trillion level by 2028.\\nThe company I'm referring to is pharmaceutical giant Eli Lilly (NYSE: LLY) and the technology is one that everyone is familiar with by now -- the class of medications called GLP-1 agonists, which have proven extremely effective in lowering blood sugar levels and promoting weight loss.\"}\n {'paragraph_number': 2, 'highlight': \"Eli Lilly now has the world's best-selling drug\", 'paragraph': \"In the third quarter, Eli Lilly's GLP-1 medication -- called tirzepatide, which treats both type 2 diabetes and obesity -- became the best-selling drug on the planet. In doing so, it knocked Keytruda, the cancer immunotherapy drug made by Merck, off the throne. Tirzepatide is sold as Mounjaro for treating type 2 diabetes and as Zepbound for weight loss.\\nSales of tirzepatide have pushed Eli Lilly's stock 633% higher over the past five years -- the bulk of that rapid rise has come since May 2022 when the company first started selling the drug for treatment of diabetes -- and 38% higher this year. For comparison, the S&P 500 index is up 87% over the past five years and 16% this year.\\nThat growth pushed Eli Lilly's market cap briefly above $1 trillion in November. The stock has settled back a bit since then, to around $953 billion. But I would argue that Eli Lilly's fortunes -- and those of its shareholders -- are very closely tied to the GLP-1 market. In the third quarter, sales of Mounjaro and Zepbound accounted for about $10.1 billion in revenue, or about 57% of the company's total revenue. In its third-quarter filing, Lilly said the two products were largely responsible for its 54% revenue growth.\"}\n {'paragraph_number': 3, 'highlight': 'Forecasts for the GLP-1 market are changing', 'paragraph': 'Forecasts for the GLP-1 market are all over the map at the moment. But one research firm expects it to grow from about $49 billion this year to more than $157 billion by 2035, which represents a compound annual growth rate of 11.1%.\\nYet several factors are causing some analysts to rethink those numbers, and even lower them. Chief among those are what analysts call \"price erosion.\" That is, declining prices per unit of medication.\\nAnd we\\'ve seen some of that up close in recent weeks, as both Lilly and GLP-1 competitor Novo Nordisk in November struck a deal with the Trump administration to dramatically lower the prices they charge Medicare patients for their obesity drugs.'}\n {'paragraph_number': 4, 'highlight': 'Other markets and ailments are emerging for GLP-1 drugs', 'paragraph': \"But I would argue that kind of thinking is myopic. First, consider that obesity has long been an epidemic of developed countries. Now, however, obesity is proliferating in other nations, including large emerging-market countries like China. Goldman Sachs, which recently dialed back its forecast for the GLP-1 market's growth due to expected price erosion, also increased its forecast for markets outside the U.S. As of 2020, half of all Chinese adults were overweight or obese. The Chinese government projects that will rise to 65% by 2030.\\nIn addition, the potential uses for GLP-1 drugs are rapidly increasing in number. The drugs are now being explored as treatments for addiction -- reducing cravings for everything from alcohol to gambling -- as well as osteoarthritis and Alzheimer's disease, among many other ailments. They're even being studied as a potential treatment for obesity in cats and other pets.\\nIf GLP-1 drugs can help with so many diseases and chronic conditions, the market for them is poised to explode much more dramatically than current forecasts allow. Eli Lilly is currently the leader in the GLP-1 drug market, and I see its share price and market cap benefiting from that growth in a big way.\"}\n {'paragraph_number': 5, 'highlight': 'Should you buy stock in Eli Lilly right now?', 'paragraph': \"Before you buy stock in Eli Lilly, consider this:\\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Eli Lilly wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $556,658!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,124,157!*\\nNow, it’s worth noting Stock Advisor’s total average return is 1,001% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\\nSee the 10 stocks »\\n*Stock Advisor returns as of December 1, 2025\\nMatthew Benjamin has positions in Novo Nordisk. The Motley Fool has positions in and recommends Apple, Goldman Sachs Group, and Merck. The Motley Fool recommends Novo Nordisk. The Motley Fool has a disclosure policy.\\nMeet the Supercharged Growth Stock That Could Join Apple, Nvidia, Microsoft, and Alphabet in the $2 Trillion Club by 2028 was originally published by The Motley Fool\"}]"
  },
  {
    "uuid": "41f618c3-858e-3d19-9232-181881e2f344",
    "related_symbols": "['GOOG' 'META']",
    "title": "The Next Phase of the Artificial Intelligence Race Could Benefit This Company Most",
    "publisher": "Motley Fool",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/m/41f618c3-858e-3d19-9232-181881e2f344/the-next-phase-of-the.html",
    "news": "[{'paragraph_number': 1, 'highlight': 'Key Points', 'paragraph': \"Alphabet could sell up to 1 million AI chips by 2027.\\nMeta may be interested in spending billions of dollars for Alphabet's processors.\\nCompanies will increasingly rely on AI agents in software, and Alphabet is already on the cutting edge.\\n10 stocks we like better than Alphabet ›\\nNo one knows exactly what the next phase of artificial intelligence (AI) will be, but there are some early indicators of what both large and small tech companies are shifting toward. The first is more diversification in AI hardware. The second is increased incorporation of AI software that's useful and works well with existing tech tools.\\nBoth of these ideas could define the next phase of AI, as companies strive to position themselves as leaders in an increasingly competitive AI landscape. And while there are plenty of companies that will benefit, I think Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) is uniquely positioned.\"}\n {'paragraph_number': 2, 'highlight': 'Alphabet could sell 1 million AI chips by 2027', 'paragraph': 'Alphabet has, for years, developed its own artificial intelligence processors. The company\\'s custom-built Tensor Processing Units (TPUs) have been utilized in its data centers to aid in training its AI. Alphabet has, up until now, only used the chips for its own purposes.\\nBut that may be about to change. A report from The Information says that Meta Platforms may be interested in buying some of Alphabet\\'s processors for its own data centers -- a deal that could potentially be worth billions of dollars.\\nThat\\'s significant even as Nvidia (NASDAQ: NVDA) dominates the AI processor market, with an estimated 90% of the data center market running graphics processing units (GPUs). But even Nvidia seems to be a little nervous about Alphabet\\'s chip prospects. When the rumors of Meta\\'s potential Alphabet chip purchase surfaced, the company posted on X that it was \"delighted by Google\\'s success\" but added, \"NVIDIA is a generation ahead of the industry -- it\\'s the only platform that runs every AI model and does it everywhere computing is done.\"\\nThe timing of Nvidia\\'s post and the company reminding everyone that it\\'s far more advanced than the competition comes across as a little nervous.\\nAnd perhaps it should be. Analysts at Morgan Stanley believe that if Alphabet were to begin selling its TPUs, it could sell 500,000 to 1 million of them by 2027. What\\'s more, the investment bank estimates that Alphabet\\'s cloud sales would rise by 11% and earnings per share by 3% for every half million processors sold.'}\n {'paragraph_number': 3, 'highlight': 'The other side of the AI coin', 'paragraph': 'Of course, for Alphabet, hardware isn\\'t the only AI opportunity. The artificial intelligence market is continually evolving into a software-centric tool, with AI agents emerging as one of the next key areas of focus.\\nOpenAI\\'s ChatGPT is widely regarded as the dominant player in this space, with many tech companies utilizing ChatGPT as their primary AI system to develop new software and services. But Alphabet\\'s latest iteration of its own chatbot, Gemini 3, is a formidable opponent.\\nAlphabet says Gemini 3 can solve complex problems with \"PhD-level\" reasoning and solve multistep tasks like booking a local service. The company says it outperforms other frontier AI models on benchmark features, but the bigger headline with Gemini 3 may be that Alphabet has successfully kept pace with OpenAI.\\nOpenAI CEO Sam Altman reportedly sent out a \"code red\" memo to his employees about Alphabet\\'s rising threat and has focused his company on new iterations of ChatGPT and away from other products.\\nGemini already has 650 million active users, and the company recently stated that its AI Overview -- which provides an AI response through Google Search -- has over 2 billion monthly users.\\nMoreover, there\\'s evidence that the company\\'s AI services are driving Alphabet\\'s sales higher. Google Cloud revenue -- under which its AI services are reported -- rose 34% in the third quarter to $15.2 billion. That growth is a good indicator that Alphabet\\'s Gemini integration is paying off already, even as the company\\'s focus on AI software is just getting started.\\nWith Alphabet already succeeding with AI software and the company potentially poised to benefit from artificial intelligence processors, Alphabet is well on its way to catching the next AI wave, no matter where it\\'s headed.'}\n {'paragraph_number': 4, 'highlight': 'Should you invest $1,000 in Alphabet right now?', 'paragraph': \"Before you buy stock in Alphabet, consider this:\\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $556,658!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,124,157!*\\nNow, it’s worth noting Stock Advisor’s total average return is 1,001% — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors.\\nSee the 10 stocks »\\n*Stock Advisor returns as of December 1, 2025\\nChris Neiger has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, and Nvidia. The Motley Fool has a disclosure policy.\\nThe Next Phase of the Artificial Intelligence Race Could Benefit This Company Most was originally published by The Motley Fool\"}]"
  },
  {
    "uuid": "84e03577-a697-3a13-927f-10b69b1c5695",
    "related_symbols": "['AVGO' 'GOOG' 'META' 'MSFT' 'NVDA']",
    "title": "Which Artificial Intelligence (AI) Stocks Are Billionaires Buying the Most?",
    "publisher": "Motley Fool",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/m/84e03577-a697-3a13-927f-10b69b1c5695/which-artificial-intelligence.html",
    "news": "[{'paragraph_number': 1, 'highlight': 'Key Points', 'paragraph': 'Several billionaires loaded up on Broadcom, Meta Platforms, and Microsoft stocks in Q3.\\nHowever, Alphabet and Nvidia were the most popular AI stocks with billionaire investors during the quarter.\\nBoth stocks should have tremendous growth prospects over the next several years.\\nThese 10 stocks could mint the next wave of millionaires ›\\nThe phrase \"follow the money\" gained widespread attention thanks to the 1976 movie, All the President\\'s Men. While the quote and the movie were about the Watergate scandal, following the money has become a popular approach for many investors who track the stocks bought by billionaires.\\nAs you might expect, quite a few billionaires have invested heavily in artificial intelligence (AI) stocks. But which AI stocks are they buying the most?'}\n {'paragraph_number': 2, 'highlight': 'Honorable mentions', 'paragraph': 'To answer that question, I examined the 13F filings for the third quarter of 2025 of companies, family offices, and hedge funds run by 10 prominent billionaire investors:\\nBill Ackman\\nWarren Buffett\\nChase Coleman\\nStanley Druckenmiller\\nIsrael \"Izzy\" Englander\\nKen Griffin\\nCarl Icahn\\nPaul Tudor Jones\\nGeorge Soros\\nDavid Tepper\\nEach of these billionaires, except for Ackman and Icahn, bought at least one AI stock in Q3. Three AI stocks didn\\'t rank at the top of the list, but deserve honorable mentions: Broadcom (NASDAQ: AVGO), Meta Platforms (NASDAQ: META), and Microsoft (NASDAQ: MSFT).\\nJones\\' Tudor Investment hedge fund initiated new positions in Broadcom and Meta in Q3. Druckenmiller\\'s Duquesne Family Office also initiated a new position in Meta during the quarter.\\nColeman\\'s Tiger Global Management increased its position in Broadcom in Q3. Englander\\'s Millennium Management and Griffin\\'s Citadel Advisors each bought additional shares of Broadcom, Meta, and Microsoft. Soros Fund Management more than tripled its position in Microsoft in Q3.'}\n {'paragraph_number': 3, 'highlight': 'The top two', 'paragraph': \"However, two other AI stocks stood out as most popular with billionaire investors. Half of the billionaires on the list bought either Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) or Nvidia (NASDAQ: NVDA) in Q3.\\nBuffett surprised some observers by initiating a significant new position in Alphabet for Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) during the quarter. This purchase was a long time in the making. The legendary investor revealed in an interview with CNBC in 2017 that he regretted not buying shares of Google's parent company earlier.\\nDruckenmiller also opened a new position in Alphabet in Q3. Meanwhile, Englander, Griffin, and Soros added to their hedge fund's stakes in the tech giant. Griffin's Citadel even bought more of both of Alphabet's share classes.\\nJones appeared especially bullish about Nvidia in Q3, increasing his fund's stake in the GPU maker by more than 7x. Englander's Millennium Management boosted its position in Nvidia by 126%. Griffin bought 1.73 million additional shares of Nvidia in the quarter, enough to increase Citadel's holding by 21%. Soros and Tepper were more cautious, increasing their funds' positions in the stock by single-digit percentages.\"}\n {'paragraph_number': 4, 'highlight': 'Should you buy Alphabet and Nvidia stocks, too?', 'paragraph': \"No investor should blindly copy the trades that famous, wealthy investors make. Your investment goals and risk tolerance could differ significantly from theirs. That said, I think that both Alphabet and Nvidia are good picks for many investors.\\nAlphabet offers an opportunity to potentially profit from several of the most important technology trends of the next decade. AI ranks at the top of the list. The company's Google Cloud should continue to benefit from the generative AI tailwind. Its Tensor Processing Units (TPUs) could pose an increasing challenge to Nvidia's GPUs. Google Workspace productivity apps are natural candidates for incorporating agentic AI functionality.\\nWaymo, Alphabet's self-driving car technology unit, is already the leader in the robotaxi market. Google Quantum AI is a formidable contender in quantum computing. Alphabet's Android XR operating system could give the company an edge in developing smart glasses.\\nNvidia isn't resting on its laurels, though. The company continues to advance its AI chip technology at a rapid pace. It's also a key player in the autonomous vehicle market and is a picks-and-shovels provider to quantum computing developers.\\nFollowing the money isn't always a smart investing strategy. But with Alphabet and Nvidia, I think it could be.\"}\n {'paragraph_number': 5, 'highlight': 'Don’t miss this second chance at a potentially lucrative opportunity', 'paragraph': 'Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $475,637!*\\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $53,400!*\\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $556,658!*\\nRight now, we’re issuing “Double Down” alerts for three incredible companies, available when you join Stock Advisor, and there may not be another chance like this anytime soon.\\nSee the 3 stocks »\\n*Stock Advisor returns as of December 1, 2025\\nKeith Speights has positions in Alphabet, Berkshire Hathaway, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Berkshire Hathaway, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\\nWhich Artificial Intelligence (AI) Stocks Are Billionaires Buying the Most? was originally published by The Motley Fool'}]"
  },
  {
    "uuid": "a7143cdc-52fe-302d-9f3e-65e9b90131b1",
    "related_symbols": "['GOOG']",
    "title": "New Memoir In Pursuit of Glory Exposes the High-Stakes Journey to from Laborer to Executive Leadership in a Male-Dominated Industry",
    "publisher": "ACCESS Newswire",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/memoir-pursuit-glory-exposes-high-050000208.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': \"Glory Jewitt's new memoir, In Pursuit of Glory, offers an unfiltered look at ambition, adversity, and authentic leadership for women navigating careers still shaped by inequality.\\nATLANTA, GA / ACCESS Newswire / December 6, 2025 /\\nGlory Jewitt, Global Head of Environment, Health & Safety at Google, releases a powerful new memoir that traces her twenty-five-year ascent from laborer in the remote Canadian Oil Sands to executive leadership at some of the world's most influential companies. In Pursuit of Glory: One Woman's Rise To The Top In A Male-Dominated Field is an intimate, unflinching account of what it takes for a woman to succeed-and stay true to herself-in environments where she is often the only woman in the room.\\nGrounded in vivid storytelling and real-world insights, the book pulls readers directly into Jewitt's early years in industrial construction-a chapter that included time in remote work camps as well as demanding project sites where sexism, harassment, dangerous conditions, and constant scrutiny were a part of the work. These experiences influenced the way she later led teams and navigated roles across global corporate organizations. Yet her journey is not just about survival. It's about transformation-developing resilience, finding her voice, rejecting toxic relationships, and redefining what leadership looks like in male-dominated industries.\\nThrough raw honesty and sharp clarity, Jewitt illustrates the psychological toll of being underestimated, objectified, and dismissed, even as she continued to rise into larger spheres of leadership. Her journey moves from her early years as a scaffold laborer to global vice president at just thirty-five, to leading large-scale operations at Amazon, and ultimately steering EHS across Google's worldwide data centers. Her firsthand accounts of confrontation, boundary-setting, and self-advocacy provide a compelling roadmap for women who feel overlooked or undervalued in their own careers.\\nBut In Pursuit of Glory is not solely a professional narrative. It also explores the deeply personal moments that shaped her-complex family dynamics, formative relationships, painful lessons in self-worth, and the emotional cost of pushing through adversity. Jewitt pulls back the curtain on the sacrifices and self-discovery that accompany ambition, revealing how she learned to trust her intuition, recognize red flags, and reclaim her power along the way.\\nToday, as the global leader responsible for EHS across Google's worldwide data centers, Jewitt's story arrives at a moment when conversations about gender equity, workplace safety, and inclusive leadership are more urgent than ever. Her memoir speaks directly to mid-career women seeking clarity, confidence, and growth; to leaders striving to build cultures of respect; and to anyone who has ever questioned whether they belong in the room they've worked hard to enter.\\nIn Pursuit of Glory is both a wake-up call and an invitation-a reminder that authentic leadership is built through courage, self-awareness, and the willingness to rise after every setback. Jewitt's journey proves that even in the toughest environments, women can lead, excel, and reshape the systems around them.\\nIn Pursuit of Glory is available now on Amazon and at major online retailers. To learn more about Glory Jewitt and her work visit www.gloryjewitt.com or connect with her on Instagram, LinkedIn, and Facebook.\\nCONTACT:\\nName: Nicolle Endoso\\nEmail: Nicolle@gloryjewitt.com\\nSOURCE: Glory Jewitt\\nView the original press release on ACCESS Newswire\"}]"
  },
  {
    "uuid": "c6af0e1f-ed01-371b-9cea-0288e1597089",
    "related_symbols": "['GOOG' 'MSFT' 'OPAI.PVT']",
    "title": "Correction: Market Chatter: OpenAI Plans Response to Google's Gemini 3 With Accelerated GPT-5.2 Rollout",
    "publisher": "MT Newswires",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/correction-market-chatter-openai-plans-201826100.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': '(Corrects ticker placement in first paragraph) Microsoft-backed (MSFT) OpenAI is fast-tracking th'}]"
  },
  {
    "uuid": "0cc8646f-10d5-366c-b766-8b936218475f",
    "related_symbols": "['GOOG' 'MSFT' 'OPAI.PVT']",
    "title": "Market Chatter: OpenAI Plans Response to Google's Gemini 3 With Accelerated GPT-5.2 Rollout",
    "publisher": "MT Newswires",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/market-chatter-openai-plans-response-201421642.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': 'Microsoft-backed OpenAI (MSFT) is fast-tracking the rollout of GPT-5.2 update after chief executive'}]"
  },
  {
    "uuid": "e781fa78-bdad-35a3-9ab6-ce5ad0c432d7",
    "related_symbols": "['GOOG' 'MSFT' 'OPAI.PVT' 'PLTR' 'XLK']",
    "title": "Sector Update: Tech Stocks Rise Late Afternoon",
    "publisher": "MT Newswires",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/sector-tech-stocks-rise-afternoon-204504676.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': 'Tech stocks were higher late Friday afternoon, with the Technology Select Sector SPDR Fund (XLK) up'}]"
  },
  {
    "uuid": "00320330-a568-366f-b495-18d0b1ff39f3",
    "related_symbols": "['GOOG' 'TFC']",
    "title": "Alphabet Price Target Lifted to $350 by Truist on Strong Holiday Ad Momentum",
    "publisher": "GuruFocus.com",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/alphabet-price-target-lifted-350-191517122.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': \"This article first appeared on GuruFocus.\\nTruist Securities lifted its price target on Alphabet (GOOGL, Financials) to $350 from $320 on Friday, citing stronger U.S. e-commerce trends and improving efficiency in AI-enhanced advertising. Alphabet recently traded at $317.62, placing its market value at $3.84 trillion.\\nWarning! GuruFocus has detected 11 Warning Signs with STLA.\\nIs GOOGL fairly valued? Test your thesis with our free DCF calculator.\\nThe firm said holiday digital ad spending is tracking at record levels, supported by stable consumer demand and advanced targeting capabilities enabled by Google's AI systems. Truist raised its advertising revenue estimates, noting Alphabet's 13.4% revenue growth over the past 12 months, with analysts expecting 14% for the fiscal year.\\nTruist also boosted its long-term revenue assumptions for the company's Other Bets segment, pointing to Waymo's expansion into additional U.S. cities. The revised target reflects a 9.4% increase from the firm's prior estimate.\\nAdditional analyst commentary has been constructive. Pivotal Research recently raised its price target to $400, while other firms highlighted Alphabet's involvement in a potential $700 million funding round for AI infrastructure startup Fluidstack and progress in deploying its Gemini AI model in 2026.\"}]"
  },
  {
    "uuid": "0cb0f6e8-5608-3395-bb90-4cf845aa1d68",
    "related_symbols": "['AMZN' 'GOOG' 'META']",
    "title": "The Future of Finance? Google Is Bringing Betting Odds Directly To Your Screen, Sparking Calls For 'Addiction Warnings'",
    "publisher": "Benzinga",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/future-finance-google-bringing-betting-000053005.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': 'Google announced earlier this month that it will integrate odds from online betting platforms Kalshi Inc. and Polymarket into its Google Finance tools amid pushback from lawmakers over the evolution of modern-day gambling.'}\n {'paragraph_number': 2, 'highlight': 'Integrating \"Event Contracts\" Into Financial Platforms', 'paragraph': 'The integration of these “event contract” sites will enable users to “ask questions about future market events and harness the wisdom of the crowds,\" according to a company blog post. The decision, however, comes as both Kalshi and Polymarket navigate a complex web of state and federal regulations.\\nDon\\'t Miss:\\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\\nDeloitte\\'s #1 Fastest-Growing Software Company Lets Users Earn Money Just by Scrolling — Accredited Investors Can Still Get In at $0.50/Share.'}\n {'paragraph_number': 3, 'highlight': 'Regulatory Debate Over Event Contracts', 'paragraph': 'Kalshi and Polymarket maintain their platforms offer “event contracts” between private parties that should be regulated like commodities rather than traditional gambling subject to state oversight; an argument that has received pushback from government officials, NBC Chicago said. Companies like Kalshi and Polymarket should “package sports betting as events contracts” to circumvent established gaming regulations, state attorneys general claimed in a lawsuit in June.\\nU.S. senators including five Democrats and one Republican addressed that concern in a letter to Commodity Futures Trading Commission Acting Chair Caroline Pham September “By claiming to be federally regulated … issuers of sports event contracts can avoid myriad state [gaming] laws, including licensing and background investigations, minimum age requirements, federal anti-money laundering rules, and consumer protections such as addiction warnings and integrity monitoring,” the lawmakers wrote.\\nTrending: 7 Million Gamers Already Trust Gameflip With Their Digital Assets — Now You Can Own a Stake in the Platform'}\n {'paragraph_number': 4, 'highlight': 'Voters Favor Federal Oversight', 'paragraph': 'Nearly 80% of American voters support keeping prediction market regulation at the federal level rather than under state gambling authorities, according to a poll of 1,219 people nationwide commissioned by Kalshi and conducted by Axis Research. Eighty-nine percent of respondents agreed all Americans should have the freedom and ability to choose whether or not to engage in these markets regardless of their own participation.\\nAmong those surveyed, 75% of Republicans and 71% of Democrats supported a federal regulatory approach to prediction markets. \"American voters want the freedom to choose how to invest their own money without state-level interference,\" Kalshi Head of Corporate Development Sara Slane said in a LinkedIn post. \"The current federal regulatory structure is best equipped to oversee this financial activity, a point underscored by Congress.\"\\nPrediction markets currently fall under the jurisdiction of the Commodities Futures Trading Commission, which oversees event-based contracts that allow participants to trade on the likelihood of future outcomes.\\nSee Also: Missed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium'}\n {'paragraph_number': 5, 'highlight': 'Controversies Over Outcome Determinations', 'paragraph': 'Polymarket and Kalshi have faced criticism over controversies regarding event outcome determinations. For instance, Polymarket’s bet on whether Ukraine’s President Zelenskyy would appear in public wearing a suit before July sparked disputes about what qualifies as “a suit,” Event Horizon reported.\\nMeanwhile, Kalshi users expressed frustration after the company refused to pay out bets when former X CEO Linda Yaccarino announced she was leaving the company, reported Event Horizon.'}\n {'paragraph_number': 6, 'highlight': \"Trump Administration's Role in Shaping the Industry\", 'paragraph': \"The Trump administration has become a key player in Kalshi and Polymarket’s market dynamics. Donald Trump Jr., the president's eldest son, serves as a formal adviser to both companies. The CFTC in May dropped a case against Kalshi initiated by Biden-era regulators, clearing the way for Polymarket to regain U.S. market access as indicated by the CFTC in September. In October, Trump's social media platform Truth Social announced plans to launch Truth Predict, a crypto-based event betting service.\\nRead Next: Wall Street's $12B Real Estate Manager Is Opening Its Doors to Individual Investors — Without the Crowdfunding Middlemen\\nImage: Imagn\\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily, plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\\nGet the latest stock analysis from Benzinga:\\nAPPLE (AAPL): Free Stock Analysis Report\\nTESLA (TSLA): Free Stock Analysis Report\\nThis article The Future of Finance? Google Is Bringing Betting Odds Directly To Your Screen, Sparking Calls For &#39;Addiction Warnings&#39; originally appeared on Benzinga.com\\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\"}]"
  },
  {
    "uuid": "99ae8e5f-a8e6-373b-b725-30a2c37b9063",
    "related_symbols": "['AMZN' 'GOOG' 'META']",
    "title": "Stanford Dropout Turned $120 Million Founder Says MBAs Are 'A Fraction Of What You Would Get From Building Your Own Thing For That 2 Years'",
    "publisher": "Benzinga",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/stanford-dropout-turned-120-million-020029974.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': 'A sharp pushback against the MBA track is reshaping how the technology industry views graduate business school. The degree delivers far less value than two years spent building a company, Trilogy Software and ESW Capital founder Joe Liemandt recently told the \"Big Deal by Codie Sanchez\" podcast.\\n\"It is a great two-year period to build up a set of good relationships, but no, there\\'s nothing on the business knowledge that you\\'re going to come out of there that is a fraction of what you would get from building your own thing for that two years,\" Liemandt said.\\nDon\\'t Miss:\\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\\nDeloitte\\'s #1 Fastest-Growing Software Company Lets Users Earn Money Just by Scrolling — Accredited Investors Can Still Get In at $0.50/Share.'}\n {'paragraph_number': 2, 'highlight': 'How He Separates Entrepreneurs From MBA Graduates', 'paragraph': 'Liemandt attended Stanford University before dropping out to launch Trilogy Software in 1989. Trilogy built software used by large enterprises and reached about $120 million in annual revenue at its peak.\\nTrilogy later spun off pcOrder.com, which went public during the dot-com boom. The company also created Trilogy University, an intensive internal training program for new hires, according to Harvard Business Review.\\nLiemandt later founded ESW Capital, a software-acquisition firm built around buying and turning around underperforming software companies.\\nHe described differences he sees in how founders and MBA graduates evaluate ideas. \"You\\'re going to look at the spreadsheet and you\\'re going to say, ‘That cell doesn\\'t work, so the spreadsheet doesn\\'t work. So I\\'m not going to do this idea,\\'\" he told host Codie Sanchez.\\nTrending: An EA Co-Founder Shapes This VC Backed Marketplace—Now You Can Invest in Gaming\\'s Next Big Platform\\nIn contrast, he said entrepreneurs approach the same issue differently. \"An entrepreneur looks at that cell and says, ‘I will change that cell. I will make that work,\\'\" he said. \"If you\\'re going to be a builder and an entrepreneur, you\\'re gonna go change reality.\"'}\n {'paragraph_number': 3, 'highlight': 'MBA Earnings And Market Value', 'paragraph': \"MBA programs remain attractive despite high costs. Recent Harvard Business School data show a median base salary of $184,500 for graduates who accepted offers and a $30,000 signing bonus.\\nA recent Graduate Management Admission Council survey projected a median salary of $125,000 for MBA graduates in the U.S., about $25,000 more than experienced direct-from-industry hires.\\nRead Next:\\nGM-Backed EnergyX Is Solving the Lithium Supply Crisis — Invest Before They Scale Global Production\\nWall Street's $12B Real Estate Manager Is Opening Its Doors to Individual Investors — Without the Crowdfunding Middlemen\\nImage: Shutterstock\\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\\nGet the latest stock analysis from Benzinga:\\nAPPLE (AAPL): Free Stock Analysis Report\\nTESLA (TSLA): Free Stock Analysis Report\\nThis article Stanford Dropout Turned $120 Million Founder Says MBAs Are &#39;A Fraction Of What You Would Get From Building Your Own Thing For That 2 Years&#39; originally appeared on Benzinga.com\\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\"}]"
  },
  {
    "uuid": "ef82780c-8ccd-3716-81ba-e659bab63507",
    "related_symbols": "['GOOG']",
    "title": "Play a Waiting Game With Roblox Stock",
    "publisher": "Barrons.com",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/m/ef82780c-8ccd-3716-81ba-e659bab63507/play-a-waiting-game-with.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': 'Readers weigh in on Roblox, Google, Blue Owl Capital, the challenge of trading less often, tax code changes, Mohamed El-Erian’s criticism of the Fed, and President Trump’s economic wins.'}]"
  },
  {
    "uuid": "888440df-beb0-3fab-aecb-4766261e406c",
    "related_symbols": "['AAPL' 'AMZN' 'GOOG' 'META' 'MSFT' 'NVDA' 'TSLA']",
    "title": "Cathie Wood’s latest move is alarming for big stocks",
    "publisher": "TheStreet",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/m/888440df-beb0-3fab-aecb-4766261e406c/cathie-wood%E2%80%99s-latest-move-is.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': 'Cathie Wood’s recent move just sent a quiet alarm through mega-cap tech.\\nARK filings filed for December 4 show major cuts to Meta Platforms (META) and Tesla (TSLA) stocks, two \"Magnificent 7\" stalwarts that played a key role in 2025’s relentless AI-powered rally.\\nFor perspective, Meta stock is up 13% year to date at the time of writing, and Tesla stock is up 12.5% year to date (37% in the past six months).\\nFor those living under a rock, here’s the Mag 7 roll call with their latest market caps:\\nNvidia: $4.4 trillion\\nMicrosoft: $3.6 trillion\\nApple: $4.2 trillion\\nAlphabet: $3.8 trillion\\nAmazon: $2.5 trillion\\nMeta Platforms: $1.7 trillion\\nTesla: $1.5 trillion\\nThose weren’t one-off trims, either, as they extended a weeklong pattern of Wood steadily offloading the market’s biggest winners.\\nSurprisingly, the ARK boss’s biggest buy of the day was Trade Desk, an obvious rotation away from over-owned giants and toward mid-cap names heading into 2026.\\nWood’s bets are unmissable for investors, and her selling of Big Tech plays raises real questions about how much upside is still left in the AI trade.'}\n {'paragraph_number': 2, 'highlight': 'Wood’s selling spree targets Big Tech', 'paragraph': 'Wood’s sharpest cuts on December 4 hit two of the biggest Mag 7 names in Meta and Tesla. ARK sold off 14,211 Meta shares ($9.1 million) while trimming 7,478 Tesla shares ($3.3 million), adding to a multi-day pullback from mega-cap tech.\\nAs of Q3 20205, Tesla accounted for roughly 10.5% of ARK’s combined portfolio, being a top ARK position for years, with Wood at one point even telling CNBC it was the \"biggest AI opportunity in the world.\"\\nFund manager buys and sells\\nStanley Druckenmiller’s latest buys suggest shifting tech trend\\nFund manager has surprising take on big Tesla stock drop\\nJim Cramer delivers urgent take on the stock market\\nCathie Wood dumps $30 million in longtime favorite\\nWood is apparently taking profits in the year’s biggest winners as she reallocates stocks she feels are better positioned for 2026.\\nAt a conference in October this year, Wood was blunt in telling CNBC, “I do not believe AI is in a bubble.”\\nNevertheless, she does feel that Big Tech expectations have gotten overheated and that a 2024-2025 “reality check” was inevitable. To her, it’s more of a reset than a rupture, as she believes the real enterprise AI boom will unfold over the years.\\nMoreover, she unwound her position in Iridium Communications (IRDM), a popular space stock, selling 231,395 shares ($4 million) across ARKK, ARKQ, and ARKX.'}\n {'paragraph_number': 3, 'highlight': 'Major investors trim the “Mag 7” in Q3', 'paragraph': 'Wood wasn’t the only fund manager pulling back on the Mag 7.\\nWe saw a wave of billionaire investors and hedge funds also use Q3 to dial down their exposure to Big Tech following a relentless AI-driven run.\\nRelated: Morgan Stanley reveals eye-popping price target on Nvidia stock\\nHere were the biggest moves:\\nBridgewater Associates (Ray Dalio’s fund): Slashed Nvidia by roughly two-thirds and halved Google-parent Alphabet, while also trimming Amazon and Broadcom.\\nTiger Global (Chase Coleman): Cut Meta stock by 62.6% while exiting multiple high-fliers, redeploying capital into streaming and fintech, Reuters reported.\\nCoatue Management (Philippe Laffont): Trimmed Nvidia, Tesla, Amazon, and Arm, while boosting Microsoft and Meta, suggesting cautiousness over AI-exposed names.\\nBerkshire Hathaway (Warren Buffett): Took profits in Apple, while adding a new $4.3 billion Alphabet stake, pointing to better relative value in Google.\\nScion Asset Management (Michael Burry): Reduced Nvidia, warned of an “AI bubble,” and ended up closing his fund to speak freely about the growing excess.'}\n {'paragraph_number': 4, 'highlight': 'Wood’s buying spree shows where she sees 2026 upside', 'paragraph': 'Wood’s is trimming Big Tech but pointing her firepower somewhere else.\\nOn the buying side, she’s looking to rotate aggressively into mid-cap growth names, spearheaded by a standout move into The Trade Desk (TTD).\\nARK scooped up 204,354 TTD shares ($7.9 million) across ARKK and ARKW, one of its biggest single-day pushes into ad-tech.\\nRelated: Bank of America unveils surprise 2026 stock-market forecast\\nThe company just made another strong quarterly showing, posting sales of $739.43 million (+17.7% year over year), beating estimates by almost $20 million. Also, its Q3 non-GAAP EPS of 45 cents beat estimates by a cent.\\nPerhaps the brightest spot was that customer retention hovered near 95%, highlighting its ability to capture a larger share of digital ads as budgets shift toward more specific targeting.\\nAlso, the rotation didn’t stop there.\\nARK has been looking to steadily redeploy capital into a mix of tech, crypto, and next-gen plays, which include:\\nARK 21Shares Bitcoin ETF (ARKB): +52,200 shares\\nWeRide: +42,377 shares\\nPure Storage: +28,409 shares\\nGeneDx: +9,486 shares\\nThe pattern is unmistakable: trim the megacaps and lean into the names Wood thinks still have room to run heading into 2026.\\nRelated: Tesla has problem no one was pricing in\\nThis story was originally published by TheStreet on Dec 5, 2025, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here.'}]"
  },
  {
    "uuid": "ff2f522b-1e60-31dd-acea-beb586a19710",
    "related_symbols": "['CRM' 'GOOG' 'OPAI.PVT' 'XAAI.PVT']",
    "title": "OpenAI Rushes GPT-5.2 After Google's Gemini Surge",
    "publisher": "GuruFocus.com",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/openai-rushes-gpt-5-2-191630139.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': \"This article first appeared on GuruFocus.\\nOpenAI is gearing up for arguably fastest turnarounds yet. According to The Verge, the business will be showing off GPT-5.2 as early as next week, speeding things up in response to Google's recent momentum in generative AI.\\nThe update was slated for release in mid-December, but sources say OpenAI moved up the timeline in closing out the gap with Google's new Gemini 3 models.\\nWarning! GuruFocus has detected 8 Warning Sign with HPE.\\nIs GOOGL fairly valued? Test your thesis with our free DCF calculator.\\nThe speed-up follows a code red memo from CEO Sam Altman earlier this month, that involved telling employees to push for major improvements to ChatGPT.Google's Gemini 3 launched last month, lifting Alphabet (NASDAQ:GOOGL) stock in the process and earning praises from xAI founder Elon Musk and Salesforce (CRM) CEO Marc Benioff.\"}]"
  },
  {
    "uuid": "fc8fd63f-d4ca-37ec-babe-cd197d6272b2",
    "related_symbols": "['AMZN' 'GOOG' 'LPLA' 'META']",
    "title": "If You Invested $10K In LPL Financial Stock 10 Years Ago, How Much Would You Have Now?",
    "publisher": "Benzinga",
    "report_date": "2025-12-06",
    "type": "STORY",
    "link": "https://finance.yahoo.com/news/invested-10k-lpl-financial-stock-030111946.html",
    "news": "[{'paragraph_number': 1, 'highlight': '', 'paragraph': \"Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\\nLPL Financial Holdings Inc. (NASDAQ:LPLA) is a provider of wealth management services to independent financial advisors and institutions in the U.S.\\nIt is set to report its Q4 2025 earnings on Jan. 29. Wall Street analysts expect the company to post EPS of $4.99, up from $4.25 in the prior-year period. According to Benzinga Pro, quarterly revenue is expected to reach $4.87 billion, up from $3.51 billion a year earlier.\\nDon't Miss:\\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\\nEarn While You Scroll: The Deloitte-Ranked #1 Software Company Growing 32,481% Is Opening Its $0.50/Share Round to Accredited Investors.\"}\n {'paragraph_number': 2, 'highlight': 'If You Bought LPL Financial Stock 10 Years Ago', 'paragraph': \"The company's stock traded at approximately $45.98 per share 10 years ago. If you had invested $10,000, you could have bought roughly 217 shares. Currently, shares trade at $356.13, meaning your investment's value could have grown to $77,453 from stock price appreciation alone. However, LPL Financial also paid dividends during these 10 years.\\nLPL Financial's dividend yield is currently 0.34%. Over the last 10 years, it has paid about $11.60 in dividends per share, which means you could have made $2,523 from dividends alone.\\nSumming up $77,453 and $2,523, we end up with the final value of your investment, which is $79,976. This is how much you could have made if you had invested $10,000 in LPL Financial stock 10 years ago. This means a total return of 699.76%. In comparison, the S&P 500 total return for the same period, which was 290.90%.\\nTrending: An EA Co-Founder Shapes This VC Backed Marketplace—Now You Can Invest in Gaming's Next Big Platform\"}\n {'paragraph_number': 3, 'highlight': 'What Could The Next 10 Years Bring?', 'paragraph': 'LPL Financial has a consensus rating of \"Buy\" and a price target of $367.55 based on the ratings of 21 analysts. The price target implies more than 3% potential upside from the current stock price.\\nThe company on Oct. 30 announced its Q3 2025 earnings, posting adjusted EPS of $5.20, compared to the consensus estimate of $4.49, and revenues of $4.55 billion, compared to the consensus of $4.25 billion, as reported by Benzinga.\\n“The third quarter underscores the strength of LPL, as we advanced on several strategic fronts,” said CFO Matt Audette. “We delivered another quarter of industry-leading organic growth, onboarded the wealth management business of First Horizon, closed on our acquisition of Commonwealth, and continued to make progress on driving operating leverage. As we look ahead, we remain excited about the opportunities to serve and support our advisors, while delivering long-term shareholder value.”\\nGiven the historical stock price appreciation and expected upside potential, growth-focused investors may find LPL Financial stock attractive. Furthermore, they can benefit from the company\\'s solid dividend yield of 0.34%.\\nRead Next:\\nGM-Backed EnergyX Is Solving the Lithium Supply Crisis — Invest Before They Scale Global Production\\nWall Street\\'s $12B Real Estate Manager Is Opening Its Doors to Individual Investors — Without the Crowdfunding Middlemen\\nImage: Shutterstock\\nThis article If You Invested $10K In LPL Financial Stock 10 Years Ago, How Much Would You Have Now? originally appeared on Benzinga.com'}]"
  }
]