{
  "data": {
    "attributes": {
      "commentCount": 0,
      "title": "KBR Awarded Green Ammonia Project by IGNIS in Spain",
      "publishOn": "2025-12-15T06:00:00.000-05:00",
      "lastModified": "2025-12-15T06:00:44-05:00",
      "widgetLinks": null,
      "content": "<div>\n<p><span class=\"location\" value=\"LU/us.tx.houstn\">HOUSTON</span>, Dec.  15, 2025  (GLOBE NEWSWIRE) -- KBR (<a href=\"https://seekingalpha.com/symbol/KBR\">KBR</a>) (NYSE: KBR) announced today that it has been awarded a technology and engineering contract by IGNIS for a new green ammonia facility in A Coruña, <span class=\"location\" value=\"LC/es\">Spain</span>.</p>  <p>Under the terms of the contract, KBR will provide proprietary engineering design and pre-FEED engineering services to IGNIS for a 200,000 tons per annum green ammonia plant. The facility will use renewable energy to produce green hydrogen, which will be converted to green ammonia. Green ammonia, a key element for producing renewable fertilizers, can be used as a highly efficient storage and transport medium for renewable energy and as a clean fuel.</p>  <p>“We are proud to support IGNIS in harnessing Spain’s exceptional renewable energy resources to produce green ammonia for domestic and European markets,” said <span class=\"person\" value=\"APIN:2534421132\">Jay Ibrahim</span>, President, KBR Sustainable Technology Solutions. “KBR’s green ammonia solutions, along with complementary technologies such as H2ACT<sup>®</sup> ammonia cracking, make us a global leader in delivering reliable and energy-efficient ammonia technology at a lower capital cost.”</p>  <p>KBR has been at the forefront of innovation in the ammonia market for decades. Since 1943, KBR has licensed, engineered, or constructed more than 260 grassroot ammonia plants worldwide.</p>  <p>About KBR<br>We deliver science, technology and engineering solutions to governments and companies around the world. KBR employs approximately 37,000 people worldwide with customers in more than 80 countries and operations in over 29 countries. KBR is proud to work with its customers across the globe to provide technology, value-added services, and long-term operations and maintenance services to ensure consistent delivery with predictable results. At KBR, We Deliver.</p>  <p>Visit <a href=\"http://www.kbr.com\">www.kbr.com</a></p>  <p>About IGNIS</p>  <p>IGNIS is a global energy company integrated across renewable generation and innovative energy solutions, with more than 30 GW under development in <span class=\"location\" value=\"LR/eur\">Europe</span>, the US, <span class=\"location\" value=\"LR/cam\">Latin America</span>, and <span class=\"location\" value=\"LR/asp\">Asia</span>. Founded in 2015, it provides tailored energy solutions for companies and consumers in more than 10 countries.</p>  <p>Its IGNIS P2X division develops green hydrogen and derivative products—such as ammonia, synthetic methanol, and sustainable fuels—by leveraging its renewable generation portfolio, thereby contributing to the decarbonization of key sectors, including heavy industry and maritime and aviation transport. Committed to fostering new industrial opportunities, the company is advancing strategic projects in port areas and inland industrial hubs to produce these high-value energy carriers.</p>  <p>Forward Looking Statements</p>  <p>The statements in this press release that are not historical statements, including statements regarding KBR’s delivery of green ammonia technology and services, are forward-looking statements within the meaning of the federal securities laws. These statements are subject to numerous risks, uncertainties and assumptions, many of which are beyond the company’s control, that could cause actual results to differ materially from the results expressed or implied by the statements. These risks, uncertainties and assumptions include, but are not limited to, those set forth in the company’s most recently filed Annual Report on Form 10-K, any subsequent Form 10-Qs and 8-Ks and other U.S. Securities and Exchange Commission filings, which discuss some of the important risks, uncertainties and assumptions that the company has identified that may affect its business, results of operations and financial condition. Due to such risks, uncertainties and assumptions, you are cautioned not to place undue reliance on such forward-looking statements, which speak only as of the date hereof. Except as required by law, the company undertakes no obligation to revise or update publicly any forward-looking statements for any reason.</p>  <p>For further information, please contact:</p>  <p><em>Investors</em><br><span class=\"person\" value=\"\">Jamie DuBray</span><br>Vice President, Investor Relations<br>713-753-5082<br><a href=\"https://www.globenewswire.com/Tracker?data=z7UG4Kv9AQJO9e6wZexRvgYBXaiXn0vFQ1ZAgueqyLQllW-L0tNaCiwMOvscDj2tmPOs6pP6ChI0-mJTF6_H3fdoA63RQjZ6knEyF1CyzVk=\">Investors@kbr.com</a></p>  <p><em>Media</em><br><span class=\"person\" value=\"\">Philip Ivy</span><br>Vice President, Global Communications and Marketing <br>713-753-3800<br><a href=\"https://www.globenewswire.com/Tracker?data=WucKxyAImqX9RDmNtkFqiByaurEubQf1_WTby7hBdHAikOa6xRSrJkrKOzZb4vm4W4yy11DTjD26zvztsEV4c0L8D1CN1tF6E83IqW6BfzA=\">MediaRelations@kbr.com</a></p> <img src=\"https://www.globenewswire.com/newsroom/ti?nf=OTYwMDk4NyM3MzE4MTg2IzIwMTY1MjE=\" alt=\"https://www.globenewswire.com/newsroom/ti?nf=OTYwMDk4NyM3MzE4MTg2IzIwMTY1MjE=\"> <br><img src=\"https://ml.globenewswire.com/media/ZmM4N2NiMDEtZWE2Yi00OGIwLWJjNmEtZThhOTIyODMzNTBlLTEwMjgwOTQtMjAyNS0xMi0xNS1lbg==/tiny/Kellogg-Brown-Root-LLC-.png\" alt=\"https://ml.globenewswire.com/media/ZmM4N2NiMDEtZWE2Yi00OGIwLWJjNmEtZThhOTIyODMzNTBlLTEwMjgwOTQtMjAyNS0xMi0xNS1lbg==/tiny/Kellogg-Brown-Root-LLC-.png\"><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/14b9b973-fab4-4178-a9e8-25989fc26239\"><img src=\"https://ml.globenewswire.com/media/14b9b973-fab4-4178-a9e8-25989fc26239/small/kbr-logo-final-2020-cmyk-png.png\" width=\"150\" height=\"83\" alt=\"https://ml.globenewswire.com/media/14b9b973-fab4-4178-a9e8-25989fc26239/small/kbr-logo-final-2020-cmyk-png.png\"></a></p>\nSource: Kellogg Brown &amp; Root LLC.\n2025 GlobeNewswire, Inc.\n</div>",
      "widgetTitle": null
    },
    "relationships": {
      "acquireService": {
        "data": {
          "id": "16"
        }
      },
      "primaryTickers": {
        "data": [
          {
            "id": "2787"
          }
        ]
      },
      "secondaryTickers": {
        "data": []
      },
      "otherTags": {
        "data": []
      }
    },
    "links": {}
  },
  "included": [
    {
      "id": "16",
      "attributes": {}
    },
    {
      "id": "2787",
      "attributes": {},
      "links": {}
    }
  ]
}