{
  "data": {
    "attributes": {
      "commentCount": 0,
      "title": "KBR’s Methanol Technology Selected by Fikrat Al-Tadweer for the First Biomethanol Plant in Saudi Arabia",
      "publishOn": "2025-12-16T06:00:00.000-05:00",
      "lastModified": "2025-12-16T06:00:28-05:00",
      "widgetLinks": null,
      "content": "<div>\n<p><span class=\"location\" value=\"LU/us.tx.houstn\">HOUSTON</span>, Dec.  16, 2025  (GLOBE NEWSWIRE) -- KBR (<a href=\"https://seekingalpha.com/symbol/KBR\">KBR</a>) (NYSE: KBR) announced today that it has been awarded a contract for its PureM<sup>SM</sup> green methanol technology by <span class=\"person\" value=\"\">Fikrat Al-Tadweer</span> for a pioneering biomethanol plant in <span class=\"location\" value=\"LC/sa\">Saudi Arabia</span> for transforming landfill-gas into clean fuels.</p>  <p>KBR’s PureM solution is designed for commercial-scale deployment with a low cost of renewable methanol production. The technology can utilize a wide range of feedstocks, including biogas, gasification-derived syngas, hydrogen, and pure CO₂, enabling flexibility and efficiency. Under the terms of the contract, KBR will provide technology licensing, proprietary engineering design, catalyst, and proprietary equipment for the biomethanol facility.</p>  <p>“We are proud to support <span class=\"person\" value=\"\">Fikrat Al-Tadweer</span> in its groundbreaking biomethanol project, which aligns with Saudi Arabia’s national policy on eliminating landfill gas emissions and creating sustainable fuels,” said <span class=\"person\" value=\"APIN:2534421132\">Jay Ibrahim</span>, President, KBR Sustainable Technology Solutions. “This collaboration underscores KBR’s commitment to enabling global energy security and supporting the Kingdom’s vision for a cleaner, greener future.”</p>  <p>KBR has been a leader in innovative, sustainable process technology development, commercialization, and plant design solutions for over 50 years.</p>  <p>About KBR<br>We deliver science, technology and engineering solutions to governments and companies around the world. KBR employs approximately 37,000 people worldwide with customers in more than 80 countries and operations in over 29 countries. KBR is proud to work with its customers across the globe to provide technology, value-added services, and long-term operations and maintenance services to ensure consistent delivery with predictable results. At KBR, We Deliver.</p>  <p>Visit <a href=\"https://www.globenewswire.com/Tracker?data=7txMJTPOe--y_hbETYKxHIbJELc-fPA69aQd7uCxGe5-pQZAI9OLH_iJOtO_TBS7UTRoLwYKgR53lInYTEHDKA==\">www.kbr.com</a>.</p>  <p>Forward Looking Statements</p>  <p>The statements in this press release that are not historical statements, including statements regarding KBR’s PureM technology capabilities and related services, are forward-looking statements within the meaning of the federal securities laws. These statements are subject to numerous risks, uncertainties and assumptions, many of which are beyond the company’s control, that could cause actual results to differ materially from the results expressed or implied by the statements. These risks, uncertainties and assumptions include, but are not limited to, those set forth in the company’s most recently filed Annual Report on Form 10-K, any subsequent Form 10-Qs and 8-Ks and other U.S. Securities and Exchange Commission filings, which discuss some of the important risks, uncertainties and assumptions that the company has identified that may affect its business, results of operations and financial condition. Due to such risks, uncertainties and assumptions, you are cautioned not to place undue reliance on such forward-looking statements, which speak only as of the date hereof. Except as required by law, the company undertakes no obligation to revise or update publicly any forward-looking statements for any reason.</p>  <p>For further information, please contact:</p>  <p><em>Investors</em><br><span class=\"person\" value=\"\">Jamie DuBray</span><br>Vice President, Investor Relations<br>713-753-5082<br><a href=\"https://www.globenewswire.com/Tracker?data=hBXs_XmqM5l_DwkR6PjEzevo-CqCWhFUFEmjpuwICOWqEUxaKCq5MgIQttUPU6n-wv4U5-LAv7ssrmDbDYjv4KOwMypfnFqtJnNjNnLO7QM=\">Investors@kbr.com</a></p>  <p><em>Media</em><br><span class=\"person\" value=\"\">Philip Ivy</span><br>Vice President, Global Communications and Marketing <br>713-753-3800<br><a href=\"https://www.globenewswire.com/Tracker?data=fIUe1mnBDgv5Ycrd8mhAEM2v0Y-SUvxYuGHCnz10J8iHNe6yvDhdpZmUB1CltGTsSvRSuJ4EXlSaDyIEj074ztpPPFSxyJEKgnGmfA2YP00=\">MediaRelations@kbr.com</a></p> <img src=\"https://www.globenewswire.com/newsroom/ti?nf=OTYwMjMzNyM3MzIyMjk1IzIwMTY1MjE=\" alt=\"https://www.globenewswire.com/newsroom/ti?nf=OTYwMjMzNyM3MzIyMjk1IzIwMTY1MjE=\"> <br><img src=\"https://ml.globenewswire.com/media/MTc1MGViY2EtNjQ2MC00NGY4LWE2NjgtZWRkZTU0ZmFiZGQ0LTEwMjgwOTQtMjAyNS0xMi0xNi1lbg==/tiny/Kellogg-Brown-Root-LLC-.png\" alt=\"https://ml.globenewswire.com/media/MTc1MGViY2EtNjQ2MC00NGY4LWE2NjgtZWRkZTU0ZmFiZGQ0LTEwMjgwOTQtMjAyNS0xMi0xNi1lbg==/tiny/Kellogg-Brown-Root-LLC-.png\"><p><a href=\"https://www.globenewswire.com/NewsRoom/AttachmentNg/14b9b973-fab4-4178-a9e8-25989fc26239\"><img src=\"https://ml.globenewswire.com/media/14b9b973-fab4-4178-a9e8-25989fc26239/small/kbr-logo-final-2020-cmyk-png.png\" width=\"150\" height=\"83\" alt=\"https://ml.globenewswire.com/media/14b9b973-fab4-4178-a9e8-25989fc26239/small/kbr-logo-final-2020-cmyk-png.png\"></a></p>\nSource: Kellogg Brown &amp; Root LLC.\n2025 GlobeNewswire, Inc.\n</div>",
      "widgetTitle": null
    },
    "relationships": {
      "acquireService": {
        "data": {
          "id": "16"
        }
      },
      "primaryTickers": {
        "data": [
          {
            "id": "2787"
          }
        ]
      },
      "secondaryTickers": {
        "data": []
      },
      "otherTags": {
        "data": []
      }
    },
    "links": {}
  },
  "included": [
    {
      "id": "16",
      "attributes": {}
    },
    {
      "id": "2787",
      "attributes": {},
      "links": {}
    }
  ]
}