{
  "data": {
    "id": "4531351",
    "type": "fullArticle",
    "attributes": {
      "publishOn": "2022-08-08T01:57:07-04:00",
      "isLockedPro": false,
      "commentCount": 1,
      "gettyImageUrl": null,
      "videoPreviewUrl": null,
      "videoDuration": null,
      "themes": {
        "services": {
          "id": 17933,
          "slug": "services",
          "kind": "common",
          "path": "/stock-ideas",
          "title": "Services ",
          "non_theme": true
        },
        "transcripts": {
          "id": 49,
          "slug": "transcripts",
          "kind": "general",
          "path": "/earnings/earnings-call-transcripts",
          "title": "Transcripts"
        },
        "us": {
          "id": 326,
          "slug": "us",
          "kind": "common",
          "non_theme": true
        },
        "rental-leasing-services": {
          "id": 17979,
          "slug": "rental-leasing-services",
          "kind": "common",
          "non_theme": true
        },
        "industrials": {
          "id": 20,
          "slug": "industrials",
          "kind": "sector",
          "path": "/stock-ideas/industrial-goods",
          "title": "Industrial ",
          "sasource": "theme_breadcrumb"
        }
      },
      "title": "WillScot Mobile Mini Holdings Corp. (WSC) CEO Brad Soultz on Q2 2022 Results - Earnings Call Transcript",
      "summary": [],
      "isPaywalled": false,
      "structuredInsights": null,
      "lastModified": "2022-08-08T01:57:08-04:00",
      "isModerated": false,
      "availableTranslations": [],
      "locale": "en",
      "closestTradingDate": "2022-08-08",
      "beforeOpeningHours": true,
      "isEarningsSlides": false,
      "isExclusive": false,
      "isTranscript": true,
      "excludedByTag": false,
      "transcriptPath": "https://static.seekingalpha.com/cdn/s3/transcripts_audio/4531351.mp3",
      "likesCount": 0,
      "disabledStatus": "allowed",
      "disabledMessage": null,
      "status": "published",
      "disclosure": "",
      "articleActionableItem": null,
      "inEmbargo": false,
      "isNoindex": false,
      "isNoarchive": true,
      "content": "<p data-eci=\"true\">WillScot Mobile Mini Holdings Corp. (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/WSC\" title=\"WillScot Holdings Corporation\">WSC</a></span>) Q2 2022 Earnings Conference Call August 4, 2022 10:00 AM ET</p> <p><strong>Company Participants</strong></p> <p>Nick Girardi - Senior Director, Treasury and Investor Relations<br> Brad Soultz - Chief Executive Officer<br> Tim Boswell - President and Chief Financial Officer</p> <p><strong>Conference Call Participants</strong></p> <p>Faiza Alwy - Deutsche Bank<br> Andy Wittmann - Baird<br> Manav Patnaik - Barclays Capital<br> Scott Schneeberger - Oppenheimer<br> Brent Thielman - D.A. Davidson<br> Steven Ramsey - Thompson Research<br> Dillon Cumming - Morgan Stanley<br> Sean Wondrack - Deutsche Bank</p> <p><strong>Operator</strong></p> <p>Welcome to the Second Quarter 2022 WillScot Mobile Mini Earnings Conference Call. My name is Paulie and I will be your operator for today’s call. [Operator Instructions] Please note that this conference is being recorded. I will now turn the call over to Nick Girardi, Senior Director of Treasury and Investor Relations. Nick, you may begin.</p> <p><strong>Nick Girardi</strong></p> <p>Good morning and welcome to the WillScot Mobile Mini second quarter 2022 earnings call. Participants on today’s call include Brad Soultz, Chief Executive Officer and Tim Boswell, President and Chief Financial Officer. Today’s present material may be found on the Investor Relations section of the WillScot Mobile Mini website.</p> <p>Slide 2 contains our Safe Harbor statement. We will be making forward-looking statements during the presentation and our Q&amp;A session. Our business and operations are subject to a variety of risks and uncertainties, many of which are beyond our control. As a result, our actual results may differ materially from today’s comments. For a more complete description of the factors that could cause actual results to differ and other possible risks, please refer to the Safe Harbor statement in our presentation and our filings with the SEC.</p> <p>With that, I will turn the call over to Brad Soultz.</p> <p><strong>Brad Soultz</strong></p> <p>Thanks Nick. Good morning, everyone and thank you for joining us<span class=\"paywall-full-content invisible\"> today. I am Brad Soultz, CEO of WillScot Mobile Mini. We continue to execute our idiosyncratic growth strategy across multiple organic and inorganic levers irrespective of end markets and this quarter was no exception.</span></p> <p class=\"paywall-full-content invisible\">Before we dive into our performance in Q2, I’d like to start with our capital allocation. Capital allocation is fundamental to our strategy. From the Board to our executive leadership team to our branches, our jobs are to identify opportunities where we can drive the greatest value and returns across our portfolio. This is not just financial capital it is human capital. We have to orient over 5,000 colleagues and our supply chain partners across 300 locations towards the projects that have the biggest bang for their buck. It is an extreme luxury to have a plethora of opportunities in front of us that if reliably executed will continue to drive sustainable growth and returns irrespective of market conditions. .</p> <p class=\"paywall-full-content invisible\">First, and based on strong demand, we are fully funding organic CapEx. That means we’re investing in new portable storage units, modular refurbishment and our innovative Flex product and value-added products and services to keep pace with our demand. We anticipate landing about 13,000 new storage containers in 2022 and have increased modular production to support the increased modular deliveries, which were up 10% year-over-year. And following the successful rollout during the first half of the year, all of our storage branches can now offer VAPS furniture for our ground level office fleet.</p> <p class=\"paywall-full-content invisible\">Second, we are fully funding our tuck-in organic acquisition strategy – our tuck-in acquisition strategy. Over the last 12 months, we’ve acquired approximately 21,000 portable storage units and approximately 4,500 modular units, which demonstrates the scalability of our business. We expect that our tuck-in acquisitions from the last 12 months will contribute approximately $25 million of adjusted EBITDA year-over-year in 2022. So these are compounding powerfully with our organic growth initiatives and bring a host of other strategic operational and financial benefits.</p> <p class=\"paywall-full-content invisible\">Finally, we have employed our share repurchase authorization to great effect. Over the last 12 months, we repurchased $481 million of our common stock and stock equivalents. As of June 30, 2022, that represents almost 7% of our market cap. Recognizing our compounding free cash flow, our Board of Directors proactively replenished our share repurchase authorization back up to $1 billion in July of 2022. We often talk about the trifecta as it relates to operations, specifically pricing, value-added products and volumes. While there is also a trifecta for capital allocation and over the last 12 months, we are right in line with that framework that we laid out at our Investor Day in November of 2021 with over $1.1 billion of capital generated and allocated to net CapEx, M&amp;A and returns to shareholders. Thank you for trusting us as stewards of your capital.</p> <p class=\"paywall-full-content invisible\">Now focusing on Q2. Quotes and delivery levels were above prior year throughout the quarter for NA modular and NA storage. Modular volumes in NA modular were up 2.1% year-over-year and 2.4% year-to-date from the beginning of the year. About half of the year-to-date volume increase is organic and the other half is from M&amp;A. Portable storage units combined across North America modular and North America storage were up 24% year-over-year. End market strength continues to be broad-based. The Architectural Building Index has now expanded for 17 months in a row, giving us confidence in the non-resi markets well into 2023.</p> <p class=\"paywall-full-content invisible\">We won multiple projects across our diverse continued expansion with existing customers and orders from new customers for facility examples such as chip production, health care and education. Retail remodels continue, and we are supporting incremental inventory storage needs to accommodate the unpredictable time lines between receipt and consumption of inventory. Manufacturing also remained strong as we alluded to in the last quarter, partially driven by reshowing projects in the U.S. Combined with the immediate strength we are seeing in our year-over-year delivery volumes and all of our objective market indicators suggest end markets will remain supportive as we wrap up ‘22 and position for ‘23. And the multi-trillion dollar U.S. infrastructure bills would certainly further extend and provide additional tailwinds across our end markets starting in 2023.</p> <p class=\"paywall-full-content invisible\">Again, regardless of end market performance, we’re taking practical steps to engage our customers with combined strength of WillScot and Mobile Mini brands. We recently implemented strategies and tools to leverage our industry-leading data warehouse and transaction history to target cross-selling opportunities from our M&amp;A transactions. And although we’ll continue to improve the automation and lead sharing when we combine our two instances of selfforce.com in 2023, we are already seeing tangible results from our organic market penetration initiatives as evidenced in the 24% growth in volumes in portable storage units in North America. Value-added products penetration is also expanding in North America modular and continues to roll out as planned under our Mobile Mini brand aggregate, representing a $500 million organic revenue opportunity that is entirely within our control.</p> <p class=\"paywall-full-content invisible\">Now Tim is going to spend some time unpacking our rate performance during the quarter, but suffice it to say, modular is progressing in line with historical performance, and our team continues to exceed our high expectations in storage. Given the predictability and lease duration in our portfolio, we’ll enjoy the benefits from today’s rate trajectory and our results for years to come. Finally, given our performance throughout the first half of 2022, we’re raising our guidance by $40 million to adjusted EBITDA of $900 million to $940 million for 2022. At the midpoint, the new guidance represents a 24% increase relative to 2021. I am thrilled with our team’s performance and excited about our outlook for the remainder of the year and beyond.</p> <p class=\"paywall-full-content invisible\">With that, I will turn the call back to Tim.</p> <p class=\"paywall-full-content invisible\"><strong>Tim Boswell</strong></p> <p class=\"paywall-full-content invisible\">Thank you, Brad and good morning everyone. Page 20 shows a high level summary of the quarter. Our commercial momentum continues to accelerate, driven by strong leasing fundamentals and execution across all operating segments.</p> <p class=\"paywall-full-content invisible\">Leasing revenue was up 25% year-over-year, driven by pricing, value-added products and volume growth, supported by a steady cadence of acquisitions. Adjusted EBITDA was up 33% year-over-year and adjusted EBITDA margins expanded approximately 200 basis points both sequentially and year-over-year as we had indicated they would. Our updated adjusted EBITDA guidance of $900 million to $940 million implies increases between 22% and 27% versus 2021. And we continue to expect adjusted EBITDA margins to be up about 200 basis points for the full year as leasing revenues compound predictably and SG&amp;A continues to stabilize.</p> <p class=\"paywall-full-content invisible\">Return on invested capital in the quarter of 14.6% was up 430 basis points year-over-year. So our strategy to drive sustainable growth and returns is clearly working. And because we have a high degree of visibility into continued growth and ROIC expansion, we love our stock. We repurchased $250 million of shares and equivalents in the second quarter. And over the last 12 months, we repurchased $481 million of shares and equivalents, representing a 5.6% reduction of our economic share count. Overall, our business continues to perform ahead of expectations. We have a clear formula to drive sustainable growth and returns, and we are reinvesting accordingly in our business and in our stock.</p> <p class=\"paywall-full-content invisible\">Page 21 lays out revenue and adjusted EBITDA for the quarter. Year-over-year, we delivered a 26% increase to $582 million of revenue and a 33% increase to $233 million of adjusted EBITDA. Adjusted EBITDA margins expanded 200 basis points year-over-year and 240 basis points sequentially, and we saw strong margin expansion both at the gross margin and EBITDA margin level across all of our segments as well as at the consolidated net income level, driven by the steady compounding of pricing, value-added products and volumes at rates well in excess of cost inflation.</p> <p class=\"paywall-full-content invisible\">As we have said for the past few quarters, we expect EBITDA margins will be up approximately 200 basis points for the full year. And based on the acceleration in our lease revenue run rate, we’re confident that margins will be up meaningfully again in 2023. Pricing, in particular, will provide powerful revenue tailwinds for the next 18 to 24 months based on our forward visibility. In Q2, rental rates continued to progress predictably and the inflationary environment is supporting highly attractive spot rates that we will enjoy in future periods given our long lease durations.</p> <p class=\"paywall-full-content invisible\">Average rental rate increased by 16% year-over-year, inclusive of value-added products for modular units in North America Modular and by 23% year-over-year for portable storage units in North America storage. Delivered spot rates over the last 12 months are roughly 30% higher than average rates across the portfolio in the North America Modular segment and we have an approximately 25% spread in North America storage on our most recently delivered units relative to the portfolio average. Together, in North America modular and North America storage the natural convergence from average rates to recently delivered rates over our 3-year lease duration represents about a $200 million predictable organic revenue growth opportunity irrespective of market conditions.</p> <p class=\"paywall-full-content invisible\">While we are capitalizing on the inflationary pressures and supply chain constraints impacting our industry, it takes time for these benefits to compound in our lease revenues due to our long lease durations, which is why we are incrementally more confident today in our ability to deliver future pricing growth. In the immediate term, we are still experiencing significant cost inflation on inputs such as building materials and labor which continue to be up over 15% versus prior year and fuel prices remain up approximately 60% versus 2021. That said, our margins are up in all segments and on all revenue streams in Q2 despite the natural lag in our lease revenues. It is, therefore, reasonable to expect that our input cost inflation will begin to slow while our lease revenue continues to compound, which is why we’re confident in our revenue growth and margin expansion outlook heading into 2023.</p> <p class=\"paywall-full-content invisible\">Turning to Page 22, we generated $188 million of cash from operations, up 34% year-over-year. Net capital expenditures totaled $119 million, representing a $60 million increase year-over-year as we invest for growth. This increase was demand-driven as volumes continue to ramp and on a year-over-year basis and relative to our original expectations, we are seeing at least a 15% increase to our CapEx, which is attributable to input inflation. Modular refurbishment of approximately $50 million in Q2 effectively doubled versus Q2 of 2021, supporting over 1,000 units of organic volume growth year-to-date as well as inventory readiness. In the 3 months ended July, so our most recent data, modular work orders were up approximately 28% year-over-year and modular deliveries were up approximately 10% versus the same period in 2021. So we’re seeing elevated activity levels well into the third quarter. And while we are continuing to prioritize production in our branches to stay ahead of demand, these investments are entirely discretionary and within our control.</p> <p class=\"paywall-full-content invisible\">On the storage side of the business, we invested approximately $27 million for additional portable storage units in Q2 as our utilization exceeds 85%. We originally plan to purchase 8,000 new containers in 2022 all 8,000 units landed and were deployed in the first half of the year. Utilization remains elevated and rental rates are accelerating. So we’re landing an additional 5,000 units primarily in Q2 to support both core and seasonal demand. So in total, that represents approximately $70 million of growth capital into our storage segment in 2022, which is a record level for the legacy WillScot Mobile Mini business.</p> <p class=\"paywall-full-content invisible\">We invested approximately $20 million in value-added products to support continued growth in the modular segment and continued VAPS rollouts in our storage segment. We invested another $10 million across both the tank and pump and UK segments and we invested approximately $10 million in infrastructure, which includes our branch network, in the early phases of our CRM consolidation, which is planned for the first half of 2023.</p> <p class=\"paywall-full-content invisible\">Overall, it was a strong quarter for organic reinvestment and these investments are supporting a lease revenue run rate heading into 2023 and that is roughly 10% ahead of where we originally planned for 2022. Even with these record reinvestment levels, free cash flow is inflecting positively, up 25% sequentially from the first quarter. And based on the continued growth of operating cash flows and the tapering of capital expenditures in the second half of 2022, which I expect will be more in line with the second half of 2021, we have clear line of sight to achieving $500 million of free cash flow run rate heading into 2023.</p> <p class=\"paywall-full-content invisible\">Turning to Page 23, we maintained a constant leverage in the quarter given the continued favorable operating environment. In addition to net CapEx, we invested $46 million in four acquisitions. We also repurchased $250 million of common stock in warrants, retiring 7.2 million shares and share equivalents. Over the last 12 months, we reduced our economic share count by 5.6%, and in July, our Board replenished our share repurchase authorization to $1 billion, giving us flexibility to continue returning substantial value to shareholders.</p> <p class=\"paywall-full-content invisible\">On June 30, we closed the fourth amendment to our asset-backed credit facility. We increased the facility size from $2.4 billion to $3.7 billion to support the growth of our business, and we have approximately $1 billion of liquidity currently available under the facility and in addition to our own internally generated cash. We extended the term of the credit facility for 5 years now maturing in June 2027, and we reduced the interest rate spread by about 50 basis points, which partly offset broader benchmark rate increases. At current rates, our annual cash interest expense is approximately $130 million. We are incredibly grateful to our endorsement and I think the process was an incredible vote of confidence in our team, our strategy and our execution and the outcome is an incredibly flexible and cost-effective source of financing that supports our long-term growth plans.</p> <p class=\"paywall-full-content invisible\">Turning to Page 24, still my favorite page in the deck. As Brad discussed, our capital allocation over the last 12 months is consistent with our long-term framework. Our outlook suggests that our capacity to deploy capital will continue to grow, with continued compelling opportunities in organic CapEx, acquisitions and the repurchases of our own stock. In the last 12 months, on a leverage-neutral basis, we generated and allocated over $1.1 billion of capital, 31% or $358 million went to organic capital expenditures, 22% or $251 million has gone towards tuck-in acquisitions, and we used $481 million or 42% to repurchase approximately 5.6% of our economic share count. Executing our growth strategy, driving return on invested capital and smart capital allocation together will allow us to continue compounding shareholder returns predictably over time.</p> <p class=\"paywall-full-content invisible\">And to illustrate this predictable compounding, our updated outlook is on Page 25. Our leasing fundamentals of pricing, value-added products and volumes continue to exceed expectations. As such, we raised our adjusted EBITDA guidance by $40 million to $900 million to $940 million of adjusted EBITDA. At the midpoint of our guidance, it still implies about 200 basis points of margin expansion relative to 2021. Sequentially, we expect margins will expand modestly into Q3 as work order activity levels remain elevated, and margins should then expand significantly into Q4 of this year as modular work order activity slows down, and we get the full contribution of seasonal retail revenues in our storage segment. As I mentioned earlier, we expect capital expenditures to taper in the second half of the year and be more in line with the second half of 2021, but obviously, this is a significant year for growth investment and above our original expectations. As I think about the midpoint of the CapEx range of $350 million approximately $150 million of the total represents growth investments and approximately $175 million represents maintenance CapEx. And there is another $25 million or so of integration-related CapEx that should taper off in 2023. So our investments this year are roughly balanced between growth and maintenance and we have a very high degree of discretion over even the maintenance components given the long-live nature of our assets.</p> <p class=\"paywall-full-content invisible\">Looking into the second half of the year, as margins expand into Q4 and CapEx tapers, we expect our free cash flow run rate to accelerate to a $500 million run rate as we enter 2023, and then that run rate will grow through the course of 2023. Our rental revenue and EBITDA run rate for Q4 heading into 2023, is running approximately 10% ahead of where we expected at the outset of the year. So we’re capitalizing upon a favorable operating environment, accelerating growth, expanding ROIC, repurchasing our stock and establishing a stronger foundation from which we will build heading into 2023.</p> <p class=\"paywall-full-content invisible\">With that, Brad, I’ll hand it back to you.</p> <p class=\"paywall-full-content invisible\"><strong>Brad Soultz</strong></p> <p class=\"paywall-full-content invisible\">Thanks, Tim. We will continue to be thoughtful and diligent as we invest in our uniquely durable and resilient business and its powerful idiosyncratic growth levers. I’m pleased with our progress in the first half of 2022, and I’m excited with the outlook for the remainder of the year and beyond. Thank you to all of our stakeholders for their continued support. I wish all of you listening today continued safety and good health. This concludes our prepared remarks.</p> <p class=\"paywall-full-content invisible\">Operator, would you please open the line for questions?</p> <p id=\"question-answer-session\" class=\"paywall-full-content invisible\"><strong>Question-and-Answer Session</strong></p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">Thank you. [Operator Instructions] Your first question comes from the line of Faiza Alwy from Deutsche Bank. Your line is open.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Faiza Alwy</span></strong></p> <p class=\"paywall-full-content invisible\">Yes. Hi, good morning, and thank you. So you’ve had great results so far. I’m curious, as you know, there is macro uncertainty and recession risks heading into 2023. So could you give us a little bit more color in terms of how we should think about the resiliency of your business in a downside scenario, the flexibility that I think is inherent in your business and what the downturn model might look like for you?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Sure, Faiza, this is Tim. Thanks for the question. And it’s clearly one that’s been top of mind for many investors over the past couple of months. And frankly, I think it’s a scenario where WillScot’s likely performance is not well understood. First, I think you can assume from today’s commentary that we do not see anything in our lead indicators that would be consistent with an imminent recession. And we will enter 2023 with a lease revenue run rate that is roughly 10% higher than we originally expected, as I mentioned in my prepared remarks. We think we’ve put in place growth initiatives that would grow through any reasonable recession scenario, just like we did through the pandemic. The compounding could slow in a recession, but we believe we have a formula to deliver sustainable growth and returns irrespective of market conditions. So the best thing we can do to prepare for a recession is exactly what we’re doing today and is evident in our Q2 results. We’re growing our lease revenue run rate by driving pricing, volumes and value-added products. We’re consolidating our markets and revisiting capital allocation using our regular quarterly process.</p> <p class=\"paywall-full-content invisible\">So as we think about recession scenarios and the possibilities for 2023, there are basically five levers that we’re managing actively. The first is pricing. So the current spread between delivered spot rates and average monthly rates, creates massive insulation and visibility into future growth. If we just hold spot rates flat where they are today, we have a $200 million organic lease revenue opportunity. And based on that favorable spread, our pricing power and the impact of lease duration, it is difficult to conceive a recession scenario where pricing detracts from our lease revenue run rate. So it’s going to be a tailwind in all of our scenarios.</p> <p class=\"paywall-full-content invisible\">The second lever is value-added products. We continue to grow value-added products penetration on our modular storage and storage volumes regardless of whether we’re in a recession or an expansion. We’re still taking over a massive inconvenience in the supply chain for our customers and offering a highly differentiated value proposition. So our targets to drive VAPS revenue per delivered unit to $600 per unit per month in modular would not change in a recession nor would our rollout plans for storage VAPs. So this is a $500 million organic growth opportunity. It would be unchanged in a recession, and it represents another very powerful tailwind.</p> <p class=\"paywall-full-content invisible\">The third lever that everybody worries about is volume. In recessions, deliveries correlate with economic activity and would likely slow, but units on rent lag based on 3-year lease duration. So deliveries might decline in line with GDP or non-residential construction starts, but units on rent with customers remain on rent for their planned project duration, such that any unit on rent decline will lag the contraction. This is why our lease revenues are so stable and predictable. We saw this play out repeatedly, including the global financial crisis, peak oil in 2014 and through the pandemic. And more importantly, we’re better positioned than ever to capture market share organically through cross-selling and to defend our market position with acquisitions.</p> <p class=\"paywall-full-content invisible\">The fourth lever that you alluded to is our cost structure, which is roughly 50% variable. While we’re currently structured for growth, we can pivot very quickly as you saw during the pandemic. You’ll recall in 2020, our adjusted EBITDA margins expanded by 350 basis points year-over-year on a pro forma basis because we took variable cost out of the P&amp;L while continuing to grow our lease revenues. In contrast, we’re incurring variable cost headwinds today impacting both our gross margin and our SG&amp;A However, we can reverse those in a recession scenario.</p> <p class=\"paywall-full-content invisible\">And then the last lever that we’ve talked a lot about today is capital allocation. Our business has a strong countercyclical free cash flow profile. So as deliveries slow in a recessionary environment, CapEx and variable costs come down through our 90-day zero-based capital allocation process. And this opens up more capacity for deleveraging and acquisitions and share repurchases. In our most recent experience, free cash flow margin during the peak of the pandemic was approximately 20% versus 12% currently. And we have clear line of sight to returning to that level even in a growth environment.</p> <p class=\"paywall-full-content invisible\">So those are the levers we’re managing. We’ve managed them all before and it’s a normal part of our operating cadence here at WillScot Mobile Mini. We will enter any recession with more market share, a stronger value proposition, greater scale and better management tools relative to any prior cycle. And as we discussed today, our leading indicators like the Architectural Billings Index, prospects for infrastructure spending, near-term reshoring and manufacturing as well as our own sales initiatives have us quite confident in the volume component of our model well into 2023. So that’s a long response. Thanks for your patience, but it is very important that investors understand the levers that we have to drive growth and returns even in a macroeconomic contraction.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Faiza Alwy</span></strong></p> <p class=\"paywall-full-content invisible\">Great. Thank you, Tim. That was very helpful.</p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">Thank you. Your next question comes from the line of Andy Wittmann from Baird. Your line is open.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Andy Wittmann</span></strong></p> <p class=\"paywall-full-content invisible\">Great. Thanks for taking my question, guys. Good morning. I guess I wanted to just kind of ask on the storage segment in particular here. The 23% AMR growth really stood out. Obviously, over the last couple of quarters, you’ve been ramping it, but this 20% number almost seems like an outlier. So Brad, I was hoping you could talk a little bit about the market dynamics that are affording this and the sustainability of those and talk about any level of pushback that you’re getting on that, if any?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Brad Soultz</span></strong></p> <p class=\"paywall-full-content invisible\">Yes. Thanks, Andy. Yes, I think you have to start with the fact that up to the merger, container pricing had been flat for years. So, there was certainly let’s say, pent-up opportunity. I am – why wouldn’t represent 20% can continue forever. I’m starting to get more comfortable with double digit for a long time. We’re not receiving a lot of pushback. Again, the rates at which we’re delivering basically secure warehouse solutions to our customers’ location are still very affordable versus any alternative. Indeed, utilization is relatively high that is supportive of continuation. New container prices, right, are up 40% to 50% versus a couple of years ago, that’s very supportive of continued pricing. So I think it was a little bit of an untapped opportunity. The product positioning is another important one, Andy. If you think back relative to the pre-merger Mobile Mini, we were offering only a premium product with the patented tricam doors, a differentiated and very unique storage delivery and logistics capability. Well as the majority of the balance of the industry was offering basically ISO containers often delivered through third-parties. So we are offering both products as we go forward. We will continue to expand and scale our logistics capability to make sure whether a customer takes the standard product or our premium product, they’ll get the same white glove service, if you will. So I feel quite good. I think I get increased confidence every time I look at this every quarter. The team’s laser focused on it. Tim mentioned our 90-day sales and operating process. We talk a lot about the financial capital allocation. It’s a fully integrated also sales pricing in VAPS as well as human capital allocation, keeping everyone focused on the right levers. So I feel quite good about it, and I’m very proud of the team and all they have accomplished thus far.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Andy Wittmann</span></strong></p> <p class=\"paywall-full-content invisible\">Got it. Thank you. I guess for my follow-up question, maybe for Tim. You made some comments in the prepared remarks about orders and work orders being higher than deliveries, I guess that implies or suggest that repair, maintenance expenses are running ahead of the deliveries that obviously shows that you’ve got some baked-in demand that you’re trying to cater, but it also has the effect, I guess, of I guess, weighing on margins in the near-term, can you talk about how different today’s level of repair and maintenance expense is compared to maybe historical averages, so we can maybe get a better sense of how that is affecting the margins that you reported here in the quarter?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Yes, Andy, I’m happy to. And this gets to the inherent flexibility that we have in the cost structure of the business, which I don’t think is well understood. So on the storage side of the business, we’re running north of 85% utilization. And it is all hands on deck to get every viable container in rent-ready condition and delivered to customers, right? So we’re incurring, frankly, as much of that repair and maintenance expense as we can support through the availability of labor and materials. It’s running to the tune of about 10% of revenue in the storage business. You could easily see that dropping in half to 5% of revenue in a slower volume environment, and if you think about the quantity of fleet that is actually unavailable, we’re going to be pushing those levels, I think, below 5% of the total fleet by the end of the year, which is an extremely low level and extremely high fleet quality in the storage segment. We’ve got a similar dynamic in modular, and that’s where my prepared remarks were really, really focused with modular work orders up 28% year-over-year in the 3-month period ended July.</p> <p class=\"paywall-full-content invisible\">And to your point, that means we’re building rent-ready inventory, and that is a headwind in our Q2 results for leasing gross margin and the overall EBITDA margin in the business, which itself was up 200 basis points year-over-year. So as I mentioned in my remarks, we’re delivering these results. We’re delivering margin expansion despite kind of a volume-driven variable cost headwind and despite 15% input inflation in materials and labor. So all of that together makes me a lot more confident about margin expansion heading into future periods because we’re only beginning to see the real pricing benefits that we’re seeing in this environment.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Andy Wittmann</span></strong></p> <p class=\"paywall-full-content invisible\">That makes a lot of sense. If I’m afforded a follow-up to my follow-up, does the – in the modular side of the business, does the work orders or the repair and maintenance expense that you’re investing today, does that start to subside at all into 3Q or 4Q or do you feel like you’re setting up where you’re going to continue to have to work at elevated levels, and maybe that’s more of a ‘23 dynamic where you get all the revenue – the rental revenue from that and maybe a bit of a tailwind if the work orders were to drop off?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Yes. So I expect work order activity remains elevated in Q3. Work order activity in the modular business would typically come down a bit in Q4, just in terms of the nuance in our business. That’s why Q4 tends to be a seasonally stronger EBITDA margin quarter that’s a seasonal factor that’s not a commentary on our macroeconomic outlook. And then 2023 will be what it will be from a macro standpoint and a volume standpoint. So if the backdrop supports delivery levels at today’s level, then no, you wouldn’t get that margin expansion yet. If delivery levels were to come down, then absolutely, you would get a variable cost tailwind in the business, which, again, provides us a lot of insulation and then contributes to the countercyclicality of the free cash flow in the business.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Andy Wittmann</span></strong></p> <p class=\"paywall-full-content invisible\">Thank you.</p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">Thank you. Your next question comes from the line of Manav Patnaik from Barclays Capital. Your line is open.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Manav Patnaik</span></strong></p> <p class=\"paywall-full-content invisible\">Thank you. I guess you’ve answered all of the key questions here, but maybe just the guidance raise on the revenue and, I guess, EBITDA side, can you just break that down by how much was the incremental M&amp;A that you’ve done in there, just maybe parse that out a bit?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Yes. I mean, this is Tim. So the incremental M&amp;A is actually not a huge contributor. So in our original guidance for the year, I think we had about $17 million of EBITDA in the original guidance of, what was it, about $850 million of EBITDA at the midpoint of the original guide. And as Brad mentioned, we’ve got about $25 million of EBITDA for the year in the current guide. Now some of those transactions have taken place through the course of the year. So that $25 million is not a full annualized run rate of those acquisitions. But order of magnitude, you’re only talking about $8 or so million of incremental EBITDA in the revised guidance coming from acquisitions and the rest is organic and quite strong at that.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Manav Patnaik</span></strong></p> <p class=\"paywall-full-content invisible\">Got it. And then just maybe to follow-up, just on – I think you mentioned a few times the strong acquisition pipeline going through that. Can you just talk about how you would adjust that in the event of the slowdown or that power through even faster?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Look, we’ve said repeatedly that we will not miss a quality tuck-in acquisition and quality to mean us means quality fleet, quality people and quality customers. and that’s what we’re looking at when we’re evaluating M&amp;A transactions. The cadence of those transactions is often dictated by the sellers. These tend to be smaller, private, family-owned businesses. Maybe they have estate planning considerations, things of that nature. And we just want to make sure that we’ve got the right relationships so that we’re ready to partner with them when the time is right for the sellers. So our appetite is there currently. Our appetite would certainly be there in a recessionary environment, and we won’t miss a good deal out there.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Manav Patnaik</span></strong></p> <p class=\"paywall-full-content invisible\">Fair enough. Thank you, Tim.</p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">Thank you. Your next question comes from the line of Scott Schneeberger from Oppenheimer. Your line is open.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Scott Schneeberger</span></strong></p> <p class=\"paywall-full-content invisible\">Thanks very much. Good morning. I was hoping to speak a little bit on VAPS kind of on a fundamental level. Obviously, we can see what you report in the deck. But just curious how penetration is looking and how you think about it? I know you don’t necessarily share numbers on this. But in second quarter of the modulars that went out, roughly what percent had at least one item of VAPS? And how does that compare to years past? And then how many two items of VAPS, three items of VAPS, just some anecdotes about how you think about that and how you’re progressing there? And if multiple items of VAPs and going up the menu level could potentially push you ultimately higher in the numbers that you provided from the Investor Day? Thanks.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Brad Soultz</span></strong></p> <p class=\"paywall-full-content invisible\">Yes, Scott, it’s Brad and Tim can jump in here for needed. The reality is almost every unit going out has some level of VAPS. They have got steps and ramps right to get in the building, they have got insurance. What’s really been driving the growth is furniture. We tend not to talk about penetration by number of chairs and tables because it gets a bit nonsensical. And remember, we have a like a good, better and best tiered offering, right, across that portfolio. So if you back up to when we IPO-ed, we identified a target of achieving $400 of VAPS value per month. And we said, based upon the portfolio of furniture we had at the time that would represent about 80% of our units going out with VAPS. We’re now at $430. We are probably not quite at 80%. We are probably more than 60% to 70%, I would say, balanced penetration of units going out with furniture like a full accompany of furniture, but we have also seen pricing improvement and probably a shift across the tiers. So the $430 would imply, okay, we’ve clearly achieved the $400 target. We’re probably in that 60% to 70% of delivered opportunity for the penetration on the modular units. And as Tim referenced, we have set the target now from $400 up to $600. We have already got reps and in fact, full cities and MSAs that are writing at that level. So, we know it’s achievable. Again, it’s the same game. If you contrast that to kind of the average of the portfolio right now, which is at $2.66 on North America Modular, right, it’s that, that’s the spread that we have articulated that’s been evident over the – frankly, the course of the last 5 years. And what we will expect over time is the $430 delivered rate in modular converges the $260 up to the $430, right, now across about 87,000 units on rent. So, you can watch that chart. It’s – it was one of my favorite charts as well. It’s Page 12 in our investor deck, and it’s been very consistent every quarter. And the exciting part now is you are going to see the same playbook executed on the storage side.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Scott Schneeberger</span></strong></p> <p class=\"paywall-full-content invisible\">Excellent. Thanks. I appreciate that. For my follow-up, you all mentioned a little bit incremental, I think 5,000 more storage containers for core and seasonal. Curious if you can just share what you are seeing in seasonal this year, how it compares to last year, and what it may mean for future years? Thank you.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Scott, this is Tim. I think if you recall our commentary maybe 12 months ago, based on the strength in all of our core markets, we actually acknowledged at the time that we were going to miss some of the seasonal demand, and that will continue to be the case this year. although we are capturing more of it because of the driving fleet readiness, like I have talked about and because we are adding fleet to the storage branch network. So, year-over-year, I would expect contribution from seasonal could be $10 million or so of EBITDA higher than last year, and that will be spread between Q3 and Q4. One thing we are seeing from the retailers is they are taking equipment earlier, some delivering even here at the end of Q2 than in years past and holding on to it longer. And we have also pushed through meaningful and appropriate rental rate increases for those customers. The other thing I would just highlight is most of the seasonal focuses on our retail customers as we have deeper and more thoughtful discussions with the likes of Walmart and Target and Home Depot and Lowe’s, etcetera. We are finding more opportunities for both our storage and our modular value proposition that are kind of separate and distinct than traditional seasonal and store renovation demand. So, seasonal will be up this year as we look into 2023. I am actually equally excited about deepening the relationships with some of those national accounts.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Scott Schneeberger</span></strong></p> <p class=\"paywall-full-content invisible\">Excellent. Thanks so much. I will turn it over.</p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">Thank you. Your next question comes from the line of Phil Ng from Jefferies. Your line is open.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Unidentified Analyst</span></strong></p> <p class=\"paywall-full-content invisible\">Hey guys. It’s Maggie on for Phil. I guess first, going back to storage pricing. I know you have been doing a lot of good things there, getting the units on to your price optimization platform and doing some segmentation tools. Do you kind of see the next few quarters as a one-time step-up as you reset base rates and then getting back to that mid-single digit cadence that you have talked about at your Investor Day or is a double-digit growth rate sustainable? And then kind of adding on to that, I know the storage ops rollout started this quarter. So, maybe if you can talk about what the customer response has been and the uptake you are seeing relative to modular? Thanks.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Maggie, this is Tim. I will start by addressing – providing a bit more detail on your storage pricing question. And then Brad, maybe you can provide some color around storage value-added products, given it’s so early. As far as storage pricing goes, there are a lot of internal operational initiatives that you alluded to that are in place today. centralized quarterly pricing reviews as part of the sales and operating planning process that we do quarterly. Brad alluded to product positioning. Again, we have got basically a good, better, best tiered offering now within the storage fleet. And we are driving price differentiation with our Mobile Mini branded Tri-Cam’s and specialty products. And that’s really what’s been driving results since the merger through the end of Q2. We are not yet on a technology-enabled segmentation platform. As we consolidate our CRMs heading into the first part of 2023, we will also be combining our quoting tools in our pricing technology tools. So, I do think that is a potential opportunity as we look into 2023. In terms of pricing guidance for the rest of the year on storage, I am always a little bit careful here. But I do think we should see some sequential gains as we go into Q3 and Q4. And that’s going to be at least driven by the seasonal volume that will be flowing through the results. We will have to think about then how we set expectations for kind of Q1 and Q2 of 2023 as that seasonal volume likely rolls off. I would expect there could be some sequential stabilization there of pricing as seasonal volume comes off in the first half of 2023, but fully expect it will be up manfully year-over-year. So, that’s probably the best we can do on storage pricing for now. Brad, maybe you want to talk about storage VAPS?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Brad Soultz</span></strong></p> <p class=\"paywall-full-content invisible\">Yes. I think we mentioned in the prepared commentary, all the branches now offer the furniture for the ground level offices, and we are seeing that take off, I would say, in line with our expectations and the $50 million of opportunity we had attributed to furniture and gloves feels very attainable and then probably more exciting from my perspective as we begin to roll out the VAPS offering, if you will, for storage. We have introduced our basic package that’s just being implemented through the network, if you will. So, we are just really beginning to build the inventory required for that. And then as we have mentioned in prior calls, we will follow that next year with proprietary shelf and racking system. So, we mentioned in the Investor Day, we thought there was another $50 million of VAPS opportunity associated with VAPS and containers themselves, again, I think that’s very attainable. Just keeping in mind it takes several years to achieve it on a leading edge or a spot rate and then the kind of 30 months, if you will, for the fleet to roll over on itself. So, all these together are the kind of the underpinning, if you will, of that $500 million of organic growth opportunity that I mentioned in the prepared comments, that’s completely within our control.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Unidentified Analyst</span></strong></p> <p class=\"paywall-full-content invisible\">Great. That’s super helpful. And then, Tim, on the CapEx guide, thanks for giving the color between maintenance and growth. But I guess, just the incremental increase for the full year. Can you kind of size up which categories you are stepping up investments. And then looking out to next year, is there any pull forward this year we should be mindful of, or how should we be thinking about CapEx in the next few years compared to the guide this year?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Yes. There is certainly no pull forward. We are basically investing and growing and maintaining utilization levels in the storage. And really, the bulk of the modular investments going to refurbishment, which I talked about on – in my prepared remarks and in some of the Q&amp;A. So, the biggest increases are modular refurbishment and buying storage containers that is entirely demand-driven and entirely volume driven. And the guidance for next year is going to be dependent on what is the demand equation that we think that we are facing. So, I mentioned that $70 million, for example, of container purchases this year is a company record for the legacy Mobile Mini business. If environments stay as they are right now, we will absolutely be expanding the fleet organically in 2023. So, I think the current guidance for this year is reflective of the macroeconomic and demand backdrop for this year. And we have given some different goalposts, right. I mean you saw where CapEx was back during 2020 during the height of the pandemic, and that was a pretty meaningful reduction from current levels. And we have also given you guideposts around approximately 25% of our available capital as the company grows. We think we can deploy to organic CapEx. So, we have tried to give you and investors kind of some goalposts and we will operate within those goalposts depending on the demand backdrop.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Unidentified Analyst</span></strong></p> <p class=\"paywall-full-content invisible\">Alright. Thanks.</p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">Thank you. Your next question comes from the line of Brent Thielman from D.A. Davidson. Your line is open.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Brent Thielman</span></strong></p> <p class=\"paywall-full-content invisible\">Hi. Great. Thank you. Good morning. Tim, you seem to hit this earlier in your comments about the retailers wanting to get the product a bit sooner. I am just wondering if you are seeing any indications more broadly in terms of a change in your lease duration for either of your major product categories, it seems like supply chain, labor disruptions are extending timeframes to get things done. So, just wondering if that’s having a knock-on effect on keeping the assets in the field longer?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Hi Brent, this is Tim. I can’t say I can point to anything in our immediate results. I mean there has been a long – a decades-long trend in our modular business towards a lengthening of effective duration. And I think that is driven by a lot of factors, end markets that we serve, lengthening of construction projects, some of the incentives in our own structure in terms of duration-based pricing and compensation of our sales reps. But other than maybe the order activity from the retailers, which is kind of a unique segment that’s primarily served by our storage business currently, I can’t point to anything else from a duration standpoint, Brent.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Brent Thielman</span></strong></p> <p class=\"paywall-full-content invisible\">Okay. Fair enough. And then the dynamics in the UK, I think you have talked before about the mix shift in favor of containers. You had some previous COVID demand on modular. I just look at the quarter-over-quarter comparisons and not quite as strong as what you are seeing here in the U.S. Just curious maybe the dynamics you are seeing in that market, recognize it’s smaller?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Yes, it’s smaller. And actually, I am quite pleased with the UK results. And remember, there is a pretty meaningful year-over-year foreign currency impact if you are looking at the UK results in U.S. dollars. If I look at UK results in British pounds, we have revenue that was up about 4% year-over-year. EBITDA is up 10% year-over-year. EBITDA margins are up 250 basis points year-over-year, so actually ahead of the company average. To your point, container utilization is pushing 90%, so very highly utilized, and we are getting pricing again in British pounds. The one area of softness is the modular utilization in the UK. That did taper off primarily around the Q4 and Q1 timeframe. But that’s the only weaker metric in the UK business. Overall, it’s doing extremely well and very pleased for how they are navigating a challenging market in the UK right now.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Brent Thielman</span></strong></p> <p class=\"paywall-full-content invisible\">Okay. Great. Thank you.</p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">Thank you. Your next question comes from the line of Steven Ramsey from Thompson Research. Your line is open.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Steven Ramsey</span></strong></p> <p class=\"paywall-full-content invisible\">Good morning. In May, you talked about the strongest order book that you have ever seen. Maybe can you clarify if it’s gotten incrementally stronger since then? And within that order book, have you seen any pickup in cancellations?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Brad Soultz</span></strong></p> <p class=\"paywall-full-content invisible\">Yes. This is Brad. I mean I would characterize the order book is still at very high levels, probably record levels if we could actually go back on pro forma. It’s been more stable as we would have expected from second quarter and third quarter, right. Tim mentioned before, there is a little bit of a seasonality aspect of the modular business, and I am commenting primarily and initially on the modular side of the house. So, the third quarter has progressed as we would have expected. Order rates continue to be in line with our expectations. So, we – again, that’s the basis upon which we say we feel good about demand on the modular side for the balance of the year and heading into next year. I think Tim’s covered off kind of the nuances, if you will, with respect to storage, particularly as retail is kind of on the opposite cycle there heading into the fourth quarter. So, very solid order books, as we said before, and certainly in line with our expectations and the basis for our outlook as we head into 2023.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Steven Ramsey</span></strong></p> <p class=\"paywall-full-content invisible\">Okay. Helpful. And then second thing on leverage currently, over the high end in a modest way, but EBITDA and free cash flow rising into the second half. Does this leverage level you are at now, does it mean you will slow acquisitions or share repurchases or keep the foot on the gas?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">We will keep the foot on the gas to the extent there is – we have got visibility into where we are headed, right. And we absolutely feel that way right now. The way to think about leverage is in any given quarter, if we want to be below 3.5, we could be there, right. So, whether or not we do that is going to be a function of what acquisition opportunities do we have in front of us. I have already said we won’t miss one that we like. What organic opportunities do we have in front of us, and we see a lot of that right now. And frankly, Q2 represented a pretty attractive opportunity to accelerate the share repurchases, right. So, we will be looking at all of those things as we decide, okay, do we want to stay at 3.7, should we let it tick down to 3.6 or lower. But just know that, that decision is 100% at our discretion. We have got a very high degree of control over CapEx, the M&amp;A pipeline and obviously the share repurchase appetite. And if any period, we want to be within that 3x and 3.5x leverage range, we can be there.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Steven Ramsey</span></strong></p> <p class=\"paywall-full-content invisible\">It makes sense. Thanks.</p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">Thank you. Your next question comes from the line of Dillon Cumming from Morgan Stanley. Your line is open.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Dillon Cumming</span></strong></p> <p class=\"paywall-full-content invisible\">Great. Good morning. Thanks for the question. If I can just ask one of the guidance. I think the midpoint kind of implies that the rate of year-on-year margin expansion kind of only improved slightly in 2H, considering you already did about 200 bps in 2Q. Just given there is clearly a strong level of cost execution in the business, right. The lease run rate is improving through year end. I would think delivering insulation comps are also be getting easier in the back half. I guess what else has to go right for you in terms of generating kind of margin expansion greater than that 200 bps for the full year? And I guess like related to that, how conservative would you kind of characterize that revised guidance in that respect?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">Hi Dillon, this is Tim. I feel good about the 200 basis points for the full year that we have been pretty consistent really going back to November on that point. The reality is Q1 was down a bit, right. And so now we have recouped 200 basis points or 240 sequentially in Q2. I expect that remains kind of margins remained flattish going into Q3, and that’s predicated on modular refurbishments in particular, staying at a pretty elevated level. If modular refurbishments were to actually come down, that would be a margin opportunity. And if modular refurbishments were to accelerate from here, that could actually pressure the margin. But our base case is for modest EBITDA margin expansion going into Q3 and then pretty strong expansion going into Q4. And that’s, again, predicated on modular furbishments slowing down seasonally in Q4, and executing on the retail business in the Storage segment, which we have talked a lot about today. It’s still overall retail and wholesale trading like 11% of revenue. So, I don’t want to blow it out of proportion, but it is going well this year.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Dillon Cumming</span></strong></p> <p class=\"paywall-full-content invisible\">Okay. That’s helpful. Thank Tim. And then maybe just a longer term question, I guess on the infrastructure side. You guys mentioned in the prepared remarks that you were pretty bullish kind of going into next year. Just kind of curious where you are seeing the nearest term opportunities on that front in terms of your end market mix and whether you are expecting the kind of activity on the infra side to kind of step up more significantly in 4Q into next year from a time perspective?</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"answer\">Tim Boswell</span></strong></p> <p class=\"paywall-full-content invisible\">I am sorry. This is Tim, Dillon. So, on the infrastructure side, we are having planning discussions with our larger national general contractor clientele. They are booked through the end of 2022. They are beginning to have planning discussions around infrastructure-related projects, but they are not in our results in 2022, and we don’t expect them to start in 2022. So, at best, I think we are looking at mid-2023 project starts, which then translate into volume tailwinds for both sides of our business. And as you think about our end market exposure, it’s roughly 40% by customer SIC code will be construction related. Clearly, those customers will be pulled into infrastructure-related projects, and then they will pull us into those projects. But if you look across commercial and industrial, manufacturing clearly is a strong end market right now. I expect that continues in 2023. We have talked a lot about retail, wholesale trade and distribution. Energy and natural resources, obviously, there is a U.S. investment directed in that area. The larger utilities and even some of the green infrastructure players would be among our clientele. So, as I look top to bottom across our end markets, I think it’s easy to pick out key customers that will benefit from that type of spending in 2023. It’s just a little bit hard sitting here today to pinpoint when the projects are going to start.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Dillon Cumming</span></strong></p> <p class=\"paywall-full-content invisible\">Okay. Great. Thank you.</p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">Thank you. Your next question comes from the line of Sean Wondrack from Deutsche Bank. Your line is open.</p> <p class=\"paywall-full-content invisible\"><strong><span class=\"question\">Sean Wondrack</span></strong></p> <p class=\"paywall-full-content invisible\">Thank you. All my questions have been answered.</p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">We have now reached the end of today’s call. I will now turn the call back over to Nick.</p> <p class=\"paywall-full-content invisible\"><strong>Nick Girardi</strong></p> <p class=\"paywall-full-content invisible\">Thank you very much for your interest in WillScot Mobile Mini. If you have any questions, please contact me. Thank you.</p> <p class=\"paywall-full-content invisible\"><strong>Operator</strong></p> <p class=\"paywall-full-content invisible\">Thank you, ladies and gentlemen. This concludes today’s conference. You may now disconnect.</p>",
      "quickInsights": null,
      "twitContent": "WillScot Mobile Mini Holdings Corp. (WSC) CEO Brad Soultz on Q2 2022 Results - Earnings Call Transcript $WSC #stockmarket #markets #finance https://seekingalpha.com/article/4531351-willscot-mobile-mini-holdings-corp-wsc-ceo-brad-soultz-on-q2-2022-results-earnings-call?source=tweet",
      "innerMarketing": "",
      "marketingBullet": "",
      "isReit": false,
      "videoData": null,
      "marketingBulletVariant": null,
      "marketingBio": null,
      "audioDuration": null,
      "originalTitle": "WillScot Mobile Mini Holdings Corp. (WSC) CEO Brad Soultz on Q2 2022 Results - Earnings Call Transcript"
    },
    "relationships": {
      "author": {
        "data": {
          "id": "44211",
          "type": "author"
        }
      },
      "sentiments": {
        "data": []
      },
      "primaryTickers": {
        "data": [
          {
            "id": "578123",
            "type": "tag"
          }
        ]
      },
      "secondaryTickers": {
        "data": []
      },
      "otherTags": {
        "data": [
          {
            "id": "96991",
            "type": "tag"
          },
          {
            "id": "578123",
            "type": "tag"
          },
          {
            "id": "17933",
            "type": "tag"
          },
          {
            "id": "49",
            "type": "tag"
          },
          {
            "id": "586376",
            "type": "tag"
          },
          {
            "id": "326",
            "type": "tag"
          },
          {
            "id": "17979",
            "type": "tag"
          }
        ]
      },
      "coAuthors": {
        "data": []
      },
      "presentations": {
        "data": []
      },
      "updates": {
        "data": []
      },
      "corrections": {
        "data": []
      }
    },
    "links": {
      "self": "/article/4531351-willscot-mobile-mini-holdings-corp-wsc-ceo-brad-soultz-on-q2-2022-results-earnings-call",
      "canonical": "https://seekingalpha.com/article/4531351-willscot-mobile-mini-holdings-corp-wsc-ceo-brad-soultz-on-q2-2022-results-earnings-call",
      "uriImage": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
      "schemaImage": null
    }
  },
  "included": [
    {
      "id": "44211",
      "type": "author",
      "attributes": {
        "company": null,
        "slug": "sa-transcripts",
        "userId": 101639,
        "tagId": 96991,
        "bio": "Seeking Alpha's transcripts team is responsible for the development of all of our transcript-related projects. We currently publish thousands of quarterly earnings calls per quarter on our site and are continuing to grow and expand our coverage. The purpose of this profile is to allow us to share with our readers new transcript-related developments. Thanks, SA Transcripts Team",
        "image": {
          "small": "https://seekingalpha.com/images/users_profile/000/101/639/small_pic.png",
          "medium": "https://seekingalpha.com/images/users_profile/000/101/639/medium_pic.png",
          "big": "https://seekingalpha.com/images/users_profile/000/101/639/big_pic.png",
          "extra_large": "https://seekingalpha.com/images/users_profile/000/101/639/extra_large_pic.png"
        },
        "nick": "SA Transcripts",
        "deactivated": null,
        "memberSince": 2007,
        "isRss": false,
        "contributorSince": 2013,
        "followersCount": 157429
      },
      "relationships": {
        "user": {
          "data": {
            "id": "101639",
            "type": "user"
          }
        },
        "userBioTags": {
          "data": [
            {
              "id": "958652",
              "type": "userBioTag"
            }
          ]
        },
        "authorResearch": {
          "data": null
        }
      },
      "links": {
        "self": "/author/sa-transcripts",
        "profileUrl": "/author/sa-transcripts",
        "site": null,
        "linkedinUrl": null,
        "twitterUrl": null
      }
    },
    {
      "id": "578123",
      "type": "tag",
      "attributes": {
        "slug": "wsc",
        "name": "WSC",
        "company": "WillScot Holdings Corporation",
        "tagKind": "Tags::Ticker",
        "equityType": "stocks",
        "exchange": "NASDAQ",
        "fundTypeId": 0,
        "isDefunct": false,
        "currency": "USD",
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {
        "self": "/symbol/WSC"
      }
    },
    {
      "id": "96991",
      "type": "tag",
      "attributes": {
        "slug": "sa-transcripts",
        "name": "SA Transcripts",
        "company": null,
        "tagKind": "Tags::AuthorTag"
      },
      "links": {
        "self": "/author/sa-transcripts"
      }
    },
    {
      "id": "17933",
      "type": "tag",
      "attributes": {
        "slug": "services",
        "name": "Services",
        "company": null,
        "tagKind": "Tag"
      },
      "links": {
        "self": "/tag/services"
      }
    },
    {
      "id": "49",
      "type": "tag",
      "attributes": {
        "slug": "transcripts",
        "name": "Transcripts",
        "company": null,
        "tagKind": "Tag"
      },
      "links": {
        "self": "/tag/transcripts"
      }
    },
    {
      "id": "586376",
      "type": "tag",
      "attributes": {
        "slug": "has-audio",
        "name": "Has Audio",
        "company": null,
        "tagKind": "Tag"
      },
      "links": {
        "self": "/tag/has-audio"
      }
    },
    {
      "id": "326",
      "type": "tag",
      "attributes": {
        "slug": "us",
        "name": "United States",
        "company": null,
        "tagKind": "Tags::Country"
      },
      "links": {
        "self": "/articles?filters=us"
      }
    },
    {
      "id": "17979",
      "type": "tag",
      "attributes": {
        "slug": "rental-leasing-services",
        "name": "Rental & Leasing Services",
        "company": null,
        "tagKind": "Tag"
      },
      "links": {
        "self": "/tag/rental-leasing-services"
      }
    }
  ]
}