{
  "data": {
    "id": "4532844",
    "type": "fullArticle",
    "attributes": {
      "publishOn": "2022-08-11T01:15:53-04:00",
      "isLockedPro": false,
      "commentCount": 0,
      "gettyImageUrl": null,
      "videoPreviewUrl": null,
      "videoDuration": null,
      "themes": {
        "transcripts": {
          "id": 49,
          "slug": "transcripts",
          "kind": "general",
          "path": "/earnings/earnings-call-transcripts",
          "title": "Transcripts"
        },
        "canada": {
          "id": 34503,
          "slug": "canada",
          "kind": "country",
          "path": "/market-outlook/global-investing/analysis/canada",
          "title": "Canada"
        },
        "industrials": {
          "id": 20,
          "slug": "industrials",
          "kind": "sector",
          "path": "/stock-ideas/industrial-goods",
          "title": "Industrial ",
          "sasource": "theme_breadcrumb"
        }
      },
      "title": "Element Fleet Management Corp (ELEEF) CEO Jay Forbes on Q2 2022 Results - Earnings Call Transcript",
      "summary": [],
      "isPaywalled": false,
      "structuredInsights": null,
      "lastModified": "2022-08-11T01:15:55-04:00",
      "isModerated": false,
      "availableTranslations": [],
      "locale": "en",
      "closestTradingDate": "2022-08-11",
      "beforeOpeningHours": true,
      "isEarningsSlides": false,
      "isExclusive": false,
      "isTranscript": true,
      "excludedByTag": false,
      "transcriptPath": "https://static.seekingalpha.com/cdn/s3/transcripts_audio/4532844.mp3",
      "likesCount": 0,
      "disabledStatus": "allowed",
      "disabledMessage": null,
      "status": "published",
      "disclosure": "",
      "articleActionableItem": null,
      "inEmbargo": false,
      "isNoindex": false,
      "isNoarchive": true,
      "content": "<p data-eci=\"true\">Element Fleet Management Corp (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/ELEEF\" title=\"Element Fleet Mgmt Corp.\">ELEEF</a></span>) Q2 2022 Earnings Conference Call August 10, 2022 7:00 PM ET</p> <p><strong>Company Participants</strong></p> <p>Jay Forbes - CEO, President &amp; Executive Director<br> Frank Ruperto - EVP &amp; CFO</p> <p><strong>Conference Call Participants</strong></p> <p>Paul Holden - CIBC<br> Geoff Kwan - RBC Capital Markets<br> Tom MacKinnon - BMO Capital Markets<br> Jaeme Gloyn - National Bank Financial<br> Shalabh Garg - Veritas Investment Research</p> <p><strong>Operator</strong></p> <p>Thank you for standing by. This is the conference operator. Welcome to the Element Fleet Management Second Quarter 2022 Financial and Operating Results Conference Call. [Operator Instructions]. </p> <p>Element wishes to remind listeners that some of the information in today's call includes forward-looking statements. These statements are based on assumptions that are subject to significant risks and uncertainties and the company refers you to the cautionary statements and risk factors in its year-end and most recent MD&amp;A as well as its most recent AIF for a description of these risks, uncertainties and assumptions. Although management believes that the expectations reflected in the statements are reasonable, it can give no assurance that the expectations reflected in any forward-looking statements will prove to be correct. Element's earnings, press release, financial statements, MD&amp;A, supplementary information document, quarterly investor presentation and today's call include references to non-GAAP measures, which management believes are helpful to present the company and its operations in ways that are useful to investors. A reconciliation of these non-GAAP measures to IFRS measures can be found in the MD&amp;A.</p> <p>I would now like to turn the call over to Jay Forbes, President and Chief Executive Officer of Element. Please go ahead.</p> <p><strong>Jay Forbes</strong></p> <p>Thank you, operator, and good evening to all of you joining us on tonight's call to discuss Element's second quarter results and the organization's progress in advancing its 3 strategic growth priorities. Like last quarter, Frank and I will<span class=\"paywall-full-content\"> be brief in our prepared remarks supporting us ample time for your questions and discussion.</span></p> <p class=\"paywall-full-content\">As you might imagine, everyone here at Element is delighted with the record second quarter and first half results we shared with you earlier this evening. My executive team and I have long understood the value that our transformed business model and reinvigorated sales efforts, we're going to create for Element and all of its stakeholders. However, first, the pandemic and then more recently, OEM production delays have hidden or deferred much of this substantial value. With the progression towards a more normal operating environment over the last 7 months, I believe the true value creation potential of our business has become readily apparent to all.</p> <p class=\"paywall-full-content\">In the second quarter, our business grew and improved by virtually every measure, both quarter-over-quarter as well as compared to our Q2 results last year. Our organic revenue growth strategy has resulted in more blue-chip clients entrusting more vehicles under management to Element, subscribing to and utilizing more of our services and doing so at higher price points, which benefit our cost-plus model. Our advancement of a capital-lighter business model via syndication and service revenue growth has allowed us to reduce our capital requirements, generating excess cash that is being returned to shareholders by way of growing common dividends and share buybacks. And the resulting significant reduction in our share count has amplified our free cash flow and earnings growth on a per share basis.</p> <p class=\"paywall-full-content\">Importantly, this performance was achieved against the backdrop of macroeconomic uncertainty and continued supply chain challenges for our OEM partners, which speaks volumes about both the resilience of our business model and the value creation potential of our 3-pronged growth strategy. We can trace much of this success to our 2,500 employees who help our clients and their drivers operate safer, smarter and more productive fleets every day.</p> <p class=\"paywall-full-content\">Element's fees in specialists supported by transformed processes and systems deliver our value proposition to clients by facilitating ready access to cost-efficient capital, lowering the total cost of operating clients' vehicles and eliminating fleet-related administrative burden. We believe this value proposition has even greater resonance with our clients and prospective clients given current macroeconomic trends. For instance, rising vehicle parts and labor cost should make our scale as market leader, even more attractive. With approximately 1.5 million vehicles under management, we offer the greatest purchasing power, the largest data set for cost optimization and the most extensive supplier network to lower client costs.</p> <p class=\"paywall-full-content\">Our proactive complementary client consulting services in the first half of this year alone, identified some CAD430 million of opportunities to reduce our clients' fleet operating costs. Further, rising interest rates should make our securitization and syndication enabled financing, all the more compelling. Secular trends are also serving as tailwinds. For example, given the increasing imperatives of ESG and the ability of electric vehicles to advance the sustainability agenda, our experience shepherding organizations through this complex change in automotive technology is of significant interest to current and prospective clients alike.</p> <p class=\"paywall-full-content\">As a company, we pride ourselves on our say-do ratio. And the last 4 years have provided ample opportunity for us to come good on our commitments, transforming Element's business, deleveraging and maturing our balance sheet, ridding ourselves of noncore distractions, staying our strategic course through the pandemic, pivoting the company to focus on organic revenue growth, improving our ability to deliver that growth despite the headwinds of 2021 and 2022. These are all examples of things that we have said and done. Culturally, this is how accountable leadership is defined within Element, making commitments and then seeing them through to completion.</p> <p class=\"paywall-full-content\">As accountable leaders, we will continue to advance our 3 strategic growth priorities for the foreseeable future. Growing net revenue organically and profitably, evidenced by expanding margins that demonstrate the scalability of our industry-leading operating platform, advancing our capital-lighter business model by growing services revenue and strategically syndicating fleet assets, thereby enhancing returns on equity and growing free cash flow per share, enabling the predictable return of excess equity to shareholders, first, by generously growing our common dividend on an annual basis and second, by repurchasing both common and preferred shares. Our business is distinctly well positioned for sustainable performance right now, making Element not just a safe haven, but a low risk source of growth for investors in these turbulent times.</p> <p class=\"paywall-full-content\">With that, I'll turn things over to you, Frank.</p> <p class=\"paywall-full-content\"><strong>Frank Ruperto</strong></p> <p class=\"paywall-full-content\">Thank you, Jay, and good evening, everyone. As promised, I will be brief, and then we will open the line for your questions. To me, Element's record second quarter and first half results are among other things, another set of proof points. They proved that our organization is executing the right strategy to create value for all of our stakeholders; our clients, our employees, our business long term and our investors. Q2 was an incredibly strong quarter top to bottom. Element generated CAD288 million of net revenue, which is a single quarter record, 22.4% more than Q2 last year and 10.5% more than last quarter. Operating margin was 57.6%, which is 390 basis points wider than last year and 280 basis points wider than last quarter. Adjusted earnings per share of CAD0.29 were CAD0.09 per share more than Q2 last year and CAD0.05 per share more than last quarter.</p> <p class=\"paywall-full-content\">Capital-light services revenue of CAD150 million is 32.6% better than last year and 13.8% better than last quarter. Combining that services revenue and CAD14.8 million of syndication revenue enhanced our pretax return on common equity to 16.8%. And lastly, but we think most importantly in terms of evaluating Element's performance, second quarter free cash flow per share grew materially to CAD0.37, which is CAD0.11 more than we generated in Q2 last year and CAD0.08 more than last quarter.</p> <p class=\"paywall-full-content\">Excluding the roughly CAD8 million of second quarter revenue generated by actions that are not expected to generate similar levels of revenue next year, Element still had a very, very strong Q2. CAD280 million of net revenue would still be the most Element has ever generated in a single quarter, 18.8% growth from last year and 7.2% growth over last quarter. 56.3% operating margins would be 260 basis points wider than for Q2 last year and 150 basis points wider than last quarter. Adjusted EPS of CAD0.27 is CAD0.07 more than last year and CAD0.03 more than last quarter and free cash flow of CAD0.35 per share would still be CAD0.09 more than we generated in Q2 last year and CAD0.06 more than last quarter.</p> <p class=\"paywall-full-content\">The CAD8 million in nonrecurring revenue recorded in the second quarter is a portion of the approximately CAD25 million in one-time revenues we expect to earn in 2022. These revenues vary greatly by type, but share the similar characteristics that they are discrete and unlikely to recur in nature. Providing a whole host of service offerings and financing for nearly 1.5 million vehicles across 5 countries in a period of unprecedented change has presented us with an equally unprecedented opportunity to generate incremental one-time revenues. For this reason, our Q2 supplementary offers guidance as to both the results we expect to report at year-end and an organic version thereof, excluding the estimated CAD25 million of revenue that we believe to be unique to 2022. Both versions constitute a material increase in 2022 guidance driven by the powerful fundamentals of our resilient business model.</p> <p class=\"paywall-full-content\">The purpose of providing an organic set of full year 2022 results is to help you better assess and model Element's 2023 performance. Like last year, we plan to provide full year 2023 results guidance as part of November's Q3 disclosures. In the meantime, we are happy to reiterate that we believe Element's 2023 performance will be superior to that we offered in November last year, which we now consider understated. Returning for a moment to our full year 2022 guidance, it's important to note that those results do not include any benefit from originating the significant excess order backlog we continue to maintain, which is roughly CAD1.8 billion at Q2 quarter-end and therefore, represents the same CAD40 million to CAD65 million of deferred net revenue, AOI and free cash flow as had been the case for the past 2 quarters.</p> <p class=\"paywall-full-content\">Looking ahead at the balance of this year, I would offer that Q2 is likely to have been the strongest single quarter of 2022, benefiting greatly from macroeconomic trends, increased utilization, strong originations and a solid book of onboarded business wins. That said, Q3 and Q4 will each be very strong as well and evidence material growth over the same quarters in prior year 2021, respectively. The second and last thing I want to flag quickly before we get to your questions is the fact that management and our Board of Directors revisit Element's common share dividend annually ahead of our Q3 results report out every November.</p> <p class=\"paywall-full-content\">As we've communicated before, going forward, the plan is to maintain a common dividend payout range of between 25% and 35% of Element's last 12 months free cash flow per share. At June 30, our common dividend was 25.4% of last 12 months free cash per share, which is at the bottom end of our range. We will provide you any news applicable to our common dividend in 3 months' time and again, offer our full year 2023 results guidance then too. Lastly, please hold the morning of Tuesday, November 29 this year in your calendar for an Element Investor Day here in Toronto as well as online for those who may be unable to join us in person. An official save the date and further details will be distributed shortly.</p> <p class=\"paywall-full-content\">For now, operator, let's please open the line for questions.</p> <p id=\"question-answer-session\" class=\"paywall-full-content\"><strong>Question-and-Answer Session</strong></p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">[Operator Instructions]. The first question is from Paul Holden with CIBC.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Paul Holden</span></strong></p> <p class=\"paywall-full-content\">So, you clearly highlighted that new customer wins and share of wallet are adding to revenue growth. Just wondering how do you feel about the business momentum there? Are you seeing sort of a lot of wins in the past and hard to replicate? Or is it a matter of you really -- the team is just really trying to -- starting to gain traction in North America and maybe that rate of growth could even accelerate from here?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">Yes. Paul, I think we are in early innings in terms of the commercial growth strategy, having started the pivot to growth in 2021 and having invested in the innate capabilities, especially in the U.S., Canada to make full use of the marketplace and the opportunities in that marketplace. I think we're just in the early days of progressing that agenda. And I think that is exemplified through a number of progressions. Clearly, you're seeing growth in vehicles under management as we both retained the existing client base as we steal share from our competitors as we penetrate that self-managed market, all of those are quite additive in terms of vehicles under management. Further, we're seeing vehicles under management growth also by taking larger share of existing client fleets. And the combination of those 2 are propelling very solid VUM growth for the organization.</p> <p class=\"paywall-full-content\">On top of that, and in keeping with not only our profitable revenue growth strategy, but our capital-lighter strategy and a focus on services, we've had a pronounced focus across the 3 regions on share of wallet and looking to increase the penetration of service offerings with our existing clients and spur utilization of those services amongst the client base. Those 2 factors combined with the inflation that we're seeing on parts and labor, fuel have all been quite additive in terms of share of wallet. So yes, I would say with COVID waning, with our sales force being more mobile and getting more and more face-to-face meetings, we feel like, again, we're in the early innings of the game with our commercial efforts maturing quite nicely and making the very most of the market opportunities that we're seeing.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Paul Holden</span></strong></p> <p class=\"paywall-full-content\">And then second part of the question, which is sort of related. In terms of those new customer wins or not so much the penetration, but the new customer wins, is there sort of a time delay now between when those come on in terms of the vehicles under management versus net earning assets, i.e., is there a tailwind ahead of us in terms of growth in originations from these customer wins that have already taken place?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">Maybe I phrase slightly different. As we steal share and onboard a new client, typically, we will take over the service mandate on those vehicles within a quarter or 2. We would then originate new vehicle, replacement vehicles for their existing fleet as that existing fleet begins to mature, given the OEM delays then, yes, some of those originations that we would expect to come historically faster with new client wins are taking a little longer. And so you will see a situation where our VUM is increasing, but the originations that would be associated with those increased units have been delayed as a consequence of the OEM production delays. And so we're actually building up, if you will, pent-up demand as we capture these new clients, onboard them and shift the provision of services onto our platform and meanwhile, have to wait a little longer for the originations and the buildup of the or the flow-through to syndications.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Paul Holden</span></strong></p> <p class=\"paywall-full-content\">Just a quick follow-up on that, just to be clear. That component is not captured in your backlog. Is that correct, customer wins? Where do you anticipate there will be a conversion of earning assets in the future is not in the backlog?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">That is correct. Not until those clients are ready and able to place an order. So, they're ready to replace the existing vehicle fleet and the order bank of the OEM is open such that we can place that order. So to your point, that pent-up demand that we're carrying forth is not captured in the order backlog.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">The next question is from Geoff Kwan with RBC Capital Markets.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Geoff Kwan</span></strong></p> <p class=\"paywall-full-content\">I just want to follow up a little bit on Paul's first question. Just on Slide 15, you talk about the new client wins, self-managed fleets and government and mega fleets. Just wondering if there's an update there. Just on the client win side, there's -- as you know, there's been some consolidation announcements and to the extent that you're maybe getting more interest from there than again on the self-managed mega and government fleets.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">Yes, we're very encouraged by what we're seeing in the market. As you think about some of these macroeconomic factors that we had identified, Geoff, be it rising interest rates, be it inflation, being the shift in technology and in the consideration of EVs as a replacement for ICE vehicles. There are a number of facilitators now that are making our value proposition, all the more interesting and valuable to client prospects. You add then the dynamic of a fair amount of upheaval that comes with the integration of 3 companies on to single platforms and that has given rise to a great deal of interest and outreach in terms of the clients of competitors.</p> <p class=\"paywall-full-content\">And so that combination of self-managed fleets who are looking to reduce their fleet operating cost, reduce their fuel costs to migrate their fleets to -- from ICE to EV to access better, more reliable, cheaper sources of financing, our value proposition is resonating with them and generating increased interest. And for those that have already made the decision to outsource their fleets to in FMC, the shift that has taken place in terms of industry consolidation coupled with the acknowledgment that our transformation is complete and the end result is a client experience second to none, has seen a great deal of interest and we've been able to convert a lot of that interest into qualified prospects and ultimately into new clients for our business.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Geoff Kwan</span></strong></p> <p class=\"paywall-full-content\">And then my second question was on your share buybacks, presumably, I mean, we'll see Element's true earnings and free cash flow generation when OEM production normalizes and likely your valuation multiple probably expands from where it is right now. And so what sort of valuation metric and what valuation multiple or whether or not it's an absolute number or range, would you kind of view as the fair value that would guide how active you are on buying back your stock?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Frank Ruperto</span></strong></p> <p class=\"paywall-full-content\">Yes. This is Frank. So I would tell you, we don't put a target out there publicly for what the share price is, but I can tell you that based on what we see for both our guidance and for the potential upside in the business, especially as the OEM originations begin to come through and the supply chain issues start to subside, we continue to believe that we're materially undervalued. And as a result, you will continue to see us leaning into our NCIB and share repurchase, but also all of the 3 prongs of our return of capital.</p> <p class=\"paywall-full-content\">So looking at our dividend, as I said on the call, Q3 reassess that given the enhanced free cash flow we see current year and in the future. We will also look at continuing to optimize our capital structure. So the cost of some of these older preferred issuances and convertible debt issuances are punitive. And so looking to continue to take those out as well. So, we'll continue to employ that 3-pronged strategy. But again, our business model is capital-lighter. And by definition, capital-lighter means less capital in the business, which means equity that we don't need to run the business, which means we will continue to return that equity and lean into that capital-lighter strategy because we believe that is a core value driver for this business and a unique characteristic that we have.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">And Geoff, maybe circling back to valuation and basis of valuation for us, free cash flow -- free cash flow per share is the salient metric here. And again, the nature of the business, the tax shield, the regenerative tax shield that is created with the CAD6 billion plus of originations the business generates just doesn't get factored into EPS as a multiple. And so for us, the basis of measurement has been, continues to be free cash flow per share.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Frank Ruperto</span></strong></p> <p class=\"paywall-full-content\">Yes. And Jay, that's a great point. If you look at the differential between our EPS and our free cash flow, that entirety of CAD0.08 that you see in this quarter is all the difference between our cash taxes on our book taxes.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">The next question is from Tom MacKinnon with BMO Capital.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Tom MacKinnon</span></strong></p> <p class=\"paywall-full-content\">Just a couple quick questions here. I think you had said in the last quarter that the excess order backlog would start to decline in the second half of 2023. It seems to start -- it's -- is there any update on that because it seems to begin to plateau right now? Would -- is it still in the second half of 2023 when we'd see that start to decline significantly? Or is it any earlier? And I have a follow-up.</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">Tom, actually, the very opposite. We're looking for the excess order backlog actually to increase in the second half. While we anticipate that we're going to have increasing OEM productive capacity throughout 2022 as we move to the restoration of full capacity in 2023, we nonetheless expect that as the order banks are opened by the OEMs, there will be a significant inflow of orders that will build the order backlog and thus the excess order backlog throughout the second half.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Tom MacKinnon</span></strong></p> <p class=\"paywall-full-content\">And so I think before you had said it would start to decline in the second half of 2023. So, is that still the call?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">That is correct. And we would expect -- we haven't moved off our full recovery of productive capacity in 2023. And as we get to that level and the OEMs are then in a position to add additional shifts of productive capacity, we would absolutely begin to see that excess order backlog being drawn down in the second half of 2023. That is [Technical Difficulty]/</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Tom MacKinnon</span></strong></p> <p class=\"paywall-full-content\">And the CAD25 million in additional revenue in 2022, half of which is service related, what is so unique about 2022 that's adding to that? Is it perhaps increased service revenue just as a result of people -- customers not being able to replace their vehicles as quickly? Is that one of the things that's contributing to what you would deem to be additional service revenue? Maybe just perhaps a little bit more color around the CAD25 million and what makes it so unique to 2022 and in your opinion, not necessarily recurring in 2023?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Frank Ruperto</span></strong></p> <p class=\"paywall-full-content\">Sure. So, it is not -- it's not that. It's not increased utilization. It's not a return to pre-pandemic levels. So to us, that is normal ordinary course operations within the business. These are more specific items within the 1.5 million vehicles we have and the changing dynamics in these times with how the vehicles are potentially used, returned otherwise that provide us a one-time opportunity, both for us and sometimes for our clients to provide them value as well in regards to driving that incremental revenue. So, we saw CAD8 million in the first -- in the second quarter.</p> <p class=\"paywall-full-content\">We anticipate another CAD13 million or so -- I'm sorry, CAD17 million or so in the second half, so that's CAD25 million. But again, anything that we talk about as normal ordinary course running the business would not be in that CAD25 million. These really are a couple of very distinct distinct items that given the current economic -- macroeconomic environment and the supply chain and a host of other things, we can identify as this was a one-time, we're going to be able to take advantage of it. So, we have to proactively take an action. But it is not anything that we would ever consider normal ordinary course business.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Tom MacKinnon</span></strong></p> <p class=\"paywall-full-content\">What makes it not ordinary course?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">Tom, probably the best way to illustrate this is by a way of past examples. So, you've seen instances where we've had a contract settlement with a major client that was nonrecurring, one-time in nature and we called that out. You saw another instance where we had swap gains, large nonrecurring, we called that out. We even had earlier days of my time with the organization, we did a reamortization of an entire client portfolio, again, nonrecurring one-time in nature. And so what makes 2022 unique is we have a couple of those, a few of those that have come home to roost here beginning Q2 and continuing throughout the remainder of the year. That, again, are just nonrecurring one-time in nature. And to Frank's point, or to the benefit of our clients and to the benefit of the organization.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Tom MacKinnon</span></strong></p> <p class=\"paywall-full-content\">And if I could just squeeze one more in. The redemption of the preferreds, I assume that should sort of lower your cost of funds going forward. Is that a...</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Frank Ruperto</span></strong></p> <p class=\"paywall-full-content\">Yes, it lowers our cost of funds. But remember, that dividend is down at the bottom of the income statement, right? And any debt we took on to take it out and now ends up in the NFR line. So, a bit of an auto counting based on how our income statement is set up and how the auditors look at all of our debt hitting that NFR line. So, it will lower our overall cost of funds because it's inefficient, but it's moving geographically within the income statement.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">The next question is from Shalabh Garg with Veritas Investment Research.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Shalabh Garg</span></strong></p> <p class=\"paywall-full-content\">First of all congrats on a great quarter. One thing I want to touch on is the excess sort of backlog? And can you provide any color on what percentage of that backlog is for replacing the older or less efficient vehicles?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">We wouldn't break out that as a matter of public disclosure. But suffice it to say that the excess order backlog is quite representative of the entirety of our fleet. So, it is largely 80% service, 20% sales vehicles. It is largely pickup stands and medium-duty trucks as opposed to passenger vehicles. And these are vehicles that are ordered to replace existing vehicles that are just long in the tooth. They have become terribly inefficient, far more expensive to operate and thus, the order has been placed with the OEM.</p> <p class=\"paywall-full-content\">And just maybe Shalabh to give you a little additional insight around efficiencies. If you move from an average age of 3 years for your vehicle, so if on average, your vehicles were operating at 36 months of usage, to go another year represents about a 25% increase in your monthly spend for that vehicle to keep it on the road. If you go another year to 5 years, it actually elevates it to 40% increase. And so there's a natural point of rationale, if you will, that says we need to keep current in terms of replacing our vehicles. Unfortunately, by virtue of the OEM production delays that has resulted in many of our clients not being able to secure vehicles on a timely basis and hence, this excess order backlog that has built.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Shalabh Garg</span></strong></p> <p class=\"paywall-full-content\">And just a follow-up on that. So, I think in the past, it was mentioned 41 months as the ideal time to replace based on like Element's data and analysis. Is the current vehicle fleet age higher, lower than that or similar? Like can you share any color again, you can provide on that?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">So, the average amortization period, 41 months, absolutely, that has kind of consistently been the magical number for the business up until this OEM production delay began to manifest itself in mid-2021. We have seen that number increase over the course of the last 12 months.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Shalabh Garg</span></strong></p> <p class=\"paywall-full-content\">Then I'm assuming once the order backlogs clear off, that number would kind of again be in line with historical and -- or the ideal set of data, right, like ideal set months?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">That is our operating assumption as well, yes.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">The next question is from Jaeme Gloyn with National Bank Financial.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Jaeme Gloyn</span></strong></p> <p class=\"paywall-full-content\">Just wanted to start off on fuel and the potential benefit of fuel prices in this quarter as we're seeing those costs revert lower into Q3. I just want to get a sense of the sensitivity perhaps to the movements in the fuel prices on a quarter-to-quarter basis here and what we might expect?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">Yes. Jaeme, you might remember in 2020, we talked a little bit about fuel and kind of where it sat in the pecking order in terms of services. And we said, if you had the top 6 services by revenue, fuel would fit into the top 6. So it's not number one, it's not number two, but it is in the top 6. So, it in and of itself is an important service offering to make available to a client. It's pretty much core to a fleet services mandate and value proposition that you're going to advance. That said, it's not one of our higher service revenue generators.</p> <p class=\"paywall-full-content\">It is absolutely being advantaged by the significant increase in fuel costs that we have seen in all 5 country domains in which we have operated. And on our cost-plus model, the increase in the fuel price obviously flows through to our client and the basis points for managing that spend flows through to our revenue line. But it in and of itself isn't one of the larger contributors to service revenue for the organization. And so while it has been additive in terms of revenue growth, as a consequence of the fuel price increases that we've seen, the fact that it will reverse to something that is more the norm isn't particularly problematic for us as we go forward.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Jaeme Gloyn</span></strong></p> <p class=\"paywall-full-content\">Shifting to the Armada relationship, nice to see a little disclosure here about a broadening array of Element services that you've signed Armada up for. Can you perhaps give us a sense as to where that relationship is on a utilization basis? Is there more to go? Is there -- is this kind of like the plateau for that relationship? Maybe just elaborate on where that sits today?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">Armada is probably a reasonable facsimile for the broader strategy that we're deploying as an organization. And so for us, this is -- represents opportunity for growth, both in terms of growing vehicles under management and increasing the penetration and utilization of those vehicles under management. And so their aspirations are continuing to expand. And with that expansion, a greater reliance on the vehicles that they have in their fleet. And so we see opportunities for increased numbers of vehicle under management as we go forward.</p> <p class=\"paywall-full-content\">Further, this is a very innovative organization. They're always pushing the boundaries, they're always rethinking the means by which they advance their agenda and how their fleet can add a meaningful contribution to the advancement of that agenda. And as a consequence, we've been able to work with them to create, develop, pilot and roll out a variety of different offerings and many of the non-traditional fleet offerings. So yes, I think there's opportunity to grow that relationship, both in terms of number of units that we manage, increase service array that we provide those vehicles and increased utilization of those services amongst their drivers.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Jaeme Gloyn</span></strong></p> <p class=\"paywall-full-content\">And last one for me, maybe trying to sneak peek into the next quarter's disclosures. As we're thinking about the previous revenue guidance of 4% to 6%, clearly, Element has been executing very well on its growth strategies, taking market share, share of wallet and self-managed fleet. Is there anything in the data so far that might cause you to take a more optimistic look at that 4% to 6% guidance?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Frank Ruperto</span></strong></p> <p class=\"paywall-full-content\">So, the new guidance that we have out there for -- before the adjustment is 10% to 12% for the year. So, I think that is obviously materially higher and it's 7.5% to 9.5% before the CAD25 million -- after the CAD25 million or excluding the CAD25 million in distinct nonrecurring revenues. So yes, we have clearly taken both to look at what's happened and transpired in the first half, but also the trends that have driven that first half in driving our guidance to a significantly higher level than we had originally looked at. I'd also say, as per my comments earlier, we do believe Q2 will be the high watermark but we think the second half will be roughly consistent with the first half. And as we look at each of those quarters, they amongst by themselves despite the fact we think Q2 is a high watermark would still be materially above prior year quarters. So, continuing to show very strong growth on a year-over-year basis, hence our comfort level in that 10% to 12% net revenue growth.</p> <p class=\"paywall-full-content\"><strong><span class=\"question\">Jaeme Gloyn</span></strong></p> <p class=\"paywall-full-content\">Yes. I guess I was not referring specifically to the near term, but more of that medium-term outlook or longer-term outlook?</p> <p class=\"paywall-full-content\"><strong><span class=\"answer\">Jay Forbes</span></strong></p> <p class=\"paywall-full-content\">Yes. And I think let's revisit that in November when we bring forth our guidance for 2023 and and maybe some early thoughts in terms of what 2024 might look like as well, James. To your point, when we start to look at the success that we're enjoying in increasing the vehicles under management, the share of wallet that we're enjoying with that larger fleet of vehicles under management, the extraordinary efforts that have gone into retaining the existing client base at levels even beyond that industry norms that are already admirably high, when we think about all those factors, they certainly do give us a lot of confidence in terms of the ability of this organization to grow quite profitably. So let us, again, reflect on the 2023 guidance. And I think we provide some outlook as to when we think things will be back to normal and with normality, what this organization might be capable of doing in terms of consistent profitable revenue growth.</p> <p class=\"paywall-full-content\"><strong>Operator</strong></p> <p class=\"paywall-full-content\">This concludes the question-and-answer session and today's conference call. You may disconnect your lines. Thank you for participating and have a pleasant day.</p>",
      "quickInsights": null,
      "twitContent": "Element Fleet Management Corp (ELEEF) CEO Jay Forbes on Q2 2022 Results - Earnings Call Transcript $ELEEF $EFN:CA $EFN.PR.A:CA-DEFUNCT-618724 #finance #investing #markets https://seekingalpha.com/article/4532844-element-fleet-management-corp-eleef-ceo-jay-forbes-on-q2-2022-results-earnings-call?source=tweet",
      "innerMarketing": "",
      "marketingBullet": "",
      "isReit": false,
      "videoData": null,
      "marketingBulletVariant": null,
      "marketingBio": null,
      "audioDuration": null,
      "originalTitle": "Element Fleet Management Corp (ELEEF) CEO Jay Forbes on Q2 2022 Results - Earnings Call Transcript"
    },
    "relationships": {
      "author": {
        "data": {
          "id": "44211",
          "type": "author"
        }
      },
      "sentiments": {
        "data": []
      },
      "primaryTickers": {
        "data": [
          {
            "id": "63621",
            "type": "tag"
          },
          {
            "id": "618723",
            "type": "tag"
          },
          {
            "id": "618724",
            "type": "tag"
          },
          {
            "id": "618725",
            "type": "tag"
          },
          {
            "id": "618726",
            "type": "tag"
          }
        ]
      },
      "secondaryTickers": {
        "data": []
      },
      "otherTags": {
        "data": [
          {
            "id": "96991",
            "type": "tag"
          },
          {
            "id": "63621",
            "type": "tag"
          },
          {
            "id": "618723",
            "type": "tag"
          },
          {
            "id": "618724",
            "type": "tag"
          },
          {
            "id": "618725",
            "type": "tag"
          },
          {
            "id": "618726",
            "type": "tag"
          },
          {
            "id": "49",
            "type": "tag"
          },
          {
            "id": "586376",
            "type": "tag"
          },
          {
            "id": "34503",
            "type": "tag"
          }
        ]
      },
      "coAuthors": {
        "data": []
      },
      "presentations": {
        "data": []
      },
      "updates": {
        "data": []
      },
      "corrections": {
        "data": []
      }
    },
    "links": {
      "self": "/article/4532844-element-fleet-management-corp-eleef-ceo-jay-forbes-on-q2-2022-results-earnings-call",
      "canonical": "https://seekingalpha.com/article/4532844-element-fleet-management-corp-eleef-ceo-jay-forbes-on-q2-2022-results-earnings-call",
      "uriImage": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
      "schemaImage": null
    }
  },
  "included": [
    {
      "id": "44211",
      "type": "author",
      "attributes": {
        "company": null,
        "slug": "sa-transcripts",
        "userId": 101639,
        "tagId": 96991,
        "bio": "Seeking Alpha's transcripts team is responsible for the development of all of our transcript-related projects. We currently publish thousands of quarterly earnings calls per quarter on our site and are continuing to grow and expand our coverage. The purpose of this profile is to allow us to share with our readers new transcript-related developments. Thanks, SA Transcripts Team",
        "image": {
          "small": "https://seekingalpha.com/images/users_profile/000/101/639/small_pic.png",
          "medium": "https://seekingalpha.com/images/users_profile/000/101/639/medium_pic.png",
          "big": "https://seekingalpha.com/images/users_profile/000/101/639/big_pic.png",
          "extra_large": "https://seekingalpha.com/images/users_profile/000/101/639/extra_large_pic.png"
        },
        "nick": "SA Transcripts",
        "deactivated": null,
        "memberSince": 2007,
        "isRss": false,
        "contributorSince": 2013,
        "followersCount": 157429
      },
      "relationships": {
        "user": {
          "data": {
            "id": "101639",
            "type": "user"
          }
        },
        "userBioTags": {
          "data": [
            {
              "id": "958652",
              "type": "userBioTag"
            }
          ]
        },
        "authorResearch": {
          "data": null
        }
      },
      "links": {
        "self": "/author/sa-transcripts",
        "profileUrl": "/author/sa-transcripts",
        "site": null,
        "linkedinUrl": null,
        "twitterUrl": null
      }
    },
    {
      "id": "63621",
      "type": "tag",
      "attributes": {
        "slug": "eleef",
        "name": "ELEEF",
        "company": "Element Fleet Mgmt Corp.",
        "tagKind": "Tags::Ticker",
        "equityType": "stocks",
        "exchange": "OTCMKTS",
        "fundTypeId": 0,
        "isDefunct": false,
        "currency": "USD",
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {
        "self": "/symbol/ELEEF"
      }
    },
    {
      "id": "618723",
      "type": "tag",
      "attributes": {
        "slug": "efn:ca",
        "name": "EFN:CA",
        "company": "Element Fleet Management Corp.",
        "tagKind": "Tags::Ticker",
        "equityType": "stocks",
        "exchange": "TSX",
        "fundTypeId": 0,
        "isDefunct": false,
        "currency": "CAD",
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {
        "self": "/symbol/EFN:CA"
      }
    },
    {
      "id": "618724",
      "type": "tag",
      "attributes": {
        "slug": "efn.pr.a:ca-defunct-618724",
        "name": "EFN.PR.A:CA",
        "company": "Element Fleet Management Corp. 6.60% PFD SER A",
        "tagKind": "Tags::Ticker",
        "equityType": "stocks",
        "exchange": "TSX",
        "fundTypeId": 0,
        "isDefunct": true,
        "currency": "CAD",
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {
        "self": "/symbol/EFN.PR.A:CA-DEFUNCT-618724"
      }
    },
    {
      "id": "618725",
      "type": "tag",
      "attributes": {
        "slug": "efn.pr.c:ca-defunct-618725",
        "name": "EFN.PR.C:CA",
        "company": "Element Fleet Management Corp. 6.5% 5 YR PFD C",
        "tagKind": "Tags::Ticker",
        "equityType": "stocks",
        "exchange": "TSX",
        "fundTypeId": 0,
        "isDefunct": true,
        "currency": "CAD",
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {
        "self": "/symbol/EFN.PR.C:CA-DEFUNCT-618725"
      }
    },
    {
      "id": "618726",
      "type": "tag",
      "attributes": {
        "slug": "efn.pr.e:ca-defunct-618726",
        "name": "EFN.PR.E:CA",
        "company": "Element Fleet Management Corp. 6.4 PFD SHS SR E",
        "tagKind": "Tags::Ticker",
        "equityType": "stocks",
        "exchange": "TSX",
        "fundTypeId": 0,
        "isDefunct": true,
        "currency": "CAD",
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {
        "self": "/symbol/EFN.PR.E:CA-DEFUNCT-618726"
      }
    },
    {
      "id": "96991",
      "type": "tag",
      "attributes": {
        "slug": "sa-transcripts",
        "name": "SA Transcripts",
        "company": null,
        "tagKind": "Tags::AuthorTag"
      },
      "links": {
        "self": "/author/sa-transcripts"
      }
    },
    {
      "id": "49",
      "type": "tag",
      "attributes": {
        "slug": "transcripts",
        "name": "Transcripts",
        "company": null,
        "tagKind": "Tag"
      },
      "links": {
        "self": "/tag/transcripts"
      }
    },
    {
      "id": "586376",
      "type": "tag",
      "attributes": {
        "slug": "has-audio",
        "name": "Has Audio",
        "company": null,
        "tagKind": "Tag"
      },
      "links": {
        "self": "/tag/has-audio"
      }
    },
    {
      "id": "34503",
      "type": "tag",
      "attributes": {
        "slug": "canada",
        "name": "Canada",
        "company": null,
        "tagKind": "Tags::Country"
      },
      "links": {
        "self": "/articles?filters=canada"
      }
    }
  ]
}