{
  "data": {
    "attributes": {
      "commentCount": 0,
      "title": "Apple announces changes to iOS in Japan",
      "publishOn": "2025-12-17T20:00:00.000-05:00",
      "lastModified": "2025-12-17T20:00:10-05:00",
      "widgetLinks": null,
      "content": "<div>\n<p>\nThe changes include new options for developers to distribute apps and process payments, and new protections to help reduce privacy and security risks the MSCA creates\n</p>\n<p>    <span class=\"location\" value=\"LU/us.ca.cupino\">CUPERTINO, Calif.</span>--(BUSINESS WIRE)--\nApple® today announced changes impacting iOS apps in <span class=\"location\" value=\"LC/jp\">Japan</span> to comply with the Mobile Software Competition Act (MSCA). These updates create new options for developers to distribute apps on alternative app marketplaces and to process app payments for digital goods and services outside of Apple (<a href=\"https://seekingalpha.com/symbol/AAPL\">AAPL</a>) In-<span class=\"person\" value=\"\">App Purchase</span>. Across these changes, Apple has worked to reduce new privacy and security risks the law creates to provide users in <span class=\"location\" value=\"LC/jp\">Japan</span> the best and safest experience possible.\n</p>\n<p>This press release features multimedia. View the full release here: <a href=\"https://www.businesswire.com/news/home/20251217568962/en/\">https://www.businesswire.com/news/home/20251217568962/en/</a></p>\n<img src=\"https://mms.businesswire.com/media/20251217568962/en/2673180/4/Apple-App-Store-compliance-hero.jpg\" alt=\"https://mms.businesswire.com/media/20251217568962/en/2673180/4/Apple-App-Store-compliance-hero.jpg\"><p>\nThe MSCA’s requirements for alternative app marketplaces and app payments open new avenues for malware, fraud and scams, and privacy and security risks. Apple has worked with Japanese regulators to introduce protections from new threats — including important safeguards for younger users. These protections include Notarization for iOS apps, an authorization process for app marketplaces, and requirements that help protect children from inappropriate content and scams.\n</p>\n<p>\nWhile these safeguards do not eliminate the new risks, they are essential to Apple’s work to ensure iOS remains the best, most secure mobile platform available in <span class=\"location\" value=\"LC/jp\">Japan</span>. Apple will continue to engage with regulators on strengthening protections for iOS users.\n</p>\n<p>\nDevelopers can learn about the new capabilities on the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fdeveloper.apple.com%2Fsupport%2Fapp-distribution-in-japan%2F&amp;esheet=54378970&amp;newsitemid=20251217568962&amp;lan=en-US&amp;anchor=Apple+Developer+Support+page&amp;index=1&amp;md5=2247dca987ea0b8ce2ce12433d853fbd\">Apple Developer Support page</a> and can integrate them into their apps beginning today as part of the iOS 26.2 release.\n</p>\n<p>\nNew Options for Developers to Distribute Apps on iOS in <span class=\"location\" value=\"LC/jp\">Japan</span>\n</p>\n<p>\nThe App Store® — where every app is reviewed to meet the App Store’s high bar for privacy and security — remains the best place for iOS users in <span class=\"location\" value=\"LC/jp\">Japan</span> to discover and download the apps they love. This includes App Store features that protect users against fraud and scams and empower parents to ensure their kids have age-appropriate experiences.\n</p>\n<p>\nWith the MSCA’s new requirements, developers will also have the option to distribute iOS apps in <span class=\"location\" value=\"LC/jp\">Japan</span> using alternative app marketplaces other than the App Store. Alternative app marketplaces will have to be authorized by Apple and will need to meet ongoing requirements to serve developers and users. However, apps downloaded outside the App Store will not benefit from the same protections Apple provides through App Review, introducing new risks for apps that contain scams, fraud, and abuse, or that expose users to illicit, objectionable, or harmful content not allowed on the App Store.\n</p>\n<p>\nTo reduce some of these new risks, Apple will conduct a baseline review — called Notarization — that applies to all iOS apps and focuses on basic functionality and protecting users from serious threats. This Notarization process involves a combination of automated checks and human review, and helps ensure apps function as promised and are free of known malware, viruses, or other security threats. However, Notarization is less comprehensive than the App Review process that applies to all apps on the App Store.\n</p>\n<p>\nDevelopers can learn more about operating or distributing from alternative app marketplaces on the new <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fdeveloper.apple.com%2Fsupport%2Fapp-distribution-in-japan%2F&amp;esheet=54378970&amp;newsitemid=20251217568962&amp;lan=en-US&amp;anchor=Apple+Developer+Support+page&amp;index=2&amp;md5=3004dd83490ea0c437a6b37c563ba12a\">Apple Developer Support page</a>.\n</p>\n<p>\nNew Options for Payments in App Store Apps on iOS\n</p>\n<p>\nOn the App Store, users in <span class=\"location\" value=\"LC/jp\">Japan</span> can continue to use Apple In-<span class=\"person\" value=\"\">App Purchase</span> to buy digital goods and services, manage subscriptions, request refunds, and view their payment history.\n</p>\n<p>\nTo comply with the MSCA, Apple is sharing tools that enable developers to offer more ways for users to purchase digital goods and services in apps on the App Store. For their iOS apps distributed on the App Store in <span class=\"location\" value=\"LC/jp\">Japan</span>, developers will be able to include an alternative payment processing method in their app and/or link users to a website to complete a transaction.\n</p>\n<p>\nThese alternative payment options will always be presented alongside Apple In-<span class=\"person\" value=\"\">App Purchase</span>, so that users in <span class=\"location\" value=\"LC/jp\">Japan</span> are clear on when they are transacting through Apple. When users choose to pay with Apple In-<span class=\"person\" value=\"\">App Purchase</span>, they’ll continue to receive familiar protections and tools like refund support, subscription management, and Report a Problem. App Store users’ purchase history and subscription management will only reflect transactions made using Apple In-<span class=\"person\" value=\"\">App Purchase</span>.\n</p>\n<p>\nFor apps that use alternative payment processing or link users to the web for transactions, Apple will not be able to issue refunds and will have less ability to support customers encountering issues, scams, or fraud. Users may need to share their payment information with additional parties, which can introduce new privacy and security risks.\n</p>\n<p>\nUpdated Business Terms for iOS Apps in <span class=\"location\" value=\"LC/jp\">Japan</span>\n</p>\n<p>\nTo reflect these options for app distribution and payment processing, Apple is also sharing updated business terms for developers’ iOS apps in <span class=\"location\" value=\"LC/jp\">Japan</span>. These business terms reflect the many ways Apple creates value for developers’ apps, whether or not they use the App Store and/or Apple In-<span class=\"person\" value=\"\">App Purchase</span>.\n</p>\n<p>\nUnder the business terms for iOS apps in <span class=\"location\" value=\"LC/jp\">Japan</span>, Apple will continue to only charge a commission on the sale of digital goods and services. The new terms include:\n</p>\n<ul>\n<li>\nApp Store commission: iOS apps on the App Store will pay a reduced commission of either 10 percent for the vast majority of developers — including members of the Small Business Program, Video Partner Program, Mini Apps Partner Program, and for subscriptions following their first year — or 21 percent on transactions for digital goods and services. The App Store commission reflects the value of the tools, technology, and services that enable developers to create apps, in addition to App Store distribution, discovery, and ongoing services.\n</li>\n<li>\nApple payment processing fee: In their iOS apps on the App Store, developers can process payments using Apple In-<span class=\"person\" value=\"\">App Purchase</span> for an additional 5 percent fee.\n</li>\n<li>\nStore services commission: iOS apps on the App Store will pay a commission of 15 percent on transactions for digital goods and services made on a website linked to by the developer’s app. Developers in the programs mentioned above, and subscriptions following their first year, will pay a reduced rate of 10 percent.\n</li>\n<li>\nCore Technology Commission: iOS apps distributed outside of the App Store will pay a 5 percent commission on the sale of digital goods and services, including paid apps. The Core Technology Commission compensates Apple for the tools, technologies, and services that enable developers to build and share their apps with iOS users.\n</li>\n</ul>\n<p>\nUnder these new business terms, developers that sell digital goods and services in <span class=\"location\" value=\"LC/jp\">Japan</span> will pay Apple the same or less than they do today. Developers that do not sell digital goods and services will continue not to pay Apple any commissions or fees.\n</p>\n<p>\nImpacts to Kids’ Online Safety\n</p>\n<p>\nApple created the App Store to be a safe place for kids, where parents are empowered to ensure their children have age-appropriate experiences and have the tools they need to keep their children safe online. That’s why Apple has created industry-leading features like age ratings, Content &amp; Privacy Restrictions, content filters, Ask to Buy, and powerful controls that help parents choose how children use their devices.\n</p>\n<p>\nWith the changes introduced under the MSCA, the new options for alternative distribution and payment methods may expose children to new risks. For instance, apps downloaded from outside the App Store may include illicit and objectionable content, and they will not undergo the same rigorous review process Apple employs to evaluate apps made for children on the App Store. For instance, similar regulatory changes in <span class=\"location\" value=\"LR/eur\">Europe</span> have enabled types of apps that were previously unavailable on iOS, including pornography apps.\n</p>\n<p>\nIn an effort to reduce new risks of fraud or scams targeting children, Apple has worked with regulators in <span class=\"location\" value=\"LC/jp\">Japan</span> to preserve some guardrails, including:\n</p>\n<ul>\n<li>\nApps in the Kids category on the App Store will not include links to websites to complete transactions, to reduce the risk of fraud or scams targeting children.\n</li>\n<li>\nFor users under 18 years old, all apps from the App Store that use alternative payment processing or link to a website for transactions must include a parental gate that requires younger users to involve their parent or guardian before making a purchase.\n</li>\n<li>\nFor users under 13 years old, apps from the App Store cannot link to websites for transactions to protect against the risk of scams that target younger kids.\n</li>\n<li>\nApple is also working to provide developers using alternative payments with a new API so they can enable parents to monitor and approve purchases made outside of Apple In-<span class=\"person\" value=\"\">App Purchase</span>.\n</li>\n</ul>\n<p>\nDevelopers must also continue to provide age ratings for their apps, whether their app is distributed on the App Store or an alternative app marketplace.\n</p>\n<p>\nApple will continue innovating to meet the evolving risks to kids’ safety online by building on the powerful tools and features it makes available today — like Child Accounts, web content filters, app restrictions, monitoring tools like Screen Time and Family Sharing, Communication Safety, and Communication Limits, which help parents shape who their children communicate with and shield them from inappropriate content.\n</p>\n<p>\nAdditional Updates to iOS\n</p>\n<p>\nAlongside the new app distribution and payment options, Apple has introduced additional controls and choices for users in <span class=\"location\" value=\"LC/jp\">Japan</span> with the release of iOS 26.2. These include:\n</p>\n<ul>\n<li>\nA browser choice screen and search engine choice experience, giving users in <span class=\"location\" value=\"LC/jp\">Japan</span> new ways to pick their preferred browser and search engine.\n</li>\n<li>\nDefault controls for navigation apps and app marketplaces.\n</li>\n</ul>\n<p>\nAcross these controls, users can review and adjust their choices at any time in Settings.\n</p>\n<p>\nFor developers, Apple is sharing tools in addition to the new options for alternative distribution and app payments, including:\n</p>\n<ul>\n<li>\nNew options for developers of browser apps to use alternative browser engines other than WebKit, with strict security and privacy requirements.\n</li>\n<li>\nA new API that enables developers of voice-based conversational apps to provide users the option to launch their app with the iPhone® side button.\n</li>\n<li>\nA process to request interoperability with core technologies in iPhone and iOS.\n</li>\n</ul>\n<p>\nApple is providing detailed resources to help developers understand the options now available for their apps in <span class=\"location\" value=\"LC/jp\">Japan</span>, which they can access from the <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fdeveloper.apple.com%2Fsupport%2Fapp-distribution-in-japan%2F&amp;esheet=54378970&amp;newsitemid=20251217568962&amp;lan=en-US&amp;anchor=Apple+Developer+Support+page&amp;index=3&amp;md5=1019eaff8782fba86d8d8d53a227b217\">Apple Developer Support page</a>.\n</p>\n<p>\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it.\n</p>\n<p>\nNOTE TO EDITORS: For additional information visit Apple Newsroom (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.apple.com%2Fnewsroom&amp;esheet=54378970&amp;newsitemid=20251217568962&amp;lan=en-US&amp;anchor=www.apple.com%2Fnewsroom&amp;index=4&amp;md5=8a757e5abe02a836ae143b8e5c8e0fb3\">www.apple.com/newsroom</a>), or email Apple’s Media Helpline at media.help@apple.com.\n</p>\n<p>\n© 2025 Apple Inc. All rights reserved. Apple, the Apple logo, App Store and iPhone are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\n</p>\n<p><img src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20251217568962r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" alt=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20251217568962r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\"></p>\n<p>View source version on <a href=\"http://businesswire.com\">businesswire.com</a>: <a href=\"https://www.businesswire.com/news/home/20251217568962/en/\">https://www.businesswire.com/news/home/20251217568962/en/</a></p>\n<p>\nPress Contacts:\n</p>\n<p>\n<span class=\"person\" value=\"\">Peter Ajemian</span>\n<br>Apple\n<br>pajemian@apple.com\n</p>\n<p>\nApple Media Helpline\n<br>media.help@apple.com\n</p>\n<p>Source: Apple Inc.</p>\nCopyright Business Wire 2025\n</div>",
      "widgetTitle": null
    },
    "relationships": {
      "acquireService": {
        "data": {
          "id": "1"
        }
      },
      "primaryTickers": {
        "data": [
          {
            "id": "146"
          }
        ]
      },
      "secondaryTickers": {
        "data": []
      },
      "otherTags": {
        "data": []
      }
    },
    "links": {}
  },
  "included": [
    {
      "id": "1",
      "attributes": {
        "serviceName": "Press Releases - English"
      }
    },
    {
      "id": "146",
      "attributes": {},
      "links": {}
    }
  ]
}