{
  "wall_street_breakfast": [
    {
      "title": "What Moved Markets This Week",
      "publishOn": "2025-12-28T07:29:43-05:00",
      "content": "## Classic play\n\nU.S. stocks finished higher on Friday, capping off a shortened trading week that saw the S&P 500 (SP500) advance by 1.1%. It was quite the \"Santa Claus rally,\" which describes the tendency for the stock market to rise during the last five trading days of the year and the first two of the new year. Historically, the S&P 500 has gained an average of 1.3% during this seven-day stretch, which began on Christmas Eve and ends on Jan. 3. Since 1950, the market has risen 79% of the time during this period, making it one of the most reliable seasonal patterns. Volume is typically light with many traders away from their desks, so any buying pressure can have an outsized impact on prices, while no major economic data or earnings releases usually allow the market to drift upward on momentum.\n\n## Humanoid timeline\n\nTesla (TSLA) CEO Elon Musk revealed a more concrete timeline for the Optimus robot this week, stating it would likely be ready for internal use in 2025 and for broader sale by 2026. \"Optimus is going to be the most valuable product ever created,\" Musk declared, despite skepticism from some analysts about the complexity of the technology. The announcement follows a generic pattern of ambitious timelines from the billionaire, but shares of Tesla still rose on the news, contributing to the broader market gains. Meanwhile, competitors in the humanoid robotics space, such as Boston Dynamics and Figure AI, are ramping up their own developments, signaling an intensifying race to bring general-purpose robots to market.\n\n## Deal or no deal\n\nParamount Global (PARA) is back in the spotlight after reports surfaced that it was in early talks with Warner Bros. Discovery (WBD) about a potential merger. The combination would bring together assets like CBS, MTV, and Nickelodeon with CNN, HBO, and Warner Bros. studios, creating a media giant to better compete in the streaming wars against Netflix (NFLX) and Disney (DIS). However, regulatory hurdles would be significant, and debt loads for both companies remain a concern for investors. Shares of both companies saw volatility as the market digested the potential synergies and risks of such a mega-merger.\n\n## Crypto calm\n\nBitcoin (BTC-USD) hovered around the $95,000 mark for much of the week, consolidating gains after its recent run-up. The cryptocurrency has seen renewed interest following the approval of spot Bitcoin ETFs earlier in the year and improved sentiment toward risk assets. Ethereum (ETH-USD) also held steady, while altcoins saw mixed performance. Industry experts are looking ahead to the upcoming Bitcoin halving event in early 2026 as a potential catalyst for the next major leg up, although regulatory uncertainty continues to loom over the broader crypto ecosystem."
    }
  ],
  "KBR": {
    "news": [
      {
        "title": "KBR awarded key engineering deal for huge QatarEnergy project",
        "publishOn": "2025-11-06T09:57:30-05:00",
        "content": "# KBR News: KBR awarded key engineering deal for huge QatarEnergy project\n\nKBR (**KBR**) said Thursday it was awarded a contract to provide detailed engineering design services for further expansion of the Bul Hanine oil and gas field offshore Qatar, a project considered crucial to QatarEnergy's strategy of maintaining and expanding production at the country's largest offshore oilfield.\n\nThe EPIC project 120 km east of Doha aims to extend the field's production life, increase its capacity, and integrate advanced technologies to maximize recovery, the companies said; financial terms were not disclosed.\n\nSeparately, KBR (**KBR**) said it was selected to provide detailed engineering design services for the Associated Gas Upstreasm Project Phase 2 as part of the Gas Growth Integrated Project operated by TotalEnergies and partners BOC and Qatar Energy in Iraq; financial terms were not disclosed.\n\n## More on KBR\n\n- KBR Q3 2025 Earnings Call Presentation\n- KBR Special Call - Slideshow\n- KBR: Spin To Win"
      },
      {
        "title": "KBR secures contract for IGNIS green ammonia facility in Spain",
        "publishOn": "2025-12-15T06:30:52-05:00",
        "content": "KBR (**KBR**) has been awarded a technology and engineering contract by IGNIS for a new green ammonia facility to be built in A Coruña, Spain.\n\nUnder the terms, KBR will provide proprietary engineering design and pre-Front End Engineering Design (pre-FEED) services for the plant, which is designed to produce 200,000 tons of green ammonia per annum.\n\nThe facility will utilize renewable energy to produce green hydrogen, which is then converted into green ammonia.\n\nGreen ammonia is a critical component in the production of renewable fertilizers.\n\n“KBR’s green ammonia solutions, along with complementary technologies such as H2ACT® ammonia cracking, make us a global leader in delivering reliable and energy-efficient ammonia technology at a lower capital cost,” said Jay Ibrahim, President, KBR Sustainable Technology Solutions.\n\n## More on KBR, Inc.\n\n- KBR: Engineering Tomorrow With Proprietary Decarbonization And Circularity\n- KBR, Inc. (KBR) Q3 2025 Earnings Call Transcript\n- KBR, Inc. 2025 Q3 - Results - Earnings Call Presentation\n- KBR awarded key engineering deal for huge QatarEnergy project\n- KBR outlines $7.8B revenue guidance and advances spin-off strategy as cash flow outpaces expectations"
      },
      {
        "title": "KBR bags $10B U.S. Navy support contract",
        "publishOn": "2025-12-18T07:40:04-05:00",
        "content": "# KBR News: KBR bags $10B U.S. Navy support contract\n\n- **KBR** awarded a seat on a multiple award, IDIQ contract by the U.S. Naval Supply Systems Command.\n- The contract spans a five-year base period with an additional five-year option period.\n- The five-year option period would bring the ceiling amount to $20 billion.\n- Tasks may include a wide range of support services such as stability operations, civil support and supply chain and distribution services. WEXMAC 2.1 TITUS task orders are expected to be firm fixed price.\n\n## More on KBR, Inc\n\n- KBR: Engineering Tomorrow With Proprietary Decarbonization And Circularity\n- KBR, Inc. (KBR) Q3 2025 Earnings Call Transcript\n- KBR, Inc. 2025 Q3 - Results - Earnings Call Presentation\n- KBR secures contract for IGNIS green ammonia facility in Spain\n- KBR awarded key engineering deal for huge QatarEnergy project"
      }
    ],
    "analysis": [
      {
        "title": "KBR: Spin To Win",
        "publishOn": "2025-08-04T22:54:06-04:00",
        "content": "# KBR Analysis: KBR: Spin To Win\n\nKBR headquarters in Houston, Texas, USA. (JHVEPhoto)\n\nKBR (**KBR**) comprises two businesses: Mission Technologies Solutions (MTS, aka BadCo) and Sustainable Technology Solutions (STS, aka GoodCo).\n\nI am proposing a Strong Buy argument for KBR for two reasons:\n\n- It is my belief that there is significant value to be unlocked in the event of a spin-off of GoodCo.\n- Even without a spin-off, KBR's STS business is underappreciated by the market, and the consolidated company should be valued higher closer to peers.\n\nMTS generates the majority of KBR revenue at 72% with STS generating the balance, with EBITDA split being 55% for MTS and 45% for STS. The latter fact is the central driver for the theme of this investment case: BadCo is growing mid-to-high single digits and GoodCo is growing at low double-digit clips, but GoodCo has north of 20% EBITDA margins with MTS hovering at 10% margins. In my opinion, there is value to unlock with spinning out the STS business, which is being held back by the valuation of the more traditional BadCo. In fact, KBR as a whole is valued less than its pure-play peers in government services.\n\nTo be clear - KBR management and board have not announced a spin-off. The idea of such strategic alternatives is something that has been mulled over by the investor community; this article is simply an exercise in determining if there is a good rate of success buying into KBR regardless of scenario (spin-off or no spin-off).\n\n## Overview\n\nMTS is your typical government and defense services contractor business whose comparables span parts or all of: Leidos (**LDOS**), Booz Allen Hamilton (**BAH**), SAIC (**SAIC**), CACI (**CACI**), Amentum (**AMTM**). MTS focuses primarily on logistics, asset management, electronic warfare, directed energy, model-based system engineering, IT, and space operations. Some of these areas are no-growth and undifferentiated (logistics, IT, and asset management), while the rest are strong areas to be in. However, if one wanted to own a government services contractor for these types of businesses, there are better options with stronger contract bases, backlogs, and differentiated services with BAH, LDOS, and AMTM.\n\nSTS, on the other hand, is to ammonia and hydrogen generation what Amentum's GES business is to nuclear energy. KBR's STS has strong growth in the areas of ammonia production and carbon capture, its leadership is clearly demonstrated by owning 50% of the global market share in ammonia production facilities through IP licensing. Growth in the total addressable market has led to double-digit rates for the market leader for this area of the energy ecosystem, highlighting the strength of the business. Throw in leadership in hydrogen generation technology that couples with its ammonia ecosystem, liquid natural gas engineering and construction that has been resurgent due to the Ukraine-Russian war and election of the current U.S. administration, as well as significant investments in plastics recycling, and there are many differentiated, high-growth areas of the sustainable energy economy that makes STS an attractive business to own. Comparables include half of AMTM, Jacobs' Solutions (**J**), Aecom (**ACM**), Tetra Tech (**TTEK**), and Quanta Services (**PWR**).\n\n## Arguments in Favor of a Spin-off of STS Business\n\n### Point #1: BadCo and GoodCo Are Completely Different Businesses\n\nBadCo and GoodCo have zero synergy. Management completed an enterprise realignment in Q1 FY25 to make each segment self-sufficient and realize \"segment-level synergies.\" This re-segmentation didn't lead to much cost-savings, with $30 million being cited by management, through which only a fraction drops to the bottom-line. The synergy in the re-segmentation of the two business units was more to make each business unit self-sufficient and agile.\n\n> Today we did talk about making the segments more self-sufficient...\n>\n> ...But what we've tried to do through the structural realignment was to make sure that we're realizing the synergy inside the segments themselves to the maximum possible extent and drive efficiency and less complexity as a consequence.\n>\n> — Stuart Bradie, KBR CEO. Segment Realignment Investor Call.\n\n### Point #2: Business Repositioning\n\nManagement was pressed several times by the investor community about break-up value consideration and strategic alternatives. Investors and analysts were particularly vocal after the Segment Realignment Investor Call, where the restructuring involved a bolstering of the STS business unit to strengthen its scale as a stand-alone vertical by restructuring the international infrastructure business supporting Asia and Middle East, which generated $300M in revenue in 2024, into STS to bring STS to $2.2B in revenue and $4B in backlog. Recently, a new contract for KBR with Indonesia for engineering modular refineries for $8 billion is rumored to happen as part of a new U.S. trade deal with Indonesia - which would further demonstrate the ability for STS to capture business at scale. See below exhibits (emphasis mine):\n\n> Usually when we hear greater strategic flexibility, we think a higher probability of significant portfolio management, including, in your case, more M&A, a larger breakup, sale of STS.\n>\n> — Analyst Andrew Kaplowitz\n>\n> I'd like to say, initially, we repositioned the business and this restructuring is really the right thing to do going into 2025 and we really want to bed that down. This is sort of Phase 1 of that process and we really want to see that play out. I do think we've got some uncertainty with a new administration coming in. We've got a fantastic business model that's highly, highly resilient. But we do want to see where the market goes in terms of budget allocations and administration priorities....\n>\n> ... But we feel the path we're on today is the right path and we do think that will maximize shareholder value over the longer term right now....\n>\n> ... I think there are many considerations around looking at values of a breakup opportunity. They include healthy end markets. **I think scale is a big factor and how the business is and the additional cost and distraction that would actually happen as a consequence of any strategic actions like that.**...\n>\n> — Stuart Bradie, KBR CEO. Segment Realignment Investor Call.\n\nA new addition to management's investor pitch that caught my eye as part of the recent Q2 FY25 earnings call is signaling strategic optionality as a shareholder returns strategy. This messaging was absent in prior earnings presentations.\n\nStrategic Optionality mention (Q2 Investor Presentation)\n\n### Point #3: Business Underappreciation\n\nStuart Bradie came into KBR's CEO position in 2015 and has since completed significant amounts of portfolio restructuring and exiting legacy engineering and construction to realign into higher value business areas in electronic warfare, space, recycling, LNG, and hydrogen energy technologies. For several years, he has tried to address investor underappreciation over STS as not just a viable, but quality, business (emphasis mine):\n\nExhibit A: Post Plaquemines, Louisiana LNG Contract Win (August 2022)\n\n> Yes. I mean, we -- I mean, I think our guide on our growth and EBITDA over time for STS is 20% plus. And our margin expansion has room in it to go above the high teens into the low 20s. And I think both of these consider that. So I think we need to get a bit more time under our belt, Sean, to come back and answer that fully.\n>\n> But I think if you look at any business with underlying EPS growth that we've laid out, if there's any skepticism around that, **hopefully, some of that skepticism disappears with the announcements today.** And also, the skepticism of margin expansion, et cetera, also, hopefully, some of that skepticism disappears today also. So we'll come back over time, but that's probably the best way to answer it today.\n>\n> — Stuart Bradie, KBR CEO.\n\nAs prophesied, STS CAGR has been 22.3% since that call and EBITDA margins in the low 20s. Yet, the stock price is lower today than it was at the time of that call.\n\nExhibit B: Post Ammonia Cracking Hydrogen Generation Win (November 2023)\n\n> Yes. I mean I don't know if we're going to get out over STS on a '25 target today, Bert. But what I would say is that we are well ahead of pace. You're quite right. We had a $300 million target. **We're going to blow through that this year.** We raised EBITDA guide last quarter, and we're ahead of pace of that, are on pace for that. And I think everyone recognizes particularly with the Q3 results, **that's all pointing to STS.**\n>\n> And I think if you look at the relative performance of STS to KBR, I think year-to-date, it's circa 40% in the quarter, it's even higher. And so its contribution and its value to KBR is becoming clearer and clearer. **And hopefully, that reflects in the multiple as well as we go forward in terms of that contribution.** But, as we look into next year, we'll be the double-digit growth that we set ourselves will be coming off a much higher base. And clearly, that outpaces where we originally thought. And even a few months ago, thought we would be starting from. So I think that's probably the best way to look at it.\n>\n> — Stuart Bradie, KBR CEO.\n\nExhibit C: Post Re-Segmentation (January 2025)\n\n> And we're a very sort of -- not just from an STS comp perspective, you're quite right, there is **no pure comp in the market, so it makes it very, very difficult to just point to someone and say that's where you should trade.** There's no one in the market like a Sustainable Tech stand-alone business. If you wanted a comp there, it's difficult.\n>\n> — Stuart Bradie, KBR CEO.\n\nKBR has not been given multiples awarded to its peer group - as I'll show later, I believe this is undue. There has clearly been some difficulty messaging the value of the combined company. It is my belief that a spin-off would simplify the business and the following price discovery would be in favor of KBR investors, per the next point.\n\n### Point #4: Investor Sentiment\n\nThere are a few case studies in recent years that indicate an STS spin-off would be appreciated and unlock value. I'll start by mentioning other investors have noted the value of an STS spin-off: Irenic Capital Management, headed by a former Elliott Management manager, acquired a 1% stake in KBR in Q4 2024 citing specifically the value of STS and a desire to have the board spin the business off. As far as I could research, there was no animosity to this request, reinforced by points above; though, Irenic Capital has since sold out, which could have been for a variety of reasons. That said, here are some spin-offs that would point to positive investor sentiment:\n\n- General Electric (**GE**): GE into GE Vernova (**GEV**) (up ~400%) and GE Aviation (**GE**) (up ~60%), indicating positive sentiment for pure-play energy technology companies and penalties given to archaic industrial conglomerates.\n- Jacob's Solutions (**J**): J (up 20%) spin-off of Amentum (**AMTM**) (up ~30% prior to DOGE fears). KBR has an even stronger moat in energy technology than AMTM in the nuclear industry with higher growth, so I would consider a 30% appreciation rather tame in the case of a KBR-STS spin.\n- Danaher (**DHR**): DHR (~flat) spin-off of Veralto (**VLTO**) (up ~30%). Its water treatment business could be viewed in the same camp as STS's moon-shot plastics recycling business (via Mura Technology, a potential multi-bagger investment where KBR owns 20% that lives with STS).\n- Flex Ltd (**FLEX**): Flex (up ~100%) spin-off of Nextracker (**NXT**) (up ~100%). Nextracker's solar energy support solutions are comparable to STS in liquid natural gas, hydrogen, and biofuels.\n\n### Point #5: STS Can Command a High Multiple\n\nAdvanced and alternative energy solutions are typically rewarded high multiples by the market. Linde (**LIN**) is a leader in hydrogen production and carbon capture, with an 18x EV/EBITDA multiple. However, KBR's STS ammonia cracking technology has been commercialized for years - lying dormant until market demand arose - and is now deploying the technology to retrofit existing refineries to take full advantage of carbon neutral regulations and increasing hydrogen fuel production demand from Asia and the Middle East. KBR has a head start on Linde, who is pursuing a more efficient solution (KBR cites 85-90% efficiency for their technology), so a spin-off could take advantage of the lead and significant market share KBR has in terms of capturing value.\n\n\"Blue hydrogen,\" produced from carbon capture and cracking ammonia into hydrogen is an upstream part of the energy value chain with much less risk than downstream hydrogen fuel applications (e.g., vehicles, aviation, etc.). KBR-STS licenses its technology, provides maintenance support, and engineering and consulting services surrounding design, plant retrofits, and construction. In other words: low risk and low capex with high return on equity for a business with a technological moat. KBR does not take on the risk of building and maintaining the fixed cost of ammonia-fitted plants, insulating them from cycle shocks. Tack on double-digit top-line growth, and such characteristics command high multiples by the market.\n\n## Valuation\n\n### Without Spin-Off\n\nThis is certainly the easier (and less interesting) of the two situations. Management provided the following guidance for both Revised 2025 and 2027 targets:\n\n| Metric | Revised FY25G* | Revised FY27G* |\n| :--- | :--- | :--- |\n| **Revenues** | $7.9B - $8.1B | $9.0B+ |\n| **Adj. EBITDA** | $960M - $980M | $1.15B+ |\n| **Adj. EBITDA Margin** | - | 11+% |\n| **Adj. EPS** | $3.78 - $3.88 | - |\n| **Operating Cash Flow** | $500M - $550M | $650M+ |\n\n\\* Q2 Investor Presentation\n\nKBR is a capital-light company with notably less than 1% of revenues going to capex, so OCF guidance should be close to FCF, less ~$30M - $50M. GoodCo is expected to grow 10 - 15% CAGR and BadCo 5 - 8%, with margins for GoodCo are twice that of BadCo, so target margins are similar to 2024 levels as a result due to the margin dilution of BadCo.\n\nGuidance does not include effects of share repurchases, which in 2024 amounted to $300M (~2% of shares outstanding) and upsized to $750M as of Q1 2025. KBR has a history of share repurchases and the upsize in their authorization indicates management's view of the current share price.\n\nBelow are some comparables I consider when evaluating KBR. AMTM is the closest like-for-like peer given their similar segment profiles (defense and intelligence, and energy); SAIC is a pure-play of KBR's MTS business segment. Despite KBR's STS gem growing at double digits with 20%+ margins and even KBR's MTS business growing at 5-8% sales, it holds the lowest EV/EBITDA multiple with the lowest leverage ratio of the peer group, even lower than SAIC which has much lower growth expectations (low single digits) and lower profitability.\n\n| Company | EV/EBITDA (NTM) | EV/Sales (NTM) | Net Debt/EBITDA (LTM) | EBITDA Margin (LTM) |\n| :--- | :--- | :--- | :--- | :--- |\n| **KBR** | 8.96x | 1.01x | 2.4x | 11.24% |\n| **AMTM** | 9.57x | 0.74x | 4.0x | 7.6% |\n| **BAH** | 12.66x | 1.40x | 2.5x | 11% |\n| **LDOS** | 11.65x | 1.50x | 1.9x | 12% |\n| **SAIC** | 10.46x | 1.0x | 3.0x | 9.5% |\n\nManagement stated a desire to reach <2.5x leverage by FY25 through EBITDA growth, leaving the free cash flow open to share repurchases net dividend payout (~7%), which it hit with Q2 FY25; I presume a 2% reduction in share count in FY25, though management could certainly be more aggressive given cash on hand and FCF of ~$450 - $500M in FY25. Only $550M of debt maturities are due in FY27, so there is a lot of financial flexibility for management.\n\nAssigning a multiple of 10-11x to the lowest end of the FY25 guide, which gives STS zero premium despite being a superior business among the cohort: EV = $9.6B - $10.6B, less net debt of $2.4B = $7.2B - $8.2B market cap. With 127M shares outstanding (after 2% repurchases): $57 - $65 share price target within 12 months. Expectations for FY27 are not demanding, with share price likely to be driven by accelerated share repurchases with free cash flow on reaffirmed FY27 EBITDA guide of $1.15B (despite HomeSafe contract loss): $74 - $83 on 123 million shares outstanding.\n\n### HomeSafe Contract Aside\n\nThe aforementioned guidance was shared with investors before the termination of the HomeSafe Alliance Global Household Goods contract by the DOD Transportation Command in June 2025. This was a $20B contract over 9 years. Following the contract termination, the KBR COO who had primarily overseen MTS resigned and has not been replaced, with CEO Stuart Bradie taking over direct oversight. The impact of this contract loss, in my view, will be minimal. For one, the HomeSafe contract was fraught from the start, with an outstanding underbid that led to a majority of moving companies and unions not participating in work under the contract due to low wages, leading to a growing backlog by military families requesting moves that could not be fulfilled (or fulfilled poorly). As a result, the contract's value had never really contributed to the share price of KBR as investor sentiment at earnings calls were skeptical. KBR share price fell 10% after the contract termination announcement, a rather tame response given the size of the contract.\n\nIn any case, no EBITDA was expected to be generated by the HomeSafe contract in 2025, so that guidance has been reaffirmed by management. I originally modeled for FY27 EBITDA to be guided down to $1B from $1.15B, but Q2 FY25 guidance reaffirmed the original $1.15B EBITDA guide, despite a material drop in revenue. I was expecting HomeSafe to amount to some profits by FY27, but in reality, the HomeSafe contract would have amounted to thin margins, as it amounted to being a freight and logistics broker. The current quarter earnings include some discontinued operations losses owing to the HomeSafe contract termination; in the end, I think the loss of the contract is ultimately a good thing given that it was a significant distraction with low-quality earnings. This is reinforced by the fact that KBR expects MTS margins to increase in concert with the revenue loss.\n\nI prefer management focus their efforts and attention on their higher quality businesses and contract executions anyway; for example, STS margins increased from 20% to 23% in the quarter - time to put HomeSafe behind KBR and move on.\n\n### With Spin-Off\n\nThis is the harder situation to assess, primarily because of lack of pure-play comparables, especially in the biofuel, carbon capture, LNG, and hydrogen sectors that KBR leads in.\n\n| Company | FY24-FY27 Revenue Growth* | EBITDA (NTM) | EV/EBITDA (NTM) | EBITDA Margin (LTM) |\n| :--- | :--- | :--- | :--- | :--- |\n| **KBR-STS** | 11 - 15% | $450M - $500M** | ? | 20% |\n| **PWR** | 11.2% | $2743M | 23.82x | 10.3% |\n| **J** | 5.2% | $1214M | 15.41x | 10.4% |\n| **ACM** | 3.7% | $1190M | 13.87x | 7.4% |\n| **TTEK** | 2.6% | $644M | 17.64x | 14.56% |\n\n\\* Estimates from guidance (KBR) and consensus (PWR, J, ACM, TTEK)\n\\** Estimate from $2.2B FY24 sales, 10% growth, and 20% margin.\n\nKBR-STS would have the lowest scale out of the cohort, made up for by higher anticipated top-line growth along with notable higher margins. Given KBR-STS has leading market shares in attractive energy areas, strong business relationships with high-growth parts of the world (e.g., Middle East and Southeast Asia), and meaningful asset-light IP licensing business within this segment, I would be surprised if KBR-STS were to be given a multiple less than 14x, perhaps 14-16x given its lower scale - either way leading to a significant premium over the consolidated KBR business.\n\nBelow is a sum-of-parts assessment, with the low case meaningfully below guidance and the base and high case reflecting midpoint and highpoint of FY25 guidance. Note that corporate overhead is low given that KBR completed its re-segmentation to have each business be stand-alone, so the segment margins should be expected to reflect the vast majority of spin-off margins.\n\n| MTS | Low | Base | High |\n| :--- | :--- | :--- | :--- |\n| 2025 EBITDA | $550 | $550 | $550 |\n| EV/EBITDA | 10 | 10 | 10 |\n| Enterprise Value | $5.5B | $5.5B | $5.5B |\n| **STS** | | | |\n| 2025 EBITDA | $400M | $450M | $500M |\n| EV/EBITDA | 14 | 15 | 16 |\n| Enterprise Value | $5.6B | $6.8B | $8B |\n| **Corporate** | | | |\n| 2025 EBITDA | ($50M) | ($50M) | ($50M) |\n| EV/EBITDA | 12 | 12.5 | 13 |\n| **Net Debt** | $2.4B | $2.4B | $2.4B |\n| **Shares Outstanding** | 129M | 127M | 127M |\n| **Equity Value** | **$64** | **$73** | **$82** |\n\nFrom these estimates, the base case of a GoodCo spin-off would be a 20% premium over the consolidated scenario (and 60% appreciation from current prices of $46), not accounting for the increased focus and investment that spin-offs typically garner that could lead to improving margins or increased growth.\n\nAs with all government and engineering services firms, revenue visibility is high. In the case of KBR, STS has a 3-year weighted average lifespan on its major contracts, with $4B in backlog at end of FY24. This doesn't include recent Q2 contract news with Indonesia (refineries, TBD anticipated contract), Iraq (ammonia, more recurring IP licensing revenue), and BP energy partnership in Azerbaijan. This gives us more confidence into the revenue targets FY25-FY27.\n\nExtrapolating to FY27 with 11% top-line CAGR and 20% margins gives an STS enterprise value of $8.8B, and with 5% top-line CAGR and 10% margins gives an MTS enterprise value of $6.8B, leading to my base case estimate FY27 of $99.\n\n| ($M) | FY24 | FY25E | FY26E | FY27E |\n| :--- | :--- | :--- | :--- | :--- |\n| Revenue | $8,000 | $8,532 | $9,105 | $9,723 |\n| *MTS* | $5,800 | $6,090 | $6,395 | $6,714 |\n| *STS* | $2,200 | $2,442 | $2,711 | $3,009 |\n| EBITDA | $1,020 | $1,097 | $1,182 | $1,273 |\n| *MTS* | $580 | $609 | $639 | $671 |\n| *STS* | $440 | $488 | $542 | $602 |\n| Corporate | $50 | $55 | $60 | $65 |\n| Net Debt | $2,400 | $2,400 | $2,400 | $2,400 |\n| Shares Outstanding | 131 | 129 | 128 | 127 |\n| **Equity Value** | **$72** | **$80** | **$89** | **$99** |\n\n## Risks\n\nThe primary risk to the thesis is that a special situation never materializes (or materializes too long in the future). Even though my valuation of KBR in the combined company scenario still points to potentially higher share prices than the current print, it supposes that the market raise the multiple from the current ~9x to ~10-11x to align closer to the peer group cohort. While I argued that such a rerating is warranted, the market won't necessarily agree with me. It could be the case that the market never prescribes such a multiple and continues to keep valuation depressed. Awarding a higher multiple to KBR as a combined company may require properly messaging and demonstrating the value of the high-growth, high-earning STS business, which has been challenging. While KBR-STS has sustained its trajectory for several years, the market may need to see further proof of its sustainability, or perhaps sustainability on a larger scale.\n\nIn the event that neither my scenario of a rerating of consolidated KBR nor a special situation materializes, we may be looking at a share price that remains flat, at best.\n\nLastly, even if a spin-off were to occur, value could be destroyed. After all, the aforementioned Danaher and Jacobs spin-offs were rather muted. KBR-STS may need to rely more on price discovery - due to lack of comparables - which doesn't necessarily translate into that price discovery resulting in a higher valuation, and KBR has struggled to convince investors of its STS business to date.\n\n## Conclusion\n\nI do not usually pursue sum-of-the-parts investment cases, but KBR presents a situation that in my view presents a \"tails I win; heads I win more\", particularly in this environment where defense and government company M&A activity has been bouncing off the walls. I rate KBR a Strong Buy given its depressed valuation, favorable special situation outcomes, and strength of its Sustainable Technology Solutions business gem.\n\nMy 1-year target is: $57 (consolidated) - $73 (separated). Given revenue visibility over the next 24 months, I estimate FY27 of $74 (consolidated) - $99 (separated)."
      },
      {
        "title": "KBR: Engineering Tomorrow With Proprietary Decarbonization And Circularity",
        "publishOn": "2025-11-17T08:07:41-05:00",
        "content": "# Investment Overview\n\nKBR (KBR) is gradually moving away from being a hybrid engineering and defense services mix to becoming a more focused sustainability and technology platform. KBR has recently announced the spin-off of its Mission Technology Solutions (MTS) segment, which represents the defining milestone in this important transition. Post spin-off, the remaining business “Sustainable Technology Solutions (STS)” will operate as a capital-light, high-margin franchise that aligns directly with the decarbonization and clean-energy value chain. The clean ammonia, hydrogen, carbon capture, and circular plastics within the STS provide KBR with strong leverage to structural themes. The funnel of early-stage FEED and EPC opportunities has been widening, and some comfort is added by the ~$4bn bid pipeline that conversion should pick up meaningfully into FY26-27. In the near term, headline growth may still look modest, but the quality of earnings keeps getting better.\n\nIn the case of MTS, the spin-off is not a risk event, but rather a value unlock. It is a steady business characterized by a contract environment with a long-term view on funding, and I can envisage how it is becoming a stable cash generator on its own. Once it’s separated, MTS should be easier to value more in line with defense peers like Leidos and CACI rather than combined with the technological business activities of KBR, which has long obscured its narrative.\n\nThis is, in my opinion, a spin to focus and focus to compound strategy. STS will be a cleaner sustainability technology platform with margins of over 20%, and MTS will have the leeway to scale in defence modernization. The separation, in my view, will provide shareholders with a better view, increased capital efficiency, and a visible rerating when the market gets to know each business individually on its merits.\n\n## Recent News (Spin-off)\n\nOn Sep’25, KBR announced its plans to spin off (expected to complete by mid-to-late 2026) its MTS business segment into a new, publicly traded business. In my view, the intended spin should sharpen the story. Post-transaction, the new KBR will fundamentally be a sustainability and energy-transition company with foundations in the STS segment. The retained portfolio will be biased towards high-margin licensing, proprietary processes, and carbon management-related digital services. It is the type of business where visibility is a more valuable variable than volume, and where long-cycle project timing can obscure what is actually solid underlying momentum.\n\nThere’s also a broader signal here. The move may suggest management believes STS would be better off as a pure-play sustainability platform in the long term in comparison to a mixed-portfolio contractor. And frankly, that makes sense. As MTS is on its own, its recurring program business with NASA and the U.S. defense ecosystem would be eligible for a more predictable range of defense services valuation, and KBR can focus entirely on its more lucrative, technology-oriented identity.\n\nExecution risk, of course, is something to watch, especially in the areas of transition costs and capital allocation between the two entities. But the direction of travel feels right to me. KBR is simplifying its narrative in a manner that would enable investors to understand what has been quietly growing within the STS business over the years.\n\n## Topline Analysis & Outlook\n\nKBR reported on Q3 revenue of $1.93bn, roughly flat on a year-over-year basis. Growth in Defense & Intelligence and Energy Transition technologies was balanced by a decrease in Readiness & Sustainment. At first glance, the results were muted, but I liked the shift in mix - from legacy, low margin contracts towards high certainty, high margin work. In addition, the backlog and options of approximately $23.4bn, or three years' worth of expected orders, for KBR indicate continued stability of revenues, despite the distortion of short-term visibility in award times and government protests. What also stands out to me is the fact that bookings and recompete wins continue to be steady confirms that the momentum of revenue is delayed, not vanished. Management reduced its revenue outlook for FY25 by $200bn (from $7.90bn to $8.10bn, to $7.75bn to $7.85bn) to account for near-term award delays and the U.S. government shutdown. Multi-year growth expectations have not changed.\n\nMission Technology Solutions (MTS) posted $1.4bn in Q3 revenue and remains KBR's operational anchor, although experiencing a little bit of a dip in conversion. Year on year revenue was stagnant, although Defense & Intelligence grew about 14% from digital mission systems, cyber analytics, and classified work. This increase was offset by a ~22% decrease in Readiness & Sustainment and a 5% decrease in Science & Space (as legacy programs in the space and logistics were winding down at the space agency). Despite the drag, MTS is moving its mix towards higher-value defence modernisation and digital engineering programmes, putting it on a path for sustainable growth. MTS's bid pipeline comes to $18bn, nearly three-fourths new business. This provides clear visibility into FY26-27, with defence modernization, space resilience, and allied governments outsourcing, including the U.K., Australia, and NATO, being the next growth engines. In the near term, I do foresee a flat or slightly lower Q4 revenue, as contract protests of roughly $3bn and shutdown delays reduce conversions. But I believe the foundation for recovery is taking shape. As award flow returns to normal and new international wins flow in, I expect MTS to return to a low to mid single-digit growth rate per annum through FY27, driven by scale in cyber, autonomy, and next-generation propulsion systems, all important areas of defence digital transformation.\n\nSTS produced $525bn in Q3 revenue, a small year-over-year decrease, where execution delays were outweighed primarily as a result of STS executing on its strategy for projects that are currently being phased. Although there were some EPC deferrals to 2026, the STS pipeline is solidly in place due to growing demand for low-carbon ammonia, hydrogen, carbon capture, and circular plastics. KBR's proprietary technologies continue to be successful throughout the world. There is a $4bn STS bid pipeline that consists of preliminary engineering studies for energy transition complexes in North America, the Middle East, and Asia. There has been recent success with the sale of licensing rights for green ammonia and sustainable fuels. There are industry fundamentals that support STS' trend: global LNG export capacity will double by 2029, and US power demand will grow at a rate of more than 3% per annum until 2040; both of which represent a long-term upcycle in the market for decarbonization and process design infrastructure. I expect mid-to-high single-digit growth rates for STS through FY27, supported by an increasing share of revenue derived from licensing of KBR's technologies, and consistent conversion of feasibility engineering development (\"FEED\") into execution revenue.\n\nThat said, at the group level, the structure of revenues is shifting towards equilibrium: stable, secular defense business through MTS, and policy-led, technology-rich growth through STS. I expect FY25 to come in somewhere between flat to low single-digit growth, but With award protests behind us, accelerating energy transition capital spending, and the MTS spin off enabling greater focus, I see KBR coming into FY26-27 with 5-6% revenue growth per annum, with a leaner, more resilient portfolio that resonates with long-term themes of defence modernisation and de-carbonisation. The mix is improving, the quality of the backlog is strong, and the company’s exposure to case studies with enduring structural themes creates more of a feeling that this is less of a cyclical recovery and instead more of a structural re-rate to a more resilient and higher-value business model.\n\n## Margin Analysis & Outlook\n\nQ3 margins at KBR showed the underlying resiliency of KBR's portfolio, although top-line growth was slow. Group-level adjusted EBITDA margin was around 12.4% - an increase of l110 bps year-on-year, led by discipline cost control, a favourable mix and efficient execution. This stability is impressive in the face of flat revenue and government award delays, and speaks to the structural earnings de-risking of KBR. Both segments have shown strong underlying profitability during this period; however, each segment has shown different profitability trends based on the different business models they represent.\n\nIn Mission Technology Solutions (MTS), adjusted EBITDA margin remained in the low to mid 8% range, consistent with prior years' levels, and reflects the Company's consistent operating results in high-value Defense and Intelligence programs. Though Readiness & Sustainment softness and shutdown-linked delays constrained short-term conversion, MTS is moving its mix towards software, analytics, and digital mission systems - areas that naturally have higher incremental margins. As award protests are settled and utilisation normalizes, I am looking at margin expansion of 30-50 bps till FY27, driven by a higher share of international work, better programme management, and scaling of digital defence offerings. The planned spin-off also provides scope for sharper cost discipline and capital allocation, which will see normalised EBITDA margins approaching the high-8% range by FY27.\n\nMeanwhile, the profit engine is still Sustainable Technology Solutions (STS). Segment EBITDA margin is higher than 20% confirming the strength of its IP and licensing-led model. The third quarter saw increased contributions from both proprietary technology revenues and beneficial joint venture income, partially offset by phasing issues related to EPC conversion. I see the trajectory of the margin as stable or slightly improving to an average of 20-21% through FY27. The ongoing mix shift to green ammonia, carbon capture, and circular plastics solutions should continue to allow for pricing power, and scale benefits from recent technology wins may mitigate the negative impact of inflationary cost increases.\n\nAll in, I am expecting consolidated adjusted EBITDA margins will grow 75-100 bps over FY25-27 to the mid-12% range as the portfolio will be more technology-weighted and operational leverage will increase with the recovery of the revenue. The slight dilution by MTS near-term flatness should be more than compensated by its expansion in STS. Notably, the continued focus by the management on the capital-light, recurring-revenue model will place KBR in a position to maintain high levels of free cash flow conversion, which could be more than 90 percent of net income by FY27, which will provide it with the ability to reinvest and make shareholder returns once the spin is finalized.\n\nOverall, margin growth at this point will be less cyclical and more structural: the mix of more valuable IP work, disciplined cost structure, and portfolio separation will position the company to achieve a gradual increase in profitability in the next 12-24 months.\n\n## Financial Forecast\n\n(Data reflects historical and author estimates for KBR consolidated performance).\n\n## Peers & Valuation\n\nKBR trades at the forward EV/EBITDA of ~7.9x, which is significantly lower than KBR's historical average of ~12.0x and lower than the defense prime contractors and sustainability technology peers. To provide additional context, Defense prime contractors such as Booz Allen Hamilton (BAH) (11.6×), Leidos (LDOS) (12.4×), SAIC (9.7×), CACI (14.3×), and Parsons (PSN) (16.2×) are trading at an average of ~12.8× forward EV/EBITDA. Sustainability-focused companies such as Jacobs Solutions (J) (17.5×), AECOM (ACM) (16.2×), Worthington (WOR) (9.9×), and Fluor (FLR) (15.8×) trade around ~14.8× forward EV/EBITDA.\n\nWithin my SOTP framework, I assigned ~9x EV / EBITDA to the MTS spin-off and ~11x EV / EBITDA to the retained STS platform. The multiples I assigned are less than the peers' averages to account for (i) the delay in converting awards in MTS due to U.S. budget uncertainty and (ii) the initial phase of scaling for STS in terms of revenue and profitability. These conservative multiples allow me to emphasize the need for disciplined execution, while providing room for a higher rating when visibility increases after the spin-off.\n\nTaking the group level, these imply an implied equity value per share of ~$61 by FY27, which would represent ~44% upside from today's prices (including dividend), before considering any incremental buybacks or accretive bolt-on acquisitions. Based on normalized metrics, STS's technology intensity and mid-20s EBITDA margins justify a structural premium to traditional EPC companies, while MTS's strong cash conversion and low-risk cost-plus contracting structure support steady mid-single-digit compounded earnings growth.\n\nThe current valuation discounts KBR's timing issues relative to the cycle; however, the structural shift that KBR is undergoing will be reflected in the gradual expansion of KBR's multiples towards those of the peer companies. Once the spin-off occurs, there will be clear comparable companies and more capital-efficient operating models for each segment, resulting in multiple expansions.\n\n## Risks\n\nTiming and execution uncertainty with regard to the spin-off, contract award delays or government funding, and defense spending cycles are some of the key risks. In STS, the loss of income in the near future may be experienced due to delays in the approval of hydrogen and carbon-capture projects. The margins can also be strained in the short term due to currency fluctuations and restructuring expenses. In addition, KBR is currently facing a putative shareholder class-action lawsuit relating to past disclosures. As this matter is still in early procedural stages, no findings have been made, and I am not drawing any conclusions about the merits. However, such legal proceedings can add a layer of uncertainty around headline sentiment and may require incremental management attention. To me, these risks appear to be short-lived and not structural.\n\n## Conclusion\n\nTo me, KBR is at a critical juncture. The MTS spin-off does not represent a strategic retreat, but rather a fundamental structural realignment of the two business segments to allow them to show their true economic value. After the spin-off, the remaining Sustainable Technology Solutions (STS) business unit will be a capital-light business with high margins based on clean energy technologies, decarbonization, and circularity. Alongside this transition, the company is also navigating a recently filed shareholder class-action lawsuit. As the case is ongoing and no court has made any determination, I do not view it as altering the long-term investment narrative. With strong, long-term visibility regarding demand, improving margin trajectory, and balance sheet flexibility, I believe KBR has the opportunity to grow its earnings at a rate higher than the market and expand its multiples, as the market re-rates KBR from a pure engineering contractor to a pure-play technology-based sustainability franchise. In short, KBR’s future success is dependent upon execution, not strategy."
      },
      {
        "title": "KBR: Engineering Tomorrow With Proprietary Decarbonization And Circularity",
        "publishOn": "2025-11-17T08:07:41-05:00",
        "content": "# KBR Analysis: KBR: Engineering Tomorrow With Proprietary Decarbonization And Circularity\n\n## Investment Overview\n\nKBR (**KBR**) is gradually moving away from being a hybrid engineering and defense services mix to becoming a more focused sustainability and technology platform. KBR has recently announced the spin-off of its Mission Technology Solutions (MTS) segment, which represents the defining milestone in this important transition. Post spin-off, the remaining business “Sustainable Technology Solutions (STS)” will operate as a capital-light, high-margin franchise that aligns directly with the decarbonization and clean-energy value chain. The clean ammonia, hydrogen, carbon capture, and circular plastics within the STS provide KBR with strong leverage to structural themes. The funnel of early-stage FEED and EPC opportunities has been widening, and some comfort is added by the ~$4bn bid pipeline that conversion should pick up meaningfully into FY26-27. In the near term, headline growth may still look modest, but the quality of earnings keeps getting better.\n\nIn the case of MTS, the spin-off is not a risk event, but rather a value unlock. It is a steady business characterized by a contract environment with a long-term view on funding, and I can envisage how it is becoming a stable cash generator on its own. Once it’s separated, MTS should be easier to value more in line with defense peers like Leidos and CACI rather than combined with the technological business activities of KBR, which has long obscured its narrative.\n\nThis is, in my opinion, a spin to focus and focus to compound strategy. STS will be a cleaner sustainability technology platform with margins of over 20%, and MTS will have the leeway to scale in defence modernization. The separation, in my view, will provide shareholders with a better view, increased capital efficiency, and a visible rerating when the market gets to know each business individually on its merits.\n\n## Recent News (Spin-off)\n\nOn Sep’25, KBR announced its plans to spin off (expected to complete by mid-to-late 2026) its MTS business segment into a new, publicly traded business. In my view, the intended spin should sharpen the story. Post-transaction, the new KBR will fundamentally be a sustainability and energy-transition company with foundations in the STS segment. The retained portfolio will be biased towards high-margin licensing, proprietary processes, and carbon management-related digital services. It is the type of business where visibility is a more valuable variable than volume, and where long-cycle project timing can obscure what is actually solid underlying momentum.\n\nThere’s also a broader signal here. The move may suggest management believes STS would be better off as a pure-play sustainability platform in the long term in comparison to a mixed-portfolio contractor. And frankly, that makes sense. As MTS is on its own, its recurring program business with NASA and the U.S. defense ecosystem would be eligible for a more predictable range of defense services valuation, and KBR can focus entirely on its more lucrative, technology-oriented identity.\n\nExecution risk, of course, is something to watch, especially in the areas of transition costs and capital allocation between the two entities. But the direction of travel feels right to me. KBR is simplifying its narrative in a manner that would enable investors to understand what has been quietly growing within the STS business over the years.\n\n## Topline Analysis & Outlook\n\nKBR reported on Q3 revenue of $1.93bn, roughly flat on a year-over-year basis. Growth in Defense & Intelligence and Energy Transition technologies was balanced by a decrease in Readiness & Sustainment. At first glance, the results were muted, but I liked the shift in mix - from legacy, low margin contracts towards high certainty, high margin work. In addition, the backlog and options of approximately $23.4bn, or three years' worth of expected orders, for KBR indicate continued stability of revenues, despite the distortion of short-term visibility in award times and government protests. What also stands out to me is the fact that bookings and recompete wins continue to be steady confirms that the momentum of revenue is delayed, not vanished. Management reduced its revenue outlook for FY25 by $200bn (from $7.90bn to $8.10bn, to $7.75bn to $7.85bn) to account for near-term award delays and the U.S. government shutdown. Multi-year growth expectations have not changed.\n\nMission Technology Solutions (MTS) posted $1.4bn in Q3 revenue and remains KBR's operational anchor, although experiencing a little bit of a dip in conversion. Year on year revenue was stagnant, although Defense & Intelligence grew about 14% from digital mission systems, cyber analytics, and classified work. This increase was offset by a ~22% decrease in Readiness & Sustainment and a 5% decrease in Science & Space (as legacy programs in the space and logistics were winding down at the space agency). Despite the drag, MTS is moving its mix towards higher-value defence modernisation and digital engineering programmes, putting it on a path for sustainable growth. MTS's bid pipeline comes to $18bn, nearly three-fourths new business. This provides clear visibility into FY26-27, with defence modernization, space resilience, and allied governments outsourcing, including the U.K., Australia, and NATO, being the next growth engines. In the near term, I do foresee a flat or slightly lower Q4 revenue, as contract protests of roughly $3bn and shutdown delays reduce conversions. But I believe the foundation for recovery is taking shape. As award flow returns to normal and new international wins flow in, I expect MTS to return to a low to mid single-digit growth rate per annum through FY27, driven by scale in cyber, autonomy, and next-generation propulsion systems, all important areas of defence digital transformation.\n\nSTS produced $525bn in Q3 revenue, a small year-over-year decrease, where execution delays were outweighed primarily as a result of STS executing on its strategy for projects that are currently being phased. Although there were some EPC deferrals to 2026, the STS pipeline is solidly in place due to growing demand for low-carbon ammonia, hydrogen, carbon capture, and circular plastics. KBR's proprietary technologies continue to be successful throughout the world. There is a $4bn STS bid pipeline that consists of preliminary engineering studies for energy transition complexes in North America, the Middle East, and Asia. There has been recent success with the sale of licensing rights for green ammonia and sustainable fuels. There are industry fundamentals that support STS' trend: global LNG export capacity will double by 2029, and US power demand will grow at a rate of more than 3% per annum until 2040; both of which represent a long-term upcycle in the market for decarbonization and process design infrastructure. I expect mid-to-high single-digit growth rates for STS through FY27, supported by an increasing share of revenue derived from licensing of KBR's technologies, and consistent conversion of feasibility engineering development (\"FEED\") into execution revenue.\n\nThat said, at the group level, the structure of revenues is shifting towards equilibrium: stable, secular defense business through MTS, and policy-led, technology-rich growth through STS. I expect FY25 to come in somewhere between flat to low single-digit growth, but With award protests behind us, accelerating energy transition capital spending, and the MTS spin off enabling greater focus, I see KBR coming into FY26-27 with 5-6% revenue growth per annum, with a leaner, more resilient portfolio that resonates with long-term themes of defence modernisation and de-carbonisation. The mix is improving, the quality of the backlog is strong, and the company’s exposure to case studies with enduring structural themes creates more of a feeling that this is less of a cyclical recovery and instead more of a structural re-rate to a more resilient and higher-value business model.\n\n## Margin Analysis & Outlook\n\nQ3 margins at KBR showed the underlying resiliency of KBR's portfolio, although top-line growth was slow. Group-level adjusted EBITDA margin was around 12.4% - an increase of l110 bps year-on-year, led by discipline cost control, a favourable mix and efficient execution. This stability is impressive in the face of flat revenue and government award delays, and speaks to the structural earnings de-risking of KBR. Both segments have shown strong underlying profitability during this period; however, each segment has shown different profitability trends based on the different business models they represent.\n\nIn Mission Technology Solutions (MTS), adjusted EBITDA margin remained in the low to mid 8% range, consistent with prior years' levels, and reflects the Company's consistent operating results in high-value Defense and Intelligence programs. Though Readiness & Sustainment softness and shutdown-linked delays constrained short-term conversion, MTS is moving its mix towards software, analytics, and digital mission systems - areas that naturally have higher incremental margins. As award protests are settled and utilisation normalizes, I am looking at margin expansion of 30-50 bps till FY27, driven by a higher share of international work, better programme management, and scaling of digital defence offerings. The planned spin-off also provides scope for sharper cost discipline and capital allocation, which will see normalised EBITDA margins approaching the high-8% range by FY27.\n\nMeanwhile, the profit engine is still Sustainable Technology Solutions (STS). Segment EBITDA margin is higher than 20% confirming the strength of its IP and licensing-led model. The third quarter saw increased contributions from both proprietary technology revenues and beneficial joint venture income, partially offset by phasing issues related to EPC conversion. I see the trajectory of the margin as stable or slightly improving to an average of 20-21% through FY27. The ongoing mix shift to green ammonia, carbon capture, and circular plastics solutions should continue to allow for pricing power, and scale benefits from recent technology wins may mitigate the negative impact of inflationary cost increases.\n\nAll in, I am expecting consolidated adjusted EBITDA margins will grow 75-100 bps over FY25-27 to the mid-12% range as the portfolio will be more technology-weighted and operational leverage will increase with the recovery of the revenue. The slight dilution by MTS near-term flatness should be more than compensated by its expansion in STS. Notably, the continued focus by the management on the capital-light, recurring-revenue model will place KBR in a position to maintain high levels of free cash flow conversion, which could be more than 90 percent of net income by FY27, which will provide it with the ability to reinvest and make shareholder returns once the spin is finalized.\n\nOverall, margin growth at this point will be less cyclical and more structural: the mix of more valuable IP work, disciplined cost structure, and portfolio separation will position the company to achieve a gradual increase in profitability in the next 12-24 months.\n\n## Peers & Valuation\n\nKBR trades at the forward EV/EBITDA of ~7.9x, which is significantly lower than KBR's historical average of ~12.0x and lower than the defense prime contractors and sustainability technology peers. To provide additional context, Defense prime contractors such as BAH (11.6×), LDOS (12.4×), SAIC (9.7×), CACI (14.3×), and PSN (16.2×) are trading at an average of ~12.8× forward EV/EBITDA. Sustainability-focused companies such as Jacobs Solutions (J) (17.5×), ACM (16.2×), WOR (9.9×), and FLR (15.8×) trade around ~14.8× forward EV/EBITDA.\n\nWithin my SOTP framework, I assigned ~9x EV / EBITDA to the MTS spin-off and ~11x EV / EBITDA to the retained STS platform. The multiples I assigned are less than the peers' averages to account for (i) the delay in converting awards in MTS due to U.S. budget uncertainty and (ii) the initial phase of scaling for STS in terms of revenue and profitability. These conservative multiples allow me to emphasize the need for disciplined execution, while providing room for a higher rating when visibility increases after the spin-off.\n\nTaking the group level, these imply an implied equity value per share of ~$61 by FY27, which would represent ~44% upside from today's prices (including dividend), before considering any incremental buybacks or accretive bolt-on acquisitions. Based on normalized metrics, STS's technology intensity and mid-20s EBITDA margins justify a structural premium to traditional EPC companies, while MTS's strong cash conversion and low-risk cost-plus contracting structure support steady mid-single-digit compounded earnings growth.\n\nThe current valuation discounts KBR's timing issues relative to the cycle; however, the structural shift that KBR is undergoing will be reflected in the gradual expansion of KBR's multiples towards those of the peer companies. Once the spin-off occurs, there will be clear comparable companies and more capital-efficient operating models for each segment, resulting in multiple expansions.\n\n## Risks\n\nTiming and execution uncertainty with regard to the spin-off, contract award delays or government funding, and defense spending cycles are some of the key risks. In STS, the loss of income in the near future may be experienced due to delays in the approval of hydrogen and carbon-capture projects. The margins can also be strained in the short term due to currency fluctuations and restructuring expenses. In addition, KBR is currently facing a putative shareholder class-action lawsuit relating to past disclosures. As this matter is still in early procedural stages, no findings have been made, and I am not drawing any conclusions about the merits. However, such legal proceedings can add a layer of uncertainty around headline sentiment and may require incremental management attention. To me, these risks appear to be short-lived and not structural.\n\n## Conclusion\n\nTo me, KBR is at a critical juncture. The MTS spin-off does not represent a strategic retreat, but rather a fundamental structural realignment of the two business segments to allow them to show their true economic value. After the spin-off, the remaining Sustainable Technology Solutions (STS) business unit will be a capital-light business with high margins based on clean energy technologies, decarbonization, and circularity. Alongside this transition, the company is also navigating a recently filed shareholder class-action lawsuit. As the case is ongoing and no court has made any determination, I do not view it as altering the long-term investment narrative. With strong, long-term visibility regarding demand, improving margin trajectory, and balance sheet flexibility, I believe KBR has the opportunity to grow its earnings at a rate higher than the market and expand its multiples, as the market re-rates KBR from a pure engineering contractor to a pure-play technology-based sustainability franchise. In short, KBR’s future success is dependent upon execution, not strategy."
      },
      {
        "title": "KBR: Earnings Up, Share Price Down In Value Opportunity",
        "publishOn": "2025-07-27T12:42:19-04:00",
        "content": "## **Investment thesis**\n\nOn the summary page for **KBR, Inc.** ([KBR](https://seekingalpha.com/symbol/KBR)), the Seeking Alpha system warns: “KBR is at high risk of performing badly”. If you click to learn why, the system explains that KBR has characteristics “normally associated” with poor future performance.\n\nHowever, I will argue that this warning is more applicable to short-term traders and less applicable to long-term investors. While the price may be sliding, earnings keep growing.\n\nThat suggests a value investing opportunity; I expect the price to rise by just over 13% in one year and maintain my Buy rating.\n\nThe system lists two metrics that signal trouble: decelerating momentum and negative EPS revisions.\n\n## **Momentum**\n\nFirst, this table shows how momentum has fluctuated over the past year, from D to D-, to D+, and then to F in the past four quarters. Clearly, KBR’s performance is lackluster compared to that of the Industrials median:\n\n**KBR momentum table (Seeking Alpha)**\n\nIf you look on the right side of the table, you can see that it has outperformed the sector over the past five years. So performance since November 2024 is an aberration.\n\nThe momentum grades reflect the firm’s slumping share price:\n\n**KBR 1-year price chart (Seeking Alpha)**\n\nAs I reported in my January 16, 2025 article, “[KBR: Uncertainty Over Activist Investor And Government Spending Cuts](https://seekingalpha.com/article/4749824-kbr-uncertainty-over-activist-investor-and-government-spending-cuts),” its share price peaked at $72.02 on November 11, 2024, a few days after the federal election brought in a new administration. Investors became concerned that KBR would be harmed by federal spending cuts by the then new Department of Government Efficiency, or DOGE.\n\nFurther uncertainty came in December when Irenic Capital Management, an activist investment firm, reported it had accumulated a 1% stake in the company. Reports suggested Irenic wanted to split up KBR.\n\nAs the chart above shows, the price has kept drifting down since November, which is not surprising as the uncertainty about tariffs and spending cuts continue.\n\nAre investor concerns justified? Perhaps, but as KBR President and CEO Stuart Bradie observed on the [Q1-2025 earnings call](https://seekingalpha.com/article/4782264-kbr-inc-kbr-q1-2025-earnings-call-transcript),\n\n> KBR, as you know, is a high-end technology and professional services business and does not import our [or] export products as a significant part of our business. Furthermore, we do not procure raw materials, nor do any manufacturing in China.\n> \n> That said, if our clients experience the cost of material increase due to tariffs, CapEx budgets may be reevaluated. As of now, we are not seeing a material change in customer behavior, but of course continue to monitor a situation.\n\nHis comments are backed up by a solid set of fundamentals, as shown in this 10-year chart:\n\n**KBR revenue, net income, and EPS chart (Seeking Alpha)**\n\nAs the chart shows, net income and basic EPS have grown steadily over the past four quarters. Will they continue to grow?\n\nQuite likely, they will. Earnings momentum is strong and likely will remain so.\n\n## **Negative EPS revisions**\n\nAs this table from the KBR summary page shows, the number of Down revisions exceeds the number of Up revisions:\n\n**KBR earnings revisions table (Seeking Alpha)**\n\nWhen looking at earnings revisions, it's also helpful to check out the ratings provided by the same Wall Street analysts. They have five Strong Buys, one Buy, and three Holds. To put this another way, there are twice as many Buys and Strong Buys as there are Holds—and there are no Sell or Strong Sell ratings.\n\nWhat’s more, they have an average, one-year price target of $64.63, a 37.25% increase over the July 24 closing price of $47.09. The lowest of the price targets is $54.00, presumably provided by one of the analysts with a Hold rating, which represents a 14.7% increase. Even the lowest of these targets is substantial.\n\nFinally, on this issue, the consensus among the Wall Street analysts is for double-digit normalized earnings growth this year and near double-digit growth next year.\n\nClearly, we have some form of disconnect here. Negative earnings revisions by Wall Street analysts are rebutted by their own ratings, price targets, and earnings forecasts.\n\nTo make sense of the various perspectives on earnings, consider short-term and long-term approaches to investing.\n\nIn the short term, let’s say a month to six months, it’s possible the share price could continue falling as uncertainty over tariffs and Irenic linger.\n\nBut, in the long term, we should expect KBR’s earnings to grow and push up the share price. This is what management provided in the [Q1-2025 earnings report](https://seekingalpha.com/pr/20091271-kbr-reports-first-quarter-fiscal-2025-results#hasComeFromMpArticle=false):\n\n**KBR guidance table (Q1-2025 earnings report)**\n\nFor comparison, in fiscal 2024, which ended on January 3, 2025 (as recorded in the Q4-2024 earnings report):\n\n- **Revenue**: $7.742 million, versus the 2025 midpoint of $8.9 billion.\n- **Adjusted EBITDA**: $870 million, versus the 2025 midpoint of $970 million.\n- **Adjusted EPS**: $3.34 versus the 2025 midpoint of $3.83.\n- **Operating cash flows**: $462 million, versus the 2025 midpoint of $525 million.\n\nAlso adding steam to KBR’s optimistic guidance is another detail listed in the report: backlog and options worth $20.5 billion dollars, down slightly from Q1-2024’s $21.2 billion. If nothing else, this means the company should be busy for at least a couple of years, even if its customers are affected by tariffs or if there is an economic slowdown (bearing in mind that backlog doesn’t necessarily turn into revenue and earnings, but the odds are on KBR’s side).\n\nObviously, not only does the company expect it will do better this year than last year, but also that it will do *much* better. Wall Street analysts expect normalized EPS to reach $3.81 for the year, a 14.18% gain over 2024:\n\n**KBR EPS estimates table (Seeking Alpha)**\n\n## **The KBR share price**\n\nWhile earnings have risen and are expected to keep rising, the share price has gone in the opposite direction since last November:\n\n**KBR 10-year price chart (Seeking Alpha)**\n\nWhen earnings are going up and the price is going down, there may be opportunities for value investors and others. That is confirmed by its major valuation grades:\n\n**KBR valuation table (Seeking Alpha)**\n\nI believe KBR is current undervalued.\n\nTo set a one-year price target, I will use the EPS estimates from Wall Street analysts. Specifically, I will take three quarters of their 2025 estimate of 14.18% (since one quarter is already complete), and one quarter of the 2026 estimate of 9.66%.\n\nThat works out to 13.06%, and adding that amount to the July 25 closing price of $47.15 gives us a target of $53.31. Given this significant increase in the share price and bullish earnings situation, I will maintain my Buy rating, and for essentially the same reason. KBR has a significant amount of upside potential, despite the uncertainties that drive the share price.\n\nAs noted, the Wall Street analysts have a one-year target of $64.63, an increase of 37.07% increase over the closing price. They have a collective Buy, based on five Strong Buys, one Buy, and three Holds.\n\nOne other Seeking Alpha analyst has posted a rating in the past 90 days, a Buy. And the Quant system has a Sell, based on its quantitative concern about momentum and negative net earnings revisions.\n\n## **Risk factors**\n\nAlthough I believe the Quant system is too heavily reliant on the current share price and negative earnings revisions, it may be correct in both the short term and long term. The share price could continue to slip.\n\nSome of its revenue originates with the federal government, and budget cuts may reduce the number or value of new contracts.\n\nBy the end of the first quarter, tariff issues had not affected its costs or it markets. However, management did express concern about its customers being affected by tariffs, and as a result might spend less with KBR.\n\nTariffs or other economic factors such as interest rates, might drive down demand for its services. A recession or other economy-wide slowdown could affect both its revenue and profitability.\n\nIt competes with other large and economically powerful firms, and as a result could lose market share or have its reputation harmed if there are any serious problems or mistakes by its personnel or contractors.\n\n## **Conclusion**\n\nAs I have shown, concern about decelerating momentum and negative earnings revisions are of limited value in assessing the future of KBR, Inc.\n\nShareholders and would-be investors would be better served studying the fundamentals, which strongly suggest continuing increases on the top and bottom lines, backed up by $20.5 billion worth backlog and options."
      }
    ],
    "press_releases": [
      {
        "title": "KBR Awarded Seat on $10 Billion Ceiling Readiness and Sustainment Support Contract with U.S. Naval Supply Systems Command",
        "publishOn": "2025-12-18T06:00:00.000-05:00",
        "content": "# KBR Awarded Seat on $10 Billion Ceiling Readiness and Sustainment Support Contract with U.S. Naval Supply Systems Command\n\n**HOUSTON**, Dec. 18, 2025 (GLOBE NEWSWIRE) -- **KBR (NYSE: KBR)** announced today it has been awarded a seat on a multiple award, indefinite delivery indefinite quantity (IDIQ) contract by the **U.S. Naval Supply Systems Command (NAVSUP)**. The NAVSUP Worldwide Expeditionary Multiple Award Contract (WEXMAC) 2.1 Territorial Integrity of the United States (TITUS) is a contract for readiness and sustainment focused on defense of the continental United States.\n\nUnder WEXMAC 2.1 TITUS, KBR will compete on IDIQ task orders to provide essential supplies and services to support U.S. military and coalition partner operations, humanitarian assistance and disaster relief efforts. Tasks may include a wide range of support services such as stability operations, civil support and supply chain and distribution services. WEXMAC 2.1 TITUS task orders are expected to be firm fixed price. The contract spans a five-year base period with an additional five-year option period. The five-year option period would bring the ceiling amount to $20 billion.\n\n“KBR has earned a global reputation as an industry leader in mission-critical support services to the U.S. military and coalition partners,” said **Doug Hill**, KBR Readiness & Sustainment President. “This contract is an opportunity to support the U.S. Navy at home, focused on defense of the United States. As The Team Behind the Mission®, we’re proud to leverage our decades of Navy experience to help the Naval Supply Systems Command achieve its mission in the U.S.”\n\nKBR currently supports the U.S. Naval Facilities Engineering Systems Command (NAVFAC) in Europe, Africa and Asia. Known for being able to operate in global, austere environments and execute complicated logistics, KBR has a diverse and talented workforce and innovative technologies to support the U.S. government and commercial clients worldwide.\n\n## About KBR\n\nWe deliver science, technology and engineering solutions to governments and companies around the world. KBR employs approximately 37,000 people worldwide with customers in more than 80 countries and operations in over 29 countries.\n\nKBR is proud to work with its customers across the globe to provide technology, value-added services, and long-term operations and maintenance services to ensure consistent delivery with predictable results. At KBR, We Deliver.\n\nVisit [www.kbr.com](https://www.kbr.com)\n\n## Forward Looking Statements\n\nThe statements in this press release that are not historical statements, including statements regarding KBR’s mission-critical support services to the U.S. military and coalition partners, are forward-looking statements within the meaning of the federal securities laws. These statements are subject to numerous risks, uncertainties and assumptions, many of which are beyond the company’s control, that could cause actual results to differ materially from the results expressed or implied by the statements. These risks, uncertainties and assumptions include, but are not limited to, those set forth in the company’s most recently filed Annual Report on Form 10-K, any subsequent Form 10-Qs and 8-Ks and other U.S. Securities and Exchange Commission filings, which discuss some of the important risks, uncertainties and assumptions that the company has identified that may affect its business, results of operations and financial condition. Due to such risks, uncertainties and assumptions, you are cautioned not to place undue reliance on such forward-looking statements, which speak only as of the date hereof. Except as required by law, the company undertakes no obligation to revise or update publicly any forward-looking statements for any reason.\n\n## For further information, please contact:\n\n**Investors**\nJamie DuBray\nVice President, Investor Relations\n713-753-5082\nInvestors@kbr.com\n\n**Media**\nPhilip Ivy\nVice President, Global Communications and Marketing\n713-753-3800\nMediaRelations@kbr.com"
      },
      {
        "title": "KBR’s Methanol Technology Selected by Fikrat Al-Tadweer for the First Biomethanol Plant in Saudi Arabia",
        "publishOn": "2025-12-16T06:00:00.000-05:00",
        "content": "# KBR’s Methanol Technology Selected by Fikrat Al-Tadweer for the First Biomethanol Plant in Saudi Arabia\n\n**HOUSTON, Dec. 16, 2025 (GLOBE NEWSWIRE)** -- KBR (NYSE: KBR) announced today that it has been awarded a contract for its PureM^SM green methanol technology by Fikrat Al-Tadweer for a pioneering biomethanol plant in Saudi Arabia for transforming landfill-gas into clean fuels.\n\nKBR’s PureM solution is designed for commercial-scale deployment with a low cost of renewable methanol production. The technology can utilize a wide range of feedstocks, including biogas, gasification-derived syngas, hydrogen, and pure CO2, enabling flexibility and efficiency. Under the terms of the contract, KBR will provide technology licensing, proprietary engineering design, catalyst, and proprietary equipment for the biomethanol facility.\n\n“We are proud to support Fikrat Al-Tadweer in its groundbreaking biomethanol project, which aligns with Saudi Arabia’s national policy on eliminating landfill gas emissions and creating sustainable fuels,” said Jay Ibrahim, President, KBR Sustainable Technology Solutions. “This collaboration underscores KBR’s commitment to enabling global energy security and supporting the Kingdom’s vision for a cleaner, greener future.”\n\nKBR has been a leader in innovative, sustainable process technology development, commercialization, and plant design solutions for over 50 years.\n\n## About KBR\nWe deliver science, technology and engineering solutions to governments and companies around the world. KBR employs approximately 37,000 people worldwide with customers in more than 80 countries and operations in over 29 countries. KBR is proud to work with its customers across the globe to provide technology, value-added services, and long-term operations and maintenance services to ensure consistent delivery with predictable results. At KBR, We Deliver.\n\nVisit www.kbr.com.\n\n## Forward Looking Statements\nThe statements in this press release that are not historical statements, including statements regarding KBR’s PureM technology capabilities and related services, are forward-looking statements within the meaning of the federal securities laws. These statements are subject to numerous risks, uncertainties and assumptions, many of which are beyond the company’s control, that could cause actual results to differ materially from the results expressed or implied by the statements. These risks, uncertainties and assumptions include, but are not limited to, those set forth in the company’s most recently filed Annual Report on Form 10-K, any subsequent Form 10-Qs and 8-Ks and other U.S. Securities and Exchange Commission filings, which discuss some of the important risks, uncertainties and assumptions that the company has identified that may affect its business, results of operations and financial condition. Due to such risks, uncertainties and assumptions, you are cautioned not to place undue reliance on such forward-looking statements, which speak only as of the date hereof. Except as required by law, the company undertakes no obligation to revise or update publicly any forward-looking statements for any reason.\n\n**For further information, please contact:**\n\n**Investors**\nJamie DuBray\nVice President, Investor Relations\n713-753-5082\nInvestors@kbr.com\n\n**Media**\nPhilip Ivy\nVice President, Global Communications and Marketing \n713-753-3800\nMediaRelations@kbr.com\n\nSource: Kellogg Brown & Root LLC."
      },
      {
        "title": "KBR Awarded Green Ammonia Project by IGNIS in Spain",
        "publishOn": "2025-12-15T06:00:00.000-05:00",
        "content": "# KBR Awarded Green Ammonia Project by IGNIS in Spain\n\n**HOUSTON, Dec. 15, 2025 (GLOBE NEWSWIRE)** -- KBR (NYSE: KBR) announced today that it has been awarded a technology and engineering contract by IGNIS for a new green ammonia facility in A Coruña, Spain.\n\nUnder the terms of the contract, KBR will provide proprietary engineering design and pre-FEED engineering services to IGNIS for a 200,000 tons per annum green ammonia plant. The facility will use renewable energy to produce green hydrogen, which will be converted to green ammonia. Green ammonia, a key element for producing renewable fertilizers, can be used as a highly efficient storage and transport medium for renewable energy and as a clean fuel.\n\n“We are proud to support IGNIS in harnessing Spain’s exceptional renewable energy resources to produce green ammonia for domestic and European markets,” said **Jay Ibrahim**, President, KBR Sustainable Technology Solutions. “KBR’s green ammonia solutions, along with complementary technologies such as H2ACT® ammonia cracking, make us a global leader in delivering reliable and energy-efficient ammonia technology at a lower capital cost.”\n\nKBR has been at the forefront of innovation in the ammonia market for decades. Since 1943, KBR has licensed, engineered, or constructed more than 260 grassroot ammonia plants worldwide.\n\n## About KBR\nWe deliver science, technology and engineering solutions to governments and companies around the world. KBR employs approximately 37,000 people worldwide with customers in more than 80 countries and operations in over 29 countries. KBR is proud to work with its customers across the globe to provide technology, value-added services, and long-term operations and maintenance services to ensure consistent delivery with predictable results. At KBR, We Deliver.\n\nVisit [www.kbr.com](http://www.kbr.com)\n\n## About IGNIS\nIGNIS is a global energy company integrated across renewable generation and innovative energy solutions, with more than 30 GW under development in Europe, the US, Latin America, and Asia. Founded in 2015, it provides tailored energy solutions for companies and consumers in more than 10 countries.\n\nIts IGNIS P2X division develops green hydrogen and derivative products—such as ammonia, synthetic methanol, and sustainable fuels—by leveraging its renewable generation portfolio, thereby contributing to the decarbonization of key sectors, including heavy industry and maritime and aviation transport. Committed to fostering new industrial opportunities, the company is advancing strategic projects in port areas and inland industrial hubs to produce these high-value energy carriers.\n\n## Forward Looking Statements\nThe statements in this press release that are not historical statements, including statements regarding KBR’s delivery of green ammonia technology and services, are forward-looking statements within the meaning of the federal securities laws. These statements are subject to numerous risks, uncertainties and assumptions, many of which are beyond the company’s control, that could cause actual results to differ materially from the results expressed or implied by the statements. These risks, uncertainties and assumptions include, but are not limited to, those set forth in the company’s most recently filed Annual Report on Form 10-K, any subsequent Form 10-Qs and 8-Ks and other U.S. Securities and Exchange Commission filings, which discuss some of the important risks, uncertainties and assumptions that the company has identified that may affect its business, results of operations and financial condition. Due to such risks, uncertainties and assumptions, you are cautioned not to place undue reliance on such forward-looking statements, which speak only as of the date hereof. Except as required by law, the company undertakes no obligation to revise or update publicly any forward-looking statements for any reason.\n\n## For further information, please contact:\n\n**Investors**\nJamie DuBray\nVice President, Investor Relations\n713-753-5082\nInvestors@kbr.com\n\n**Media**\nPhilip Ivy\nVice President, Global Communications and Marketing\n713-753-3800\nMediaRelations@kbr.com\n\nSource: Kellogg Brown & Root LLC."
      }
    ]
  }
}