{
  "data": {
    "attributes": {
      "publishOn": "2025-08-04T22:54:06-04:00",
      "isLockedPro": false,
      "commentCount": 7,
      "videoPreviewUrl": null,
      "videoDuration": null,
      "themes": {
        "m-n-a": {
          "id": 532656,
          "non_theme": true
        },
        "inbound-seo-optimization": {
          "id": 608068
        },
        "investing-ideas": {
          "id": 10727
        },
        "more-tags": {
          "id": 698258
        },
        "us": {
          "id": 326,
          "non_theme": true
        },
        "industrials": {
          "id": 20
        }
      },
      "title": "KBR: Spin To Win",
      "summary": [
        "KBR's Sustainable Technology Solutions is a hidden gem that boasts industry-leading positions in ammonia and hydrogen tech, strong growth, and superior margins, making it undervalued within the current KBR structure.",
        "A spin-off could unlock significant shareholder value, as STS's differentiated growth and profitability are masked by KBR's traditional government services business.",
        "Potential spin-off upside could see $74 share price off FY25 guidance targets and $99 share price off FY27 guidance targets."
      ],
      "isPaywalled": false,
      "structuredInsights": null,
      "lastModified": "2025-08-04T22:59:15-04:00",
      "isModerated": false,
      "availableTranslations": [],
      "closestTradingDate": "2025-08-05",
      "beforeOpeningHours": false,
      "isEarningsSlides": false,
      "isExclusive": true,
      "isTranscript": false,
      "excludedByTag": false,
      "transcriptPath": null,
      "likesCount": 1,
      "disabledMessage": null,
      "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b><span>I/we have a beneficial long position in the shares of KBR, AMTM either through stock ownership, options, or other derivatives.</span><span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>",
      "articleActionableItem": null,
      "inEmbargo": false,
      "isNoindex": false,
      "isNoarchive": true,
      "content": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2190620201/image_2190620201.jpg?io=getty-c-w750\" alt=\"KBR headquarters in Houston, Texas, USA.\" data-id=\"2190620201\" data-type=\"getty-image\" width=\"1536px\" height=\"1024px\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2190620201/image_2190620201.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2190620201/image_2190620201.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2190620201/image_2190620201.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2190620201/image_2190620201.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2190620201/image_2190620201.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2190620201/image_2190620201.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2190620201/image_2190620201.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2190620201/image_2190620201.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 768px) calc(100vw - 36px), (max-width: 1024px) calc(100vw - 132px), (max-width: 1200px) calc(66.6vw - 72px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">JHVEPhoto</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>KBR (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/KBR\" title=\"KBR, Inc.\">KBR</a></span>) comprises two businesses: Mission Technologies Solutions (MTS, aka BadCo) and Sustainable Technology Solutions (STS, aka GoodCo).</p> <p>I am proposing a Strong Buy argument for KBR for two reasons:</p> <ul> <li>It is my belief that there is significant<span class=\"paywall-full-content\"> value to be unlocked in the event of a spin-off of GoodCo.</span> </li> <li class=\"paywall-full-content\">Even without a spin-off, KBR's STS business is underappreciated by the market, and the consolidated company should be valued higher closer to peers.</li> </ul> <p class=\"paywall-full-content\">MTS generates the majority of KBR revenue at 72% with STS generating the balance, with EBITDA split being 55% for MTS and 45% for STS. The latter fact is the central driver for the theme of this investment case: BadCo is growing mid-to-high single digits and GoodCo is growing at low double-digit clips, but GoodCo has north of 20% EBITDA margins with MTS hovering at 10% margins. In my opinion, there is value to unlock with spinning out the STS business, which is being held back by the valuation of the more traditional BadCo. In fact, KBR as a whole is valued less than its pure-play peers in government services.</p> <p class=\"paywall-full-content\">To be clear - KBR management and board have not announced a spin-off. The idea of such strategic alternatives is something that has been mulled over by the investor community; this article is simply an exercise in determining if there is a good rate of success buying into KBR regardless of scenario (spin-off or no spin-off).</p> <h2 class=\"paywall-full-content\">Overview</h2> <p class=\"paywall-full-content\">MTS is your typical government and defense services contractor business whose comparables span parts or all of: Leidos (<a href=\"https://seekingalpha.com/symbol/LDOS\" title=\"Leidos Holdings, Inc.\">LDOS</a>), Booz Allen Hamilton (<a href=\"https://seekingalpha.com/symbol/BAH\" title=\"Booz Allen Hamilton Holding Corporation\">BAH</a>), SAIC (<a href=\"https://seekingalpha.com/symbol/SAIC\" title=\"Science Applications International Corporation\">SAIC</a>), CACI (<a href=\"https://seekingalpha.com/symbol/CACI\" title=\"CACI International Inc\">CACI</a>), Amentum (<a href=\"https://seekingalpha.com/symbol/AMTM\" title=\"Amentum Holdings, Inc.\">AMTM</a>). MTS focuses primarily on logistics, asset management, electronic warfare, directed energy, model-based system engineering, IT, and space operations. Some of these areas are no-growth and undifferentiated (logistics, IT, and asset management), while the rest are strong areas to be in. However, if one wanted to own a government services contractor for these types of businesses, there are better options with stronger contract bases, backlogs, and differentiated services with BAH, LDOS, and AMTM.</p> <p class=\"paywall-full-content\">STS, on the other hand, is to ammonia and hydrogen generation what Amentum's GES business is to nuclear energy. KBR's STS has strong growth in the areas of ammonia production and carbon capture, its leadership is clearly demonstrated by owning 50% of the global market share in ammonia production facilities through IP licensing. Growth in the total addressable market has led to double-digit rates for the market leader for this area of the energy ecosystem, highlighting the strength of the business. Throw in leadership in hydrogen generation technology that couples with its ammonia ecosystem, liquid natural gas engineering and construction that has been resurgent due to the Ukraine-Russian war and election of the current U.S. administration, as well as significant investments in plastics recycling, and there are many differentiated, high-growth areas of the sustainable energy economy that makes STS an attractive business to own. Comparables include half of AMTM, Jacobs' Solutions (<a href=\"https://seekingalpha.com/symbol/J\" title=\"Jacobs Solutions Inc.\">J</a>), Aecom (<a href=\"https://seekingalpha.com/symbol/ACM\" title=\"AECOM\">ACM</a>), Tetra Tech (<a href=\"https://seekingalpha.com/symbol/TTEK\" title=\"Tetra Tech, Inc.\">TTEK</a>), and Quanta Services (<a href=\"https://seekingalpha.com/symbol/PWR\" title=\"Quanta Services, Inc.\">PWR</a>).</p> <h2 class=\"paywall-full-content\">Arguments in Favor of a Spin-off of STS Business</h2> <h3 class=\"paywall-full-content\">Point #1: BadCo and GoodCo Are Completely Different Businesses</h3> <p class=\"paywall-full-content\">BadCo and GoodCo have zero synergy. Management completed an enterprise realignment in Q1 FY25 to make each segment self-sufficient and realize \"segment-level synergies.\" This re-segmentation didn't lead to much cost-savings, with $30 million being cited by management, through which only a fraction drops to the bottom-line. The synergy in the re-segmentation of the two business units was more to make each business unit self-sufficient and agile.</p> <blockquote class=\"paywall-full-content\"> <p> </p> <p>Today we did talk about making the segments more self-sufficient...</p> <p>...But what we've tried to do through the structural realignment was to make sure that we're realizing the synergy inside the segments themselves to the maximum possible extent and drive efficiency and less complexity as a consequence.</p> <p>- Stuart Bradie, KBR CEO. <a href=\"https://investors.kbr.com/news-and-events/events-and-presentations/event-details/2025/KBR-Announces-Executive-Appointments--Segment-Realignment/default.aspx\" rel=\"nofollow noopener noopener\">Segment Realignment Investor Call</a>.</p> </blockquote> <h3 class=\"paywall-full-content\">Point #2: Business Repositioning</h3> <p class=\"paywall-full-content\">Management was pressed several times by the investor community about break-up value consideration and strategic alternatives. Investors and analysts were particularly vocal after the <a href=\"https://investors.kbr.com/news-and-events/events-and-presentations/event-details/2025/KBR-Announces-Executive-Appointments--Segment-Realignment/default.aspx\" rel=\"nofollow noopener noopener\">Segment Realignment Investor Call</a>, where the restructuring involved a bolstering of the STS business unit to strengthen its scale as a stand-alone vertical by restructuring the international infrastructure business supporting Asia and Middle East, which generated $300M in revenue in 2024, into STS to bring STS to $2.2B in revenue and $4B in backlog. Recently, a new contract for KBR with Indonesia for engineering modular refineries for $8 billion is rumored to happen as part of a <a href=\"https://seekingalpha.com/news/4469698-indonesia-plans-8-billion-refinery-contract-with-us-firm-kbr-after-tariff-cut-to-19---report\">new U.S. trade deal with Indonesia</a> - which would further demonstrate the ability for STS to capture business at scale. See below exhibits (emphasis mine):</p> <blockquote class=\"paywall-full-content\"> <p> </p> <p>Usually when we hear greater strategic flexibility, we think a higher probability of significant portfolio management, including, in your case, more M&amp;A, a larger breakup, sale of STS.</p> <p>- Analyst Andrew Kaplowitz</p> <p>I'd like to say, initially, we repositioned the business and this restructuring is really the right thing to do going into 2025 and we really want to bed that down. This is sort of Phase 1 of that process and we really want to see that play out. I do think we've got some uncertainty with a new administration coming in. We've got a fantastic business model that's highly, highly resilient. But we do want to see where the market goes in terms of budget allocations and administration priorities....</p> <p>... But we feel the path we're on today is the right path and we do think that will maximize shareholder value over the longer term right now....</p> <p>... I think there are many considerations around looking at values of a breakup opportunity. They include healthy end markets. <strong>I think scale is a big factor and how the business is and the additional cost and distraction that would actually happen as a consequence of any strategic actions like that</strong>....</p> <p>- Stuart Bradie, KBR CEO. <a href=\"https://investors.kbr.com/news-and-events/events-and-presentations/event-details/2025/KBR-Announces-Executive-Appointments--Segment-Realignment/default.aspx\" rel=\"nofollow noopener noopener\">Segment Realignment Investor Call</a>.</p> </blockquote> <p class=\"paywall-full-content\">A new addition to management's investor pitch that caught my eye as part of the recent <a href=\"https://seekingalpha.com/article/4806856-kbr-inc-2025-q2-results-earnings-call-presentation\">Q2 FY25 earnings call</a> is signaling strategic optionality as a shareholder returns strategy (see slide below). This messaging was absent in prior earnings presentations.</p> <p class=\"paywall-full-content\"><figure class=\"regular-img-figure paywall-full-content\" contenteditable=\"false\"><span><a href=\"https://static.seekingalpha.com/uploads/2025/7/31/51325246-17539764522789955_origin.png\" rel=\"lightbox\" data-width=\"1137\" data-height=\"629\" data-og-image-twitter_small_card=\"true\" data-og-image-twitter_large_card=\"true\" data-og-image-twitter_image_post=\"true\" data-og-image-msn=\"true\" data-og-image-facebook=\"true\" data-og-image-google_news=\"true\" data-og-image-google_plus=\"true\" data-og-image-linkedin=\"true\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2025/7/31/51325246-17539764522789955_origin.png?io=w640\" alt=\"Strategic Optionality mention\" contenteditable=\"false\" loading=\"lazy\" width=\"1137\" height=\"629\" srcset=\"https://static.seekingalpha.com/uploads/2025/7/31/51325246-17539764522789955_origin.png?io=w1080 1080w,https://static.seekingalpha.com/uploads/2025/7/31/51325246-17539764522789955_origin.png?io=w750 750w,https://static.seekingalpha.com/uploads/2025/7/31/51325246-17539764522789955_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2025/7/31/51325246-17539764522789955_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2025/7/31/51325246-17539764522789955_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2025/7/31/51325246-17539764522789955_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span><figcaption><p class=\"item-caption\">Strategic Optionality mention <span>(Q2 Investor Presentation)</span></p></figcaption></figure></p> <h3 class=\"paywall-full-content\">Point #3: Business Underappreciation</h3> <p class=\"paywall-full-content\">Stuart Bradie came into KBR's CEO position in 2015 and has since completed significant amounts of portfolio restructuring and exiting legacy engineering and construction to realign into higher value business areas in electronic warfare, space, recycling, LNG, and hydrogen energy technologies. For several years, he has tried to address investor underappreciation over STS as not just a viable, but quality, business (emphasis mine):</p> <p class=\"paywall-full-content\">Exhibit A: <a href=\"https://seekingalpha.com/article/4528658-kbr-inc-kbr-ceo-stuart-bradie-on-q2-2022-results-earnings-call-transcript\">Post Plaquemines, Louisiana LNG Contract Win (August 2022)</a></p> <blockquote class=\"paywall-full-content\"> <p> </p> <p>Yes. I mean, we -- I mean, I think our guide on our growth and EBITDA over time for STS is 20% plus. And our margin expansion has room in it to go above the high teens into the low 20s. And I think both of these consider that. So I think we need to get a bit more time under our belt, Sean, to come back and answer that fully.</p> <p>But I think if you look at any business with underlying EPS growth that we've laid out, if there's any skepticism around that, <strong>hopefully, some of that skepticism disappears with the announcements today</strong>. And also, the skepticism of margin expansion, et cetera, also, hopefully, some of that skepticism disappears today also. So we'll come back over time, but that's probably the best way to answer it today.</p> <p>- Stuart Bradie, KBR CEO.</p> </blockquote> <p class=\"paywall-full-content\">As prophesied, STS CAGR has been 22.3% since that call and EBITDA margins in the low 20s. Yet, the stock price is lower today than it was at the time of that call.</p> <p class=\"paywall-full-content\">Exhibit B: <a href=\"https://seekingalpha.com/article/4646631-kbr-inc-kbr-q3-2023-earnings-call-transcript\">Post Ammonia Cracking Hydrogen Generation Win (November 2023)</a></p> <blockquote class=\"paywall-full-content\"> <p> </p> <p>Yes. I mean I don't know if we're going to get out over STS on a '25 target today, Bert. But what I would say is that we are well ahead of pace. You're quite right. We had a $300 million target. <strong>We're going to blow through that this year.</strong> We raised EBITDA guide last quarter, and we're ahead of pace of that, are on pace for that. And I think everyone recognizes particularly with the Q3 results, <strong>that's all pointing to STS</strong>.</p> <p>And I think if you look at the relative performance of STS to KBR, I think year-to-date, it's circa 40% in the quarter, it's even higher. And so its contribution and its value to KBR is becoming clearer and clearer. <strong>And hopefully, that reflects in the multiple as well as we go forward in terms of that contribution</strong>. But, as we look into next year, we'll be the double-digit growth that we set ourselves will be coming off a much higher base. And clearly, that outpaces where we originally thought. And even a few months ago, thought we would be starting from. So I think that's probably the best way to look at it.</p> <p>- Stuart Bradie, KBR CEO.</p> </blockquote> <p class=\"paywall-full-content\">Exhibit C: <a href=\"https://investors.kbr.com/news-and-events/events-and-presentations/event-details/2025/KBR-Announces-Executive-Appointments--Segment-Realignment/default.aspx\" rel=\"nofollow\">Post Re-Segmentation (January 2025)</a></p> <blockquote class=\"paywall-full-content\"> <p> </p> <p>And we're a very sort of -- not just from an STS comp perspective, you're quite right, there is <strong>no pure comp in the market, so it makes it very, very difficult to just point to someone and say that's where you should trade</strong>. There's no one in the market like a Sustainable Tech stand-alone business. If you wanted a comp there, it's difficult.</p> <p>- Stuart Bradie, KBR CEO.</p> </blockquote> <p class=\"paywall-full-content\">KBR has not been given multiples awarded to its peer group - as I'll show later, I believe this is undue. There has clearly been some difficulty messaging the value of the combined company. It is my belief that a spin-off would simplify the business and the following price discovery would be in favor of KBR investors, per the next point.</p> <h3 class=\"paywall-full-content\">Point #4: Investor Sentiment</h3> <p class=\"paywall-full-content\">There are a few case studies in recent years that indicate an STS spin-off would be appreciated and unlock value. I'll start by mentioning other investors have noted the value of an STS spin-off: Irenic Capital Management, headed by a former Elliott Management manager, <a href=\"https://seekingalpha.com/news/4388055-kbr-gains-on-report-activist-irenic-capital-takes-stake-pushing-for-separation\">acquired a 1% stake in KBR in Q4 2024</a> citing specifically the value of STS and a desire to have the board spin the business off. As far as I could research, there was no animosity to this request, reinforced by points above; though, Irenic Capital has since sold out, which could have been for a variety of reasons. That said, here are some spin-offs that would point to positive investor sentiment:</p> <ul class=\"paywall-full-content\"> <li>General Electric (<a href=\"https://seekingalpha.com/symbol/GE\" title=\"General Electric Company\">GE</a>): GE into GE Vernova (<a href=\"https://seekingalpha.com/symbol/GEV\" title=\"GE Vernova Inc.\">GEV</a>) (up ~400%) and GE Aviation (<a href=\"https://seekingalpha.com/symbol/GE\" title=\"General Electric Company\">GE</a>) (up ~60%), indicating positive sentiment for pure-play energy technology companies and penalties given to archaic industrial conglomerates.</li> <li>Jacob's Solutions (<a href=\"https://seekingalpha.com/symbol/J\" title=\"Jacobs Solutions Inc.\">J</a>): J (up 20%) spin-off of Amentum (<a href=\"https://seekingalpha.com/symbol/AMTM\" title=\"Amentum Holdings, Inc.\">AMTM</a>) (up ~30% prior to DOGE fears). KBR has an even stronger moat in energy technology than AMTM in the nuclear industry with higher growth, so I would consider a 30% appreciation rather tame in the case of a KBR-STS spin.</li> <li>Danaher (<a href=\"https://seekingalpha.com/symbol/DHR\" title=\"Danaher Corporation\">DHR</a>): DHR (~flat) spin-off of Veralto (<a href=\"https://seekingalpha.com/symbol/VLTO\" title=\"Veralto Corporation\">VLTO</a>) (up ~30%). Its water treatment business could be viewed in the same camp as STS's moon-shot plastics recycling business (via Mura Technology, a potential multi-bagger investment where KBR owns 20% that lives with STS).</li> <li>Flex Ltd (<a href=\"https://seekingalpha.com/symbol/FLEX\" title=\"Flex Ltd.\">FLEX</a>): Flex (up ~100%) spin-off of Nextracker (<a href=\"https://seekingalpha.com/symbol/NXT\" title=\"Nextpower Inc.\">NXT</a>) (up ~100%). Nextracker's solar energy support solutions are comparable to STS in liquid natural gas, hydrogen, and biofuels.</li> </ul> <h3 class=\"paywall-full-content\">Point #5: STS Can Command a High Multiple</h3> <p class=\"paywall-full-content\">Advanced and alternative energy solutions are typically rewarded high multiples by the market. Linde (<a href=\"https://seekingalpha.com/symbol/LIN\" title=\"Linde plc\">LIN</a>) is a leader in hydrogen production and carbon capture, with an 18x EV/EBITDA multiple. However, KBR's STS ammonia cracking technology has been commercialized for years - lying dormant until market demand arose - and is now deploying the technology to retrofit existing refineries to take full advantage of carbon neutral regulations and increasing hydrogen fuel production demand from Asia and the Middle East. KBR has a head start on Linde, <a href=\"https://www.mdpi.com/2673-3994/3/3/26\" rel=\"noopener\">who is pursuing a more efficient solution</a> (KBR cites 85-90% efficiency for their technology), so a spin-off could take advantage of the lead and significant market share KBR has in terms of capturing value.</p> <p class=\"paywall-full-content\">\"Blue hydrogen,\" produced from carbon capture and cracking ammonia into hydrogen is an upstream part of the energy value chain with much less risk than downstream hydrogen fuel applications (e.g., vehicles, aviation, etc.). KBR-STS licenses its technology, provides maintenance support, and engineering and consulting services surrounding design, plant retrofits, and construction. In other words: low risk and low capex with high return on equity for a business with a technological moat. KBR does not take on the risk of building and maintaining the fixed cost of ammonia-fitted plants, insulating them from cycle shocks. Tack on double-digit top-line growth, and such characteristics command high multiples by the market.</p> <h2 class=\"paywall-full-content\">Valuation</h2> <h3 class=\"paywall-full-content\">Without Spin-Off</h3> <p class=\"paywall-full-content\">This is certainly the easier (and less interesting) of the two situations. Management provided the following guidance for both Revised 2025 and 2027 targets:</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table class=\"table-striped\"> <tr> <td><strong>Metric</strong></td> <td><strong>Revised FY25G*</strong></td> <td><strong>Revised FY27G*</strong></td> </tr> <tr> <td><strong>Revenues</strong></td> <td>$7.9B - $8.1B</td> <td>$9.0B+</td> </tr> <tr> <td><strong>Adj. EBITDA</strong></td> <td>$960M - $980M</td> <td>$1.15B+</td> </tr> <tr> <td><strong>Adj. EBITDA Margin</strong></td> <td>-</td> <td>11+%</td> </tr> <tr> <td><strong>Adj. EPS</strong></td> <td>$3.78 - $3.88</td> <td>-</td> </tr> <tr> <td><strong>Operating Cash Flow</strong></td> <td>$500M - $550M</td> <td>$650M+</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\">* <a href=\"https://seekingalpha.com/article/4806856-kbr-inc-2025-q2-results-earnings-call-presentation\">Q2 Investor Presentation</a></p> <p class=\"paywall-full-content\">KBR is a capital-light company with notably less than 1% of revenues going to capex, so OCF guidance should be close to FCF, less ~$30M - $50M. GoodCo is expected to grow 10 - 15% CAGR and BadCo 5 - 8%, with margins for GoodCo are twice that of BadCo, so target margins are similar to 2024 levels as a result due to the margin dilution of BadCo.</p> <p class=\"paywall-full-content\">Guidance does not include effects of share repurchases, which in 2024 amounted to $300M (~2% of shares outstanding) and upsized to $750M as of Q1 2025. KBR has a history of share repurchases and the upsize in their authorization indicates management's view of the current share price.</p> <p class=\"paywall-full-content\">Below are some comparables I consider when evaluating KBR. AMTM is the closest like-for-like peer given their similar segment profiles (defense and intelligence, and energy); SAIC is a pure-play of KBR's MTS business segment. Despite KBR's STS gem growing at double digits with 20%+ margins and even KBR's MTS business growing at 5-8% sales, it holds the lowest EV/EBITDA multiple with the lowest leverage ratio of the peer group, even lower than SAIC which has much lower growth expectations (low single digits) and lower profitability.</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table class=\"table-striped\"> <tr> <th><strong>Company</strong></th> <th><strong>EV/EBITDA (NTM)</strong></th> <th><strong>EV/Sales (NTM)</strong></th> <th><strong> Net Debt/EBITDA (LTM)</strong></th> <th><strong> EBITDA Margin (LTM)</strong></th> </tr> <tr> <th><strong>KBR</strong></th> <td>8.96x</td> <td>1.01x</td> <td>2.4x</td> <td>11.24%</td> </tr> <tr> <th><strong>AMTM</strong></th> <td>9.57x</td> <td>0.74x</td> <td>4.0x</td> <td>7.6%</td> </tr> <tr> <th><strong>BAH</strong></th> <td>12.66x</td> <td>1.40x</td> <td>2.5x</td> <td>11%</td> </tr> <tr> <th><strong>LDOS</strong></th> <td>11.65x</td> <td>1.50x</td> <td>1.9x</td> <td>12%</td> </tr> <tr> <th><strong>SAIC</strong></th> <td>10.46x</td> <td>1.0x</td> <td>3.0x</td> <td>9.5%</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\"><span>Management stated a desire to reach &lt;2.5x leverage by FY25 through EBITDA growth, leaving the free cash flow open to share repurchases net dividend payout (~7%), which it hit with Q2 FY25; I presume a 2% reduction in share count in FY25, though management could certainly be more aggressive given cash on hand and FCF of ~$450 - $500M in FY25. Only $550M of debt maturities are due in FY27, so there is a lot of financial flexibility for management.</span></p> <h4 class=\"paywall-full-content\"> </h4> <p class=\"paywall-full-content\">Assigning a multiple of 10-11x to the lowest end of the FY25 guide, which gives STS zero premium despite being a superior business among the cohort: EV = $9.6B - $10.6B, less net debt of $2.4B = $7.2B - $8.2B market cap. With 127M shares outstanding (after 2% repurchases): $57 - $65 share price target within 12 months. Expectations for FY27 are not demanding, with share price likely to be driven by accelerated share repurchases with free cash flow on reaffirmed FY27 EBITDA guide of $1.15B (despite HomeSafe contract loss): $74 - $83 on 123 million shares outstanding.</p> <h3 class=\"paywall-full-content\">HomeSafe Contract Aside</h3> <h4 class=\"paywall-full-content\"> </h4> <p class=\"paywall-full-content\">The aforementioned guidance was shared with investors before the <a href=\"https://seekingalpha.com/news/4460006-kbr-reports-transcom-terminates-homesafes-role-in-global-household-goods-contract\">termination of the HomeSafe Alliance Global Household Goods contract by the DOD Transportation Command in June 2025</a>. This was a $20B contract over 9 years. Following the contract termination, the KBR COO who had primarily overseen MTS resigned and has not been replaced, with CEO Stuart Bradie taking over direct oversight. The impact of this contract loss, in my view, will be minimal. For one, the HomeSafe contract was fraught from the start, with an outstanding underbid that led to a majority of moving companies and unions not participating in work under the contract due to low wages, leading to a growing backlog by military families requesting moves that could not be fulfilled (or fulfilled poorly). As a result, the contract's value had never really contributed to the share price of KBR as investor sentiment at earnings calls were skeptical. KBR share price fell 10% after the contract termination announcement, a rather tame response given the size of the contract.</p> <p class=\"paywall-full-content\">In any case, no EBITDA was expected to be generated by the HomeSafe contract in 2025, so that guidance has been reaffirmed by management. I originally modeled for FY27 EBITDA to be guided down to $1B from $1.15B, but <a href=\"https://seekingalpha.com/article/4806856-kbr-inc-2025-q2-results-earnings-call-presentation\">Q2 FY25 guidance reaffirmed the original $1.15B EBITDA guide</a>, despite a material drop in revenue. I was expecting HomeSafe to amount to some profits by FY27, but in reality, the HomeSafe contract would have amounted to thin margins, as it amounted to being a freight and logistics broker. The current quarter earnings include some discontinued operations losses owing to the HomeSafe contract termination; in the end, I think the loss of the contract is ultimately a good thing given that it was a significant distraction with low-quality earnings. This is reinforced by the fact that KBR expects MTS margins to increase in concert with the revenue loss.</p> <p class=\"paywall-full-content\">I prefer management focus their efforts and attention on their higher quality businesses and contract executions anyway; for example, STS margins increased from 20% to 23% in the quarter - time to put HomeSafe behind KBR and move on.</p> <h3 class=\"paywall-full-content\">With Spin-Off</h3> <p class=\"paywall-full-content\">This is the harder situation to assess, primarily because of lack of pure-play comparables, especially in the biofuel, carbon capture, LNG, and hydrogen sectors that KBR leads in.</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table class=\"table-striped\"> <thead><tr> <th><strong>Company</strong></th> <th><strong>FY24-FY27 Revenue Growth*</strong></th> <th>EBITDA (NTM)</th> <th>EV/EBITDA (NTM)</th> <th>EBITDA Margin (LTM)</th> </tr></thead> <tr> <th><strong>KBR-STS</strong></th> <td>11 - 15%</td> <td>$450M - $500M**</td> <td>?</td> <td>20%</td> </tr> <tr> <th><strong>PWR</strong></th> <td>11.2%</td> <td>$2743M</td> <td>23.82x</td> <td>10.3%</td> </tr> <tr> <th><strong>J</strong></th> <td>5.2%</td> <td>$1214M</td> <td>15.41x</td> <td>10.4%</td> </tr> <tr> <th><strong>ACM</strong></th> <td>3.7%</td> <td>$1190M</td> <td>13.87x</td> <td>7.4%</td> </tr> <tr> <th>TTEK</th> <td>2.6%</td> <td>$644M</td> <td>17.64x</td> <td>14.56%</td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\">* Estimates from guidance (<a href=\"https://seekingalpha.com/symbol/KBR\" title=\"KBR, Inc.\">KBR</a>) and consensus (PWR, J, ACM, TTEK)</p> <p class=\"paywall-full-content\">** Estimate from $2.2B FY24 sales, 10% growth, and 20% margin.</p> <p class=\"paywall-full-content\">KBR-STS would have the lowest scale out of the cohort, made up for by higher anticipated top-line growth along with notable higher margins. Given KBR-STS has leading market shares in attractive energy areas, strong business relationships with high-growth parts of the world (e.g., Middle East and Southeast Asia), and meaningful asset-light IP licensing business within this segment, I would be surprised if KBR-STS were to be given a multiple less than 14x, perhaps 14-16x given its lower scale - either way leading to a significant premium over the consolidated KBR business.</p> <p class=\"paywall-full-content\">Below is a sum-of-parts assessment, with the low case meaningfully below guidance and the base and high case reflecting midpoint and highpoint of FY25 guidance. Note that corporate overhead is low given that KBR completed its re-segmentation to have each business be stand-alone, so the segment margins should be expected to reflect the vast majority of spin-off margins.</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <tr> <th class=\"bg-g\"><strong>MTS</strong></th> <th class=\"bg-g\"><strong>Low</strong></th> <th class=\"bg-g\"><strong>Base</strong></th> <th class=\"bg-g\"><strong>High</strong></th> </tr> <tr> <td>2025 EBITDA</td> <td>$550</td> <td>$550</td> <td>$550</td> </tr> <tr> <td>EV/EBITDA</td> <td>10</td> <td>10</td> <td>10</td> </tr> <tr> <td>Enterprise Value</td> <td>$5.5B</td> <td>$5.5B</td> <td>$5.5B</td> </tr> <tr> <td class=\"bg-g\"><strong>STS</strong></td> <td class=\"bg-g\"> </td> <td class=\"bg-g\"> </td> <td class=\"bg-g\"> </td> </tr> <tr> <td>2025 EBITDA</td> <td>$400M</td> <td>$450M</td> <td>$500M</td> </tr> <tr> <td>EV/EBITDA</td> <td>14</td> <td>15</td> <td>16</td> </tr> <tr> <td>Enterprise Value</td> <td>$5.6B</td> <td>$6.8B</td> <td>$8B</td> </tr> <tr> <td class=\"bg-g\"><strong>Corporate</strong></td> <td class=\"bg-g\"> </td> <td class=\"bg-g\"> </td> <td class=\"bg-g\"> </td> </tr> <tr> <td>2025 EBITDA</td> <td>($50M)</td> <td>($50M)</td> <td>($50M)</td> </tr> <tr> <td>EV/EBITDA</td> <td>12</td> <td>12.5</td> <td>13</td> </tr> <tr> <td><strong>Net Debt</strong></td> <td>$2.4B</td> <td>$2.4B</td> <td>$2.4B</td> </tr> <tr> <td><strong>Shares Outstanding</strong></td> <td>129M</td> <td>127M</td> <td>127M</td> </tr> <tr> <td><strong>Equity Value</strong></td> <td class=\"bg-y\"><strong>$64</strong></td> <td class=\"bg-y\"><strong>$73</strong></td> <td class=\"bg-y\"><strong>$82</strong></td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content\">From these estimates, the base case of a GoodCo spin-off would be a 20% premium over the consolidated scenario (and 60% appreciation from current prices of $46), not accounting for the increased focus and investment that spin-offs typically garner that could lead to improving margins or increased growth.</p> <p class=\"paywall-full-content\">As with all government and engineering services firms, revenue visibility is high. In the case of KBR, STS has a 3-year weighted average lifespan on its major contracts, with $4B in backlog at end of FY24. This doesn't include recent Q2 contract news with <a href=\"https://www.reuters.com/business/energy/indonesia-plans-8-billion-refineries-contract-with-us-firm-amid-tariffs-deal-2025-07-22/\" rel=\"noopener\">Indonesia (refineries, TBD anticipated contract)</a>, <a href=\"https://www.kbr.com/en/insights-news/press-release/kbr-awarded-feed-contract-keppts-fertilizer-facility-iraq\" rel=\"nofollow\">Iraq (ammonia, more recurring IP licensing revenue)</a>, and <a href=\"https://www.kbr.com/en/insights-news/press-release/kbr-joint-venture-selected-bp-two-energy-security-projects-azerbaijan#:~:text=HOUSTON%2C%20July%2015%2C%202025%20%E2%80%93,another%20for%20the%20Shah%20Deniz\" rel=\"nofollow\">BP energy partnership in Azerbaijan</a>. This gives us more confidence into the revenue targets FY25-FY27.</p> <p class=\"paywall-full-content\">Extrapolating to FY27 with 11% top-line CAGR and 20% margins gives an STS enterprise value of $8.8B, and with 5% top-line CAGR and 10% margins gives an MTS enterprise value of $6.8B, leading to my base case estimate FY27 of $99.</p> <div class=\"table-responsive paywall-full-content\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <colgroup> <col> <col> <col> <col> <col> </colgroup> <tr> <th class=\"bg-g\">($M)</th> <th class=\"bg-g\">FY24</th> <th class=\"bg-g\">FY25E</th> <th class=\"bg-g\">FY26E</th> <th class=\"bg-g\">FY27E</th> </tr> <tr> <th>Revenue</th> <td>$8,000</td> <td>$8,532</td> <td>$9,105</td> <td>$9,723</td> </tr> <tr> <td class=\"bg-g\"><em>MTS</em></td> <td class=\"bg-g\">$5,800</td> <td class=\"bg-g\">$6,090</td> <td class=\"bg-g\">$6,395</td> <td class=\"bg-g\">$6,714</td> </tr> <tr> <td class=\"bg-g\"><em>STS</em></td> <td class=\"bg-g\">$2,200</td> <td class=\"bg-g\">$2,442</td> <td class=\"bg-g\">$2,711</td> <td class=\"bg-g\">$3,009</td> </tr> <tr> <th>EBITDA</th> <td>$1,020</td> <td>$1,097</td> <td>$1,182</td> <td>$1,273</td> </tr> <tr> <td class=\"bg-g\"><em>MTS</em></td> <td class=\"bg-g\">$580</td> <td class=\"bg-g\">$609</td> <td class=\"bg-g\">$639</td> <td class=\"bg-g\">$671</td> </tr> <tr> <td class=\"bg-g\"><em>STS</em></td> <td class=\"bg-g\">$440</td> <td class=\"bg-g\">$488</td> <td class=\"bg-g\">$542</td> <td class=\"bg-g\">$602</td> </tr> <tr> <th>Corporate</th> <td>$50</td> <td>$55</td> <td>$60</td> <td>$65</td> </tr> <tr> <th>Net Debt</th> <td>$2,400</td> <td>$2,400</td> <td>$2,400</td> <td>$2,400</td> </tr> <tr> <th>Shares Outstanding</th> <td>131</td> <td>129</td> <td>128</td> <td>127</td> </tr> <tr> <th>Equity Value</th> <td class=\"bg-y\"><strong>$72</strong></td> <td class=\"bg-y\"><strong>$80</strong></td> <td class=\"bg-y\"><strong>$89</strong></td> <td class=\"bg-y\"><strong>$99</strong></td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <h2 class=\"paywall-full-content\">Risks</h2> <p class=\"paywall-full-content\">The primary risk to the thesis is that a special situation never materializes (or materializes too long in the future). Even though my valuation of KBR in the combined company scenario still points to potentially higher share prices than the current print, it supposes that the market raise the multiple from the current ~9x to ~10-11x to align closer to the peer group cohort. While I argued that such a rerating is warranted, the market won't necessarily agree with me. It could be the case that the market never prescribes such a multiple and continues to keep valuation depressed. Awarding a higher multiple to KBR as a combined company may require properly messaging and demonstrating the value of the high-growth, high-earning STS business, which has been challenging. While KBR-STS has sustained its trajectory for several years, the market may need to see further proof of its sustainability, or perhaps sustainability on a larger scale.</p> <p class=\"paywall-full-content\">In the event that neither my scenario of a rerating of consolidated KBR nor a special situation materializes, we may be looking at a share price that remains flat, at best.</p> <p class=\"paywall-full-content\">Lastly, even if a spin-off were to occur, value could be destroyed. After all, the aforementioned Danaher and Jacobs spin-offs were rather muted. KBR-STS may need to rely more on price discovery - due to lack of comparables - which doesn't necessarily translate into that price discovery resulting in a higher valuation, and KBR has struggled to convince investors of its STS business to date.</p> <h2 class=\"paywall-full-content\">Conclusion</h2> <p class=\"paywall-full-content\">I do not usually pursue sum-of-the-parts investment cases, but KBR presents a situation that in my view presents a \"tails I win; heads I win more\", particularly in this environment where defense and government company M&amp;A activity has been bouncing off the walls. I rate KBR a Strong Buy given its depressed valuation, favorable special situation outcomes, and strength of its Sustainable Technology Solutions business gem.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content\"></div> <p class=\"paywall-full-content\">My 1-year target is: $57 (consolidated) - $73 (separated). Given revenue visibility over the next 24 months, I estimate FY27 of $74 (consolidated) - $99 (separated).</p>",
      "quickInsights": null,
      "twitContent": "KBR: Spin To Win $KBR #business #stockmarket #economy https://seekingalpha.com/article/4808534-kbr-stock-q2-spin-to-win?source=tweet",
      "isReit": false,
      "videoData": null,
      "marketingBulletVariant": null,
      "marketingBio": null,
      "audioDuration": 1615.78,
      "originalTitle": "KBR: Spin To Win"
    },
    "relationships": {
      "author": {
        "data": {}
      },
      "sentiments": {
        "data": [
          {}
        ]
      },
      "primaryTickers": {
        "data": [
          {
            "id": "2787"
          }
        ]
      },
      "secondaryTickers": {
        "data": []
      },
      "otherTags": {
        "data": [
          {},
          {},
          {
            "id": "2787"
          },
          {},
          {},
          {},
          {},
          {},
          {
            "id": "326"
          }
        ]
      },
      "coAuthors": {
        "data": []
      },
      "presentations": {
        "data": []
      },
      "updates": {
        "data": []
      },
      "corrections": {
        "data": []
      }
    },
    "links": {
      "schemaImage": []
    }
  },
  "included": [
    {
      "attributes": {
        "company": null,
        "userId": 51325246,
        "tagId": 613701,
        "bio": "<p>Background: 10+ years as research scientist in the defense, intelligence, and space industries. </p><p>Followed investment teachings: Peter Lynch, Dr. Michael Burry, Li Lu, Philip Fisher</p><p>Investing style: Value investor of future earnings.</p><p>- 60-75% in small-to-mid-cap growth companies</p><p>- 25-40% in road-kill businesses with turnaround or cycle inflection</p><p>U.S. based but with frequent exposure to companies abroad. </p><p>I only write articles on ideas that I believe are actionable (i.e., typically no HOLD ratings), and strive to bring new, edifying material to ideas.</p><p>Always do your own due diligence. Not a financial advisor.</p>",
        "image": {},
        "deactivated": null,
        "memberSince": 2020,
        "isRss": false,
        "contributorSince": 2021,
        "followersCount": 402
      },
      "relationships": {
        "user": {
          "data": {}
        },
        "userBioTags": {
          "data": [
            {},
            {},
            {},
            {}
          ]
        },
        "authorResearch": {
          "data": null
        }
      },
      "links": {
        "site": null,
        "linkedinUrl": null,
        "twitterUrl": null
      }
    },
    {
      "id": "2787",
      "attributes": {
        "fundTypeId": 0,
        "isDefunct": false,
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "id": "326",
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "articleId": 4808534,
        "createdAt": "2025-08-04T22:54:06.000-04:00",
        "typeId": 0
      },
      "relationships": {
        "article": {
          "data": {}
        },
        "tag": {
          "data": {
            "id": "2787"
          }
        }
      }
    }
  ]
}