{
  "data": {
    "attributes": {
      "publishOn": "2025-12-16T06:48:05-05:00",
      "isLockedPro": false,
      "commentCount": 3,
      "videoPreviewUrl": null,
      "videoDuration": null,
      "themes": {
        "cyclical-swing": {
          "id": 142781,
          "non_theme": true
        },
        "margin-contraction": {
          "id": 548966,
          "non_theme": true
        },
        "new-operational-efficiencies-synergies": {
          "id": 142881,
          "non_theme": true
        },
        "inbound-seo-optimization": {
          "id": 608068
        },
        "alpha-rich-opportunity": {
          "id": 114692
        },
        "more-tags": {
          "id": 698258
        },
        "us": {
          "id": 326,
          "non_theme": true
        },
        "consumer-staples": {
          "id": 30
        }
      },
      "title": "Lamb Weston: A Fry Utility Trapped In A Capacity Cycle",
      "summary": [
        "Lamb Weston is positioned as a scaled, infrastructure-like foodservice provider, facing a challenging capacity cycle with pricing under pressure.",
        "Current execution focuses on cost savings and working capital efficiency via the 'Focus to Win' plan, targeting at least $250 million in savings by FY27.",
        "Management guides for FY26 revenue of $6.35–6.55 billion and adjusted EBITDA of $1.0–1.2 billion, emphasizing stabilization over rapid recovery.",
        "I initiate coverage with a Hold rating, seeing balanced risk/reward and clear upgrade potential if unit economics and FCF improve through fiscal 2026."
      ],
      "isPaywalled": false,
      "structuredInsights": null,
      "lastModified": "2025-12-16T06:51:29-05:00",
      "isModerated": false,
      "availableTranslations": [],
      "closestTradingDate": "2025-12-16",
      "beforeOpeningHours": true,
      "isEarningsSlides": false,
      "isExclusive": true,
      "isTranscript": false,
      "excludedByTag": false,
      "transcriptPath": null,
      "likesCount": 1,
      "disabledMessage": null,
      "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b><span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span><span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>",
      "articleActionableItem": null,
      "inEmbargo": false,
      "isNoindex": false,
      "isNoarchive": true,
      "content": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture><img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2207063119/image_2207063119.jpg?io=getty-c-w630\" alt=\"Fried chips sticks texture background, finger potato ketchup flavored chips pattern, shoestring fries\" data-id=\"2207063119\" data-type=\"getty-image\" width=\"1536\" height=\"1042\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2207063119/image_2207063119.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2207063119/image_2207063119.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2207063119/image_2207063119.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2207063119/image_2207063119.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2207063119/image_2207063119.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2207063119/image_2207063119.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2207063119/image_2207063119.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2207063119/image_2207063119.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"></picture><figcaption><p class=\"item-credits\">Oksana Ermak/iStock via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Lamb Weston (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/LW\" title=\"Lamb Weston Holdings, Inc.\">LW</a></span>) is still a scaled foodservice infrastructure company, but current execution is more evolved in favor of customers. If Focus to Win helps manage pricing discipline and cash effectiveness, this equity is discounted for invested<span class=\"paywall-full-content invisible\"> earnings power.</span></p> <h2 class=\"paywall-full-content invisible\">Business Quality: Efficiency as Competitive DNA</h2> <p class=\"paywall-full-content invisible\">A look at the kind of business Lamb Weston is in reveals that it is a seemingly straightforward business that functions like infrastructure. It takes potatoes and turns them into frozen potato products like French fries and distributes these to food establishments and retail stores around the world. This is a recognized product, but its economics are not. It gets down to a few cents difference per pound that makes or breaks a relationship with a customer in such a business.</p> <p class=\"paywall-full-content invisible\">It is not branding that is the company's competitive advantage. It is industrial repetition. Large production facilities, maximum yield, strict food safety procedures, and the logistics network provide the switching costs that are operational, not contract-based. When it comes to major restaurant chains, it is more than a product that is being ordered. It is totally intertwined with operations such as kitchen procedures, processing times, oil handling, and serving units. Once standardization is achieved, switching introduces operational risk that is preferable to be avoided by most consumers.</p> <p class=\"paywall-full-content invisible\">This is precisely why scale matters differently in this context. Scale allows Lamb Weston to absorb learning curves that smaller processing companies cannot by learning from their facilities and minimizing downtime or waste of potatoes. This translates to lower unit costs in the long run. When the system is running in an optimum manner, it stops being a commodity company and becomes more like a utility that connects with the global food service system.</p> <p class=\"paywall-full-content invisible\">This is aided by the nature of the industry. Frozen potato processing is a highly concentrated industry with very few players, who plan their production capacity many years in advance. When viewed logically, this should make for reasonable pricing and margins. Fries constitute habitual consumer behavior. This means that even in times of economic slowdowns, their sustainability is among the most consistent in the restaurant industry.</p> <p class=\"paywall-full-content invisible\">However, the same organization can reveal vulnerabilities where demand is outstripped by capacity. Fixed costs and new capacities do not change quickly. Within such phases, utilization is the silent driving factor, as discipline is put to the test. This is what is currently being witnessed by Lamb Weston.</p> <h2 class=\"paywall-full-content invisible\">Positioning for Uncertainty: When Utilization Becomes Leverage</h2> <p class=\"paywall-full-content invisible\">The past year and a half changed the dynamic of negotiations along the value chain. Restaurant traffic declined in major markets while new capacity entered the system at the same time. Customers sensed it too. When customers sense that supply is abundant, the dynamic of negotiation for pricing, discounts, trade terms, or warranties develops.</p> <p class=\"paywall-full-content invisible\">Additionally, the customer base of Lamb Weston helps to accentuate this risk. Foodservice sales constitute the key sales for Lamb Weston, with its customer base encompassing some of the biggest customers. McDonald's alone is a mid-teen volume percentage for the company. This is not necessarily a negative point. Big customers ensure scale and visibility for the company. However, the trouble starts when big customers start leveraging their power in a low-demand situation.</p> <p class=\"paywall-full-content invisible\">Management has recognized the increasingly competitive market. This is evident through the data. In the first quarter of fiscal year 2026, Lamb Weston showed strong volume growth with negative price and mix, causing total revenue to remain flat year-over-year. This is expected in a capacity cycle. Volume is protected, but with unit economics being challenged.</p> <p class=\"paywall-full-content invisible\">This strategic shift marks the beginning of the real question that investors need to answer: is it using the flexibility of its pricing as a bridge, or is it rebasing its economics to keep its factories full?</p> <h2 class=\"paywall-full-content invisible\">Financials: What the Numbers Reveal</h2> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/symbol/LW/income-statement\">Fiscal 2025</a> represented an important pivot point. While the revenue base was strong, the degree of profitability weakened. Lamb Weston announced net sales of around $6.45 billion for the year, but with significant decreases in EBITDA from the previous year. In reaction, the company initiated \"Focus to Win,\" a multi-year transformation plan with the objectives of at least $250 million of cost savings, reduced capital intensity, and better management of working capital by fiscal year 2027.</p> <p class=\"paywall-full-content invisible\">This matters. Management is not attributing the entire situation to broad macro factors. It is dealing with its own plan for internal efficiency. This suggests that it is aware that current performance is more than a juncture of soft markets.</p> <p class=\"paywall-full-content invisible\">The first quarter of fiscal year 2026 is a good example of both the challenge and the opportunity that Lamb Weston is facing. Volumes grew strongly, driven by new business wins and enhanced service levels. This is, however, balanced by declines in price and mix. EBITDA is faring better than expected, which is evidence that efforts aimed at cutting costs are yielding positive results.</p> <p class=\"paywall-full-content invisible\">But this is not yet a story of recovering margins. This is a phase of stabilization. In a capital-intensive industry, EBITDA stability in a pricing recession is a positive advantage, not a solution. A big risk is that pricing accommodations could become standard in future contracts, which would further retard stabilization.</p> <p class=\"paywall-full-content invisible\">Management guidance reinforces this conservative outlook. For fiscal 2026, Lamb Weston issued guidance of $6.35-6.55 billion for constant-currency revenue, with $1.0-1.2 billion of adjusted EBITDA, with total capitalized costs of $500 million. This guidance does not include a swift recovery.</p> <p class=\"paywall-full-content invisible\">A balance sheet creates a sense of urgency. Years of growth mean that additional costs of depreciation and leverage cannot easily vary with pricing. This is the reason for the emphasis on cash flow conversion and working capital management in \"Focus to Win\". The next twelve months are more about demonstrating that volume can sustainably coexist with reasonable returns.</p> <p class=\"paywall-full-content invisible\"><figure class=\"regular-img-figure paywall-full-content invisible\" contenteditable=\"false\"><picture><span><a href=\"https://static.seekingalpha.com/uploads/2025/12/14/62523246-17657437015123658_origin.png\" rel=\"lightbox\" data-width=\"2454\" data-height=\"510\" data-og-image-twitter_small_card=\"false\" data-og-image-twitter_large_card=\"false\" data-og-image-twitter_image_post=\"false\" data-og-image-msn=\"false\" data-og-image-facebook=\"false\" data-og-image-google_news=\"false\" data-og-image-google_plus=\"false\" data-og-image-linkedin=\"false\" role=\"button\" aria-label=\"Expand image into lightbox view\"><img src=\"https://static.seekingalpha.com/uploads/2025/12/14/62523246-17657437015123658_origin.png?io=w640\" alt=\"Revenues\" contenteditable=\"false\" width=\"640\" height=\"133\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2025/12/14/62523246-17657437015123658_origin.png?io=w640 640w,https://static.seekingalpha.com/uploads/2025/12/14/62523246-17657437015123658_origin.png?io=w480 480w,https://static.seekingalpha.com/uploads/2025/12/14/62523246-17657437015123658_origin.png?io=w320 320w,https://static.seekingalpha.com/uploads/2025/12/14/62523246-17657437015123658_origin.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"></a></span></picture><figcaption><p class=\"item-caption\">Seeking Alpha</p></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">Valuation: What Are You Paying for Quality?</h2> <p class=\"paywall-full-content invisible\">At current levels, it looks like Lamb Weston is priced for skepticism but not for distress. It is trading in the high teens in terms of forward earnings, with a sales multiple of 1.3 times. Using either metric of <a href=\"https://seekingalpha.com/symbol/LW/valuation/metrics\">EV/EBITDA</a>, it is in the high single digits to low double digits.</p> <p class=\"paywall-full-content invisible\">This positions Lamb Weston between more stable packaged food firms and more cyclical protein firms. While, unlike branded food companies, margins for Lamb Weston are sensitive to utilization rates and contract pricing, unlike protein, the degree of demand variability is lower, and client relationships are longer-term.</p> <p class=\"paywall-full-content invisible\">It seems that the market is factoring in a situation where margins improve only slightly and pricing power is limited. This is a fair baseline. The positive scenario would be if \"Focus to Win\" is able to shift the incentive structure back to return on capital instead of throughput, such that pricing power re-emerges as the cycle returns to normal.</p> <p class=\"paywall-full-content invisible\">A conservative discounted cash flow analysis would suggest that the downside is limited if EBITDA trends around the lower part of guidance and CapEx trends lower. While there is some improvement to the upside if pricing trends stabilize and FCF trends better as working capital turns, the valuation is more in the lower half of a reasonable base-case range.</p> <div class=\"table-responsive paywall-full-content invisible\"> <span class=\"sa-table-scroll-wrapper sa-hide-scrollbar\"><span data-intersection-boundary=\"start\" data-test-id=\"table-scroll-wrapper-boundary-start\"></span><table> <thead><tr> <th><p><strong>Company</strong></p></th> <th><p><strong>Ticker</strong></p></th> <th><p><strong>Forward P/E (approx.)</strong></p></th> <th><p><strong>EV/EBITDA (range)</strong></p></th> <th><p><strong>Price/Sales</strong></p></th> <th><p><strong>Market framing</strong></p></th> </tr></thead> <tr> <td><p><strong>Lamb Weston</strong></p></td> <td><p><strong>(<a href=\"https://seekingalpha.com/symbol/LW\" title=\"Lamb Weston Holdings, Inc.\">LW</a>)</strong></p></td> <td><p>high teens</p></td> <td><p>high single-digit to low-double-digit</p></td> <td><p>~1.3×</p></td> <td><p>Capacity-driven margins; execution under scrutiny</p></td> </tr> <tr> <td><p>Conagra Brands</p></td> <td><p>(<a href=\"https://seekingalpha.com/symbol/CAG\" title=\"Conagra Brands, Inc.\">CAG</a>)</p></td> <td><p>low teens</p></td> <td><p>high single digits</p></td> <td><p>&lt;1.0×</p></td> <td><p>Branded staples, slow growth, levered</p></td> </tr> <tr> <td><p>The Campbell's Company</p></td> <td><p>(<a href=\"https://seekingalpha.com/symbol/CPB\" title=\"The Campbell's Company\">CPB</a>)</p></td> <td><p>low teens</p></td> <td><p>~8-9×</p></td> <td><p>~1.0×</p></td> <td><p>Defensive packaged foods</p></td> </tr> <tr> <td><p>J. M. Smucker</p></td> <td><p>(<a href=\"https://seekingalpha.com/symbol/SJM\" title=\"The J. M. Smucker Company\">SJM</a>)</p></td> <td><p>low teens</p></td> <td><p>mid- to high-single digits</p></td> <td><p>~1.2×</p></td> <td><p>Brand durability, balance sheet focus</p></td> </tr> <tr> <td><p>Pilgrim's Pride</p></td> <td><p>(<a href=\"https://seekingalpha.com/symbol/PPC\" title=\"Pilgrim's Pride Corporation\">PPC</a>)</p></td> <td><p>mid-single digits (cycle-dependent)</p></td> <td><p>~5-6×</p></td> <td><p>~0.5×</p></td> <td><p>Protein cycle volatility</p></td> </tr> <tr> <td><p>Barry Callebaut</p></td> <td><p>(<a href=\"https://seekingalpha.com/symbol/BRRLY\" title=\"Barry Callebaut AG\">BRRLY</a>)</p></td> <td><p>high teens</p></td> <td><p>mid-teens</p></td> <td><p>&lt;0.5×</p></td> <td><p>Cocoa pass-through distorts comparability</p></td> </tr> </table> <span data-intersection-boundary=\"end\" data-test-id=\"table-scroll-wrapper-boundary-end\"></span></span><button type=\"button\" class=\"sa-table-enlarge-button\">Click to enlarge</button> </div> <p class=\"paywall-full-content invisible\">The table above shows that Lamb Weston trades at a moderate premium to established packaged-food <a href=\"https://seekingalpha.com/symbol/LW/peers/comparison\">peers</a>, reflecting its scale and infrastructure-like role in foodservice. At the same time, the current valuation sits at a clear discount to levels that historically implied strong pricing power and high utilization.</p> <h2 class=\"paywall-full-content invisible\">Insiders and Sentiment</h2> <p class=\"paywall-full-content invisible\">Investor sentiment is still tentative in the wake of the guidance reset and the change of leadership in late 2024. Volatility within the staples category is punished severely by the market, with credibility taking time to restore.</p> <p class=\"paywall-full-content invisible\">Stock dividends provide a corrective influence. Lamb Weston has maintained dividends and stock repurchases, indicating that the current management believes that the stock is not overpriced relative to long-term earnings. Insider trends are mixed, presenting no sharp buy or sell indication.</p> <p class=\"paywall-full-content invisible\">A more significant sentiment catalyst will be consistency of operations. Having two or three consecutive periods of stable margins and sound pricing strategies would trigger a positive shift quicker than an announcement.</p> <h2 class=\"paywall-full-content invisible\">Catalysts on the Horizon</h2> <p class=\"paywall-full-content invisible\">The key driver is the visibility of execution. \"Focus to Win\" offers actionable targets for cost and working capital. When these benefits work their way through earnings, this should help boost confidence.</p> <p class=\"paywall-full-content invisible\">A second catalyst would be the stabilization of price and mix. A volume growth with unchanged pricing would indicate that the relationship with the customers is no longer protected by concessions.</p> <p class=\"paywall-full-content invisible\">Third, capital intensity is likely to moderate as expansion projects are finished. Improved FCF would move Lamb Weston more toward a cash-generative compounder.</p> <h2 class=\"paywall-full-content invisible\">Risks: Where Could This Break?</h2> <p class=\"paywall-full-content invisible\">One of the more apparent risk factors is the potential for sustained pricing pressure. If the current customers continue to drive the excess capacities, a recovery in margins would likely be pushed into fiscal year 2026 or later.</p> <p class=\"paywall-full-content invisible\">A more subtle risk is related to culture. Large-volume processors could begin to make more throughput-based decisions, where keeping their lines running is the key. This could undermine their economics without the strict return on capital constraint.</p> <p class=\"paywall-full-content invisible\">Leverage effectively constrains levels of patience. Although it is finite, the balance sheet is less forgiving with respect to error tolerance related to EBITDA. It is also more exposed to risk with respect to legal considerations.</p> <h2 class=\"paywall-full-content invisible\">Conclusion: Still Worth the Price?</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">Lamb Weston is still a strong operator in a tough cycle of capacity. Going forward, the key is how much pricing discipline and cash efficiency is brought back by \"Focus to Win,\" as opposed to just protecting volume. At current prices, I believe the risk/reward is balanced. I initiate coverage of Lamb Weston with a <strong>Hold</strong> recommendation, with clear upgrades for improvement in unit economics and FCF through fiscal 2026.</p>",
      "quickInsights": [
        {
          "question": "How does LW's 'Focus to Win' plan impact its investment case?",
          "answer": "'Focus to Win' targets $250 million in cost savings and improved working capital by FY27, aiming to stabilize margins and enhance cash flow conversion in a tough pricing environment."
        }
      ],
      "twitContent": "Lamb Weston: A Fry Utility Trapped In A Capacity Cycle $LW #business #markets #stockmarket https://seekingalpha.com/article/4853628-lamb-weston-a-fry-utility-trapped-in-a-capacity-cycle?source=tweet",
      "isReit": false,
      "videoData": null,
      "marketingBulletVariant": null,
      "marketingBio": null,
      "audioDuration": 721.8,
      "originalTitle": "Lamb Weston: A Fry Utility Trapped In A Capacity Cycle"
    },
    "relationships": {
      "author": {
        "data": {}
      },
      "sentiments": {
        "data": [
          {}
        ]
      },
      "primaryTickers": {
        "data": [
          {
            "id": "571204"
          }
        ]
      },
      "secondaryTickers": {
        "data": []
      },
      "otherTags": {
        "data": [
          {},
          {},
          {},
          {},
          {
            "id": "571204"
          },
          {},
          {},
          {},
          {},
          {},
          {},
          {
            "id": "326"
          }
        ]
      },
      "coAuthors": {
        "data": []
      },
      "presentations": {
        "data": []
      },
      "updates": {
        "data": []
      },
      "corrections": {
        "data": []
      }
    },
    "links": {
      "schemaImage": []
    }
  },
  "included": [
    {
      "attributes": {
        "company": null,
        "userId": 62523246,
        "tagId": 784158,
        "bio": "I am an independent trader and market analyst with a focused specialization in the micro-cap segment. My investment strategy combines technical analysis with the CAN SLIM methodology, pioneered by William O'Neil, to uncover high-growth companies that are often overlooked by mainstream analysts. I seek out emerging businesses showing strong financial momentum, rapid earnings growth, and signs of institutional interest—key indicators that often precede explosive stock moves. In addition to equities, I also have experience in Forex trading, which has sharpened my ability to interpret price action, volatility, and market sentiment. This multi-market background allows me to better understand the behavioral aspects of trading and refine my timing on entry and exit points. My research process integrates both fundamental and technical perspectives. I pay close attention to indicators such as relative strength, unusual trading volume, and earnings acceleration to identify stocks on the verge of significant breakouts. My goal is to spot opportunities early—before broader market recognition drives prices higher. Writing on Seeking Alpha is a vital part of my investment process. It allows me to validate my ideas, document my research, and connect with a community of like-minded investors. My articles focus on uncovering under-the-radar growth stocks with compelling fundamentals and favorable technical setups. Ultimately, I aim to provide insightful, actionable content that helps others navigate the market with greater confidence and clarity.",
        "image": {},
        "deactivated": null,
        "memberSince": 2025,
        "isRss": false,
        "contributorSince": 2025,
        "followersCount": 87
      },
      "relationships": {
        "user": {
          "data": {}
        },
        "userBioTags": {
          "data": [
            {},
            {},
            {},
            {},
            {},
            {}
          ]
        },
        "authorResearch": {
          "data": null
        }
      },
      "links": {
        "site": null,
        "linkedinUrl": null,
        "twitterUrl": null
      }
    },
    {
      "id": "571204",
      "attributes": {
        "company": "Lamb Weston Holdings, Inc.",
        "fundTypeId": 0,
        "isDefunct": false,
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "name": "New Operational Efficiencies / Synergies",
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "id": "326",
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "articleId": 4853628,
        "createdAt": "2025-12-16T06:48:05.000-05:00",
        "typeId": 2
      },
      "relationships": {
        "article": {
          "data": {}
        },
        "tag": {
          "data": {
            "id": "571204"
          }
        }
      }
    }
  ]
}