{
  "data": {
    "attributes": {
      "publishOn": "2025-12-24T03:36:51-05:00",
      "isLockedPro": false,
      "commentCount": 0,
      "videoPreviewUrl": null,
      "videoDuration": null,
      "themes": {
        "income": {
          "id": 601405,
          "non_theme": true
        },
        "activist-target": {
          "id": 115132,
          "non_theme": true
        },
        "dividend-increase": {
          "id": 115182,
          "non_theme": true
        },
        "margin-contraction": {
          "id": 548966,
          "non_theme": true
        },
        "relative-valuation": {
          "id": 115332,
          "non_theme": true
        },
        "inbound-seo-optimization": {
          "id": 608068
        },
        "alpha-rich-opportunity": {
          "id": 114692
        },
        "alpha-rich-investment-style": {
          "id": 114682
        },
        "more-tags": {
          "id": 698258
        },
        "us": {
          "id": 326,
          "non_theme": true
        },
        "consumer-staples": {
          "id": 30
        }
      },
      "title": "Lamb Weston Doesn't Look Like A Great Deal After The Selloff",
      "summary": [
        "Lamb Weston faces temporary headwinds as volume rises 8%, but pricing falls 8%, reflecting weak pricing power in a competitive market.",
        "Margins are expected to weaken in 2026 due to value meal-driven price pressure, private-label competition, and ramp-up costs at new international factories.",
        "Jana Partners reduced its stake, and management guides for flat gross margins, signaling investor caution and limited near-term upside.",
        "With a fair valuation, a $36 price target implies 16% downside; I rate LW as a hold given better CPG sector alternatives."
      ],
      "isPaywalled": false,
      "structuredInsights": null,
      "lastModified": "2025-12-24T03:39:43-05:00",
      "isModerated": false,
      "availableTranslations": [],
      "closestTradingDate": "2025-12-24",
      "beforeOpeningHours": true,
      "isEarningsSlides": false,
      "isExclusive": true,
      "isTranscript": false,
      "excludedByTag": false,
      "transcriptPath": null,
      "likesCount": 0,
      "disabledMessage": null,
      "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b><span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span><span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>",
      "articleActionableItem": null,
      "inEmbargo": false,
      "isNoindex": false,
      "isNoarchive": true,
      "content": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2192062264/image_2192062264.jpg?io=getty-c-w630\" alt=\"Lamb Weston headquarters in Eagle, Idaho, USA.\" data-id=\"2192062264\" data-type=\"getty-image\" width=\"1536\" height=\"1024\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2192062264/image_2192062264.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2192062264/image_2192062264.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2192062264/image_2192062264.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2192062264/image_2192062264.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2192062264/image_2192062264.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2192062264/image_2192062264.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2192062264/image_2192062264.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2192062264/image_2192062264.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">JHVEPhoto/iStock Editorial via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <p>Like some other large CPG companies, Lamb Weston (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/LW\" title=\"Lamb Weston Holdings, Inc.\">LW</a></span>) traded pricing for volume recently. It looks like shareholders didn<span></span>'t like this decision. But now, value investors see a potential bargain here. Consumers still love<span class=\"paywall-full-content invisible\"> French fries, and this company supplies French fries to major fast-food restaurants. But restaurants are now using value meals to compete in a tough market, so they</span><span class=\"paywall-full-content invisible\"></span><span class=\"paywall-full-content invisible\">'re reducing menu prices and can</span><span class=\"paywall-full-content invisible\"></span><span class=\"paywall-full-content invisible\">'t pay as much for French fries. As a result, Lamb Weston might be experiencing temporary headwinds on pricing. And it</span><span class=\"paywall-full-content invisible\"></span><span class=\"paywall-full-content invisible\">'s also experiencing temporary headwinds as it ramps up production at its factories around the world. But after looking at this company more closely, I think better deals are available in the CPG sector.</span></p> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/pr/20345844-lamb-weston-reports-second-quarter-fiscal-2026-results-reaffirms-fiscal-year-2026-outlook#hasComeFromMpArticle=false\">In fiscal 2Q 2026</a>, Lamb Weston reported that revenue rose 1.1% to $1.62 billion. But in its earnings release, the company also said that its revenue only rose because of favorable currency effects and would otherwise have been flat. Additionally, it said volume was up 8%, but price was down 8%. Lamb Weston is selling more French fries, and it even restarted production lines in the US to produce more French fries. It<span></span>'s clear that consumers in both the US and other countries want more French fries. But it appears that this company doesn<span></span>'t have a lot of pricing power either, because French fries are a commodity.</p> <p class=\"paywall-full-content invisible\">So, the bull case for Lamb Weston will depend on whether it can make its french fry factories more efficient. It seems like investors aren<span></span>'t very confident in the company<span></span>'s plans right now, and some of them may have their own ideas about how it can improve its efficiency. Several months ago, the <a href=\"https://www.reuters.com/sustainability/sustainable-finance-reporting/lamb-weston-settles-with-jana-giving-activist-big-voice-board-2025-06-30/\" rel=\"nofollow\">activist investor Jana Partners</a> forced Lamb Weston to add new members to its board of directors. So, this is the first factor I<span></span>'d consider.</p> <h2 class=\"paywall-full-content invisible\">Jana Partners Has Reduced its Stake in Lamb Weston</h2> <p class=\"paywall-full-content invisible\">In November 2025, <a href=\"https://www.sec.gov/Archives/edgar/data/1998597/000090266425005066/xslForm13F_X02/infotable.xml\" rel=\"nofollow\">Jana Partners reported</a> that it owned 5 million shares in Lamb Weston at the end of the third quarter. Lamb Weston<span></span>'s diluted share count was 140.7 million as of fiscal 2Q 2026, so Jana Partners now has about a 3.6% stake in the company. The Reuters article said that Jana Partners had a 7% stake in Lamb Weston in June, which means that the hedge fund sold part of its stake in the french fry company. It<span></span>'s not clear why Jana Partners reduced its stake in Lamb Weston, but this doesn<span></span>'t look like a good sign to me.</p> <h2 class=\"paywall-full-content invisible\"> <strong>F</strong><strong>rench Fry Demand and Value Meals</strong> </h2> <p class=\"paywall-full-content invisible\"><a href=\"https://seekingalpha.com/article/4854741-lamb-weston-holdings-inc-lw-q2-2026-earnings-call-transcript\">On the call</a>, Lamb Weston explained that while some of its production lines were shut down, it was running its remaining production lines at very high utilization levels. Now that the other production lines are online again, it won<span></span>'t have to do this anymore. So, it sounds like Lamb Weston was trying to reduce its costs by shutting down underused operations temporarily, but restaurants ordered more French fries than it expected. Value meals might be the reason for this.</p> <p class=\"paywall-full-content invisible\">Recently, restaurants such as McDonald<span></span>'s (<a href=\"https://seekingalpha.com/symbol/MCD\" title=\"McDonald's Corporation\">MCD</a>) have been introducing <a href=\"https://www.cnbc.com/2025/09/02/mcdonalds-value-menu-combo-meals.html\" rel=\"nofollow\">low-priced value meals</a> to appeal to cautious consumers. BOGO deals and $5 value meals are popular with consumers who are trying to save money. And of course, value meals often come with French fries and a drink. Value meal deals might help explain why Lamb Weston<span></span>'s volume went up this quarter, but its price went down. If franchise owners are offering big discounts, they won<span></span>'t have as much money to pay suppliers.</p> <p class=\"paywall-full-content invisible\">The restaurant sector remains competitive, and the value meal deals remain popular. The CNBC article even says that McDonald<span></span>'s extended the value menu promotion. So, I think fast-food restaurants will continue to offer similar promotions in 2026 to maintain their traffic. And Lamb Weston<span></span>'s customers will continue to order more French fries, and they won<span></span>'t be happy if they don<span></span>'t get them, so it was a good decision to reopen the production lines. On the call, the CEO explained that reopening the lines won<span></span>'t reduce margins, either. But if restaurants are using discounts to drive growth next year, they<span></span>'re going to pay close attention to their supply costs as well, so Lamb Weston<span></span>'s margins may remain under pressure.</p> <h2 class=\"paywall-full-content invisible\">Consumers Are Also Switching to Private-Label French Fries</h2> <p class=\"paywall-full-content invisible\">Some low-income consumers are going to grocery stores and buying French fries there instead of going to restaurants. Grocery stores sell both restaurant-brand French fries and private-label French fries. So, if consumers really need to cut their budgets, they can skip the seasoned restaurant fries and buy private-label fries. On the call, Lamb Weston CFO Bernadette Madarieta said, “In North America, we are seeing a higher proportion of our business with multinational chain customers as well as we are seeing in our retail channel a shift from branded to more private label.” The CFO also said she expects flat gross margins in 2026 because of this shift. Many grocery stores are investing in their private-label product lines right now, and this is a risk factor for other CPG companies as well as Lamb Weston.</p> <h2 class=\"paywall-full-content invisible\">Argentina Will Be a Long-Term Growth Driver</h2> <p class=\"paywall-full-content invisible\">Lamb Weston<span></span>'s new <a href=\"https://www.foodbev.com/news/lamb-weston-expands-footprint-in-latin-america-with-production-facility-in-argentina\" rel=\"nofollow\">Argentinian potato products factory</a> officially opened in October 2025. The new factory will supply French fries and other products to Brazil as well as many other Latin American countries in addition to Argentina. In the long term, this factory will be a growth driver for the company. But on the call, Madarieta explained that it would take more time for the factory to increase its production. She explained, “During this ramp-up, fixed costs will be spread over lower production volumes, resulting in higher cost per pound for the remainder of the year.” So, it sounds like the new Argentinian factory will also put pressure on Lamb Weston<span></span>'s margins in 2026.</p> <p class=\"paywall-full-content invisible\">This also sounds like good news for Arcos Dorados (<a href=\"https://seekingalpha.com/symbol/ARCO\" title=\"Arcos Dorados Holdings Inc.\">ARCO</a>) because it means that demand for McDonald<span></span>'s and its French fries is expected to grow in South America. And once the new potato factory is operating at normal capacity, the supply of French fries will rise, and that could reduce Arcos Dorados<span></span>' supply costs. If you aren<span></span>'t familiar with this company, it operates the McDonald<span></span>'s franchises in Latin America.</p> <h2 class=\"paywall-full-content invisible\">Comparative Valuation for Lamb Weston</h2> <p class=\"paywall-full-content invisible\">After the sell-off, Lamb Weston is trading at similar multiples to other large CPG companies. The company had a forward EV/EBITDA of 8.59 and a forward EV/sales of 1.53 after the close on December 22. On the same date, Conagra Brands had a forward EV/EBITDA of 9.19 and a forward EV/sales of 1.41. And The Campbell<span></span>'s Company (<a href=\"https://seekingalpha.com/symbol/CPB\" title=\"The Campbell's Company\">CPB</a>) had a forward EV/EBITDA of 9.17 and an EV/sales of 1.57. So, it appears that the sell-off was justified, and this company is now fairly valued in comparison to its peers.</p> <p class=\"paywall-full-content invisible\">On the same date, this company also had a forward P/E of 20, according to Seeking Alpha, and it doesn<span></span>'t seem like its recent performance justifies a premium P/E multiple. And while it increased its dividend by 3% this quarter, its 3.46% forward yield isn<span></span>'t attractive in comparison to peers<span></span>' yields, either.</p> <p class=\"paywall-full-content invisible\"><figure class=\"sa-widget sa-ycharts paywall-full-content invisible\"><img src=\"https://static.seekingalpha.com/uploads/2025/12/22/saupload_8cb59d53ab75134b02ddd66c9ed3d4a2.png?io=w640\" alt=\"Chart\" width=\"635\" height=\"366\" class=\"sa-ycharts-img\" data-width=\"635\" data-height=\"366\" loading=\"lazy\" srcset=\"https://static.seekingalpha.com/uploads/2025/12/22/saupload_8cb59d53ab75134b02ddd66c9ed3d4a2.png?io=w480 480w,https://static.seekingalpha.com/uploads/2025/12/22/saupload_8cb59d53ab75134b02ddd66c9ed3d4a2.png?io=w320 320w,https://static.seekingalpha.com/uploads/2025/12/22/saupload_8cb59d53ab75134b02ddd66c9ed3d4a2.png?io=w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 180px), 552px\"><figcaption>Data by <a href=\"https://ycharts.com\" rel=\"nofollow\">YCharts</a></figcaption></figure></p> <h2 class=\"paywall-full-content invisible\">Lamb Weston Expects Weaker Margins in 2026</h2> <p class=\"paywall-full-content invisible\">Before I provide my estimate on Lamb Weston<span></span>'s value, I<span></span>'ll explain why I expect its margins to get worse in 2026. On the 2Q 2026 earnings call, analysts asked Lamb Weston<span></span>'s management why the company maintained its EBITDA guidance and wouldn<span></span>'t raise the lower end of its guidance. The CEO explained that there was a large potato crop in Europe and the company<span></span>'s Focus to Win program was a long-term plan. So, it doesn<span></span>'t sound like Lamb Weston<span></span>'s margins are likely to improve this year, and management doesn<span></span>'t want to provide guidance for 2027 yet either.</p> <p class=\"paywall-full-content invisible\">In 2Q 2026, the company reported adjusted EBITDA of $285.7 million, so it had a 17.7% adjusted EBITDA margin this quarter. Its full-year 2026 guidance calls for $6.35 to $6.55 billion in revenue and $1.0 billion to $1.2 billion in adjusted EBITDA. At the midpoint of both estimates, the company<span></span>'s full-year EBITDA margin would be 17.1%, which means Lamb Weston expects its margins to weaken further in fiscal 2026. Again, the factory in Argentina won<span></span>'t reach its full output immediately, and it sounds like the company<span></span>'s European factories aren<span></span>'t at full capacity either. So, even if the US production lines are operating efficiently now, the international production lines are not.</p> <h2 class=\"paywall-full-content invisible\">Value Calculation for Lamb Weston</h2> <p class=\"paywall-full-content invisible\">If Lamb Weston<span></span>'s revenue rises 1% to $6.516 billion in 2026 because of currency effects and it maintains a 17.1% adjusted EBITDA margin, its full-year EBITDA would be $1.114 billion. Because this company<span></span>'s margins are weakening, I<span></span>'ll project that its EV/EBITDA will drop to 8. At an EV/EBITDA of 8, its EV would be $8.914 billion.</p> <p class=\"paywall-full-content invisible\">If I subtract $3.94 billion in debt and add back $83 million in cash, Lamb Weston<span></span>'s 2026 market cap would be $5.057 billion. It does look like Lamb Weston plans to keep buying back stock, so I<span></span>'ll also project that it will reduce its share count from 140.7 million shares at the end of 2Q 2026 to 139 million shares at the end of the year. If I divide a market cap of $5.057 billion by 139 million shares, I get a one-year price target of $36. The company<span></span>'s current share price is $43, so my price target calls for 16% downside.</p> <p class=\"paywall-full-content invisible\">SA analysts and the SA Quant score say that Lamb Weston is a hold right now, while Wall Street analysts say it<span></span>'s a buy. SA also isn<span></span>'t displaying any warning signs for this company, like it has been doing with other companies that haven<span></span>'t been performing well. And there<span></span>'s currently 2.79% short interest for Lamb Weston, which is relatively low. So, even though my price target is lower than the current price, I wouldn<span></span>'t call this company a sell right now.</p> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">It<span></span>'s very likely that Lamb Weston<span></span>'s margins will get worse in 2026, but the situation will get better in 2027 as its factories get closer to normal output levels. And this company is also implementing a long-term efficiency plan that<span></span>'s likely to reduce its costs. At the same time, its performance doesn<span></span>'t justify a buy rating. Other CPG companies offer stronger growth and higher dividend yields. So, while I like eating Lamb Weston<span></span>'s French fries, I<span></span>'d say this stock is a hold right now.</p>",
      "quickInsights": [
        {
          "question": "How will LW's margins trend in 2026 and why?",
          "answer": "LW expects weaker margins in 2026 due to price pressure from value meals, private-label competition, and higher costs from ramping up new factories, especially in Argentina."
        }
      ],
      "twitContent": "Lamb Weston Doesn't Look Like A Great Deal After The Selloff $LW #markets #investing #trading https://seekingalpha.com/article/4855542-lamb-weston-doesnt-look-like-a-great-deal-after-the-selloff?source=tweet",
      "isReit": false,
      "videoData": null,
      "marketingBulletVariant": null,
      "marketingBio": null,
      "audioDuration": 709.272,
      "originalTitle": "Lamb Weston Doesn't Look Like A Great Deal After The Selloff"
    },
    "relationships": {
      "author": {
        "data": {}
      },
      "sentiments": {
        "data": [
          {}
        ]
      },
      "primaryTickers": {
        "data": [
          {
            "id": "571204"
          }
        ]
      },
      "secondaryTickers": {
        "data": []
      },
      "otherTags": {
        "data": [
          {},
          {},
          {},
          {},
          {},
          {},
          {
            "id": "571204"
          },
          {},
          {},
          {},
          {},
          {},
          {},
          {
            "id": "326"
          }
        ]
      },
      "coAuthors": {
        "data": []
      },
      "presentations": {
        "data": []
      },
      "updates": {
        "data": []
      },
      "corrections": {
        "data": []
      }
    },
    "links": {
      "schemaImage": []
    }
  },
  "included": [
    {
      "attributes": {
        "company": null,
        "userId": 34560735,
        "tagId": 466715,
        "bio": "I am a freelance business writer. I formerly wrote articles for the Motley Fool Blogging Network, where I won several editor's choice awards. After that, I wrote articles for the main Motley Fool site. I typically focus on restaurants, retailers, and food manufacturers, considering both growth opportunities and valuation metrics. I usually look for long term investment opportunities and plan to hold stocks for several years.",
        "image": {},
        "deactivated": null,
        "memberSince": 2014,
        "isRss": false,
        "contributorSince": 2014,
        "followersCount": 205
      },
      "relationships": {
        "user": {
          "data": {}
        },
        "userBioTags": {
          "data": [
            {},
            {}
          ]
        },
        "authorResearch": {
          "data": null
        }
      },
      "links": {
        "site": null,
        "linkedinUrl": null,
        "twitterUrl": null
      }
    },
    {
      "id": "571204",
      "attributes": {
        "company": "Lamb Weston Holdings, Inc.",
        "fundTypeId": 0,
        "isDefunct": false,
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "id": "326",
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "articleId": 4855542,
        "createdAt": "2025-12-24T03:36:51.000-05:00",
        "typeId": 2
      },
      "relationships": {
        "article": {
          "data": {}
        },
        "tag": {
          "data": {
            "id": "571204"
          }
        }
      }
    }
  ]
}