{
  "data": {
    "attributes": {
      "commentCount": 0,
      "title": "Stocks rise on Wall Street as AI stocks turn higher again",
      "publishOn": "2025-12-18T23:15:00.000-05:00",
      "lastModified": "2025-12-19T16:54:16-05:00",
      "widgetLinks": null,
      "content": "<div>\n<p>\n  </p>\n<p><span class=\"location\" value=\"LU/us.ny.nyc\">NEW YORK</span> (AP) — Stocks gained ground on <span class=\"location\" value=\"\">Wall Street</span> Friday for a second straight day, wiping away losses from earlier in the week.</p>\n  <p>Technology stocks were once again the main force behind the market's broader moves, especially companies with a focus on artificial intelligence. Both the S&amp;P 500 and the Nasdaq closed out the week with gains, despite several stumbles early this week.</p>\n  <p>The S&amp;P 500 rose 59.74 points, or 0.9%, to 6,834.50. It notched a 0.1% gain for the week. The Dow Jones Industrial Average rose 183.04 points, or 0.4%, to 48,134.89.</p>\n  <p>The technology-heavy Nasdaq made the biggest move. It rose 301.26 points, or 1.3%, to 23,307.62 and notched a 0.5% gain for the week.</p>\n  <p>Nvidia (<a href=\"https://seekingalpha.com/symbol/NVDA\">NVDA</a>) was the biggest force driving the market higher, with a 3.9% gain. Broadcom (<a href=\"https://seekingalpha.com/symbol/AVGO\">AVGO</a>) jumped 3.2%.</p>\n  <p>The technology sector has been fueling <span class=\"location\" value=\"\">Wall Street</span> throughout the year as companies with outsized values like Nvidia exert more pressure on markets. But, those pricey stock values have come under more scrutiny from investors wondering whether they are justifiable.</p>\n  <p>Oracle rose 6.6% on news that it, along with two other investors, had signed agreements to form a new <a href=\"https://apnews.com/article/tiktok-divestment-deal-trump-2fdb915cac5b6d06907a5a2de6764376\">TikTok <span class=\"location\" value=\"LC/us\">U.S.</span> joint ventur</a> e. Oracle, <span class=\"location\" value=\"LU/us.ny.silake\">Silver Lake</span> and MGX each get a 15% share in the popular social video platform, ensuring that it can continue operating in the <span class=\"location\" value=\"LC/us\">U.S.</span></p>\n  <p>Company earnings and how companies are performing amid tariffs and inflation were a key focus for <span class=\"location\" value=\"\">Wall Street</span>.</p>\n  <p>Nike (<a href=\"https://seekingalpha.com/symbol/NKE\">NKE</a>) slumped 10.5%, as the impact from tariffs overshadowed an otherwise strong quarterly profit report. Frozen potato maker Lamb Weston (<a href=\"https://seekingalpha.com/symbol/LW\">LW</a>) fell 25.9%, despite also beating <span class=\"location\" value=\"\">Wall Street's</span> profit and revenue forecasts.</p>\n  <p>Winnebago Industries (<a href=\"https://seekingalpha.com/symbol/WGO\">WGO</a>) jumped 8.4% after turning in profits and revenue for its latest quarter that easily beat analysts’ estimates.</p>\n  <p>Homebuilders fell following a report showing that <a href=\"https://apnews.com/article/housing-home-sales-real-estate-home-prices-7e9f7be9e5643e9061d0be9ad4c75212\">home sales slowed from a year earlier</a> for the first time since May. KB Home (<a href=\"https://seekingalpha.com/symbol/KBH\">KBH</a>) fell 8.5%.</p>\n  <p>A survey from the University of Michigan showed that consumer sentiment in December improved slightly from November, but is deeply diminished from a year ago.</p>\n  <p>“Despite some signs of improvement to close out the year, sentiment remains nearly 30% below December 2024, as pocketbook issues continue to dominate consumer views of the economy,” wrote Surveys of Consumers Director, <span class=\"person\" value=\"\">Joanne Hsu</span>.</p>\n  <p>Consumer confidence has been weakening throughout the year as persistent inflation squeezes consumers. The job market is also slowing while retail sales weaken. Businesses and consumers are also worrying about the continued impact of a wide-ranging <span class=\"location\" value=\"LC/us\">U.S.</span>-led trade war that has targeted key partners including <span class=\"location\" value=\"LC/cn\">China</span> and <span class=\"location\" value=\"LC/ca\">Canada</span>.</p>\n  <p>The latest inflation update on Thursday revealed a surprise cooling of prices in November. The Labor Department reported that its consumer price index rose 2.7%. But economists quickly warned that those numbers were suspect because they’d been delayed and likely distorted by the 43-day federal shutdown.</p>\n  <p>“The wave of economic data did little to provide clarity for investors this week, keeping the market in the trading range it has been in since September,” said. <span class=\"person\" value=\"\">Mark Hackett</span>, chief market strategist at Nationwide, in a note to investors.</p>\n  <p>Inflation is still above the Federal Reserve's 2% target. The central bank cut its benchmark interest rate at its most recent meeting. It has been concerned about the slowing job market hurting the economy. But cutting interest rates could add more fuel to inflation, which could also stunt economic growth.</p>\n  <p>The Fed has maintained a cautious stance about interest rate policy heading into 2026 and <span class=\"location\" value=\"\">Wall Street</span> is mostly betting that it will hold steady on rates at its next meeting in January.</p>\n  <p>Treasury yields rose in the bond market. The yield on the 10-year Treasury rose to 4.15% from 4.11% late Thursday.</p>\n  <p>Japanese stocks rose after the Bank of Japan raised its benchmark interest rate to its highest level in 30 years. In <span class=\"location\" value=\"LU/jp..tokyo\">Tokyo</span>, the Nikkei 225 gained 1%, leading the rise across <span class=\"location\" value=\"LR/asp\">Asia's</span> key markets. Markets in <span class=\"location\" value=\"LR/eur\">Europe</span> also gained ground.</p>\n  <p>——</p>\n  <p>AP Business Writer <span class=\"person\" value=\"\">Matt Ott</span> contributed.</p>\n  \nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.\n\n</div>",
      "widgetTitle": null
    },
    "relationships": {
      "acquireService": {
        "data": {
          "id": "68"
        }
      },
      "primaryTickers": {
        "data": [
          {
            "id": "663"
          },
          {
            "id": "917"
          },
          {
            "id": "1133"
          },
          {
            "id": "1150"
          },
          {
            "id": "1870"
          },
          {},
          {
            "id": "571204"
          },
          {}
        ]
      },
      "secondaryTickers": {
        "data": []
      },
      "otherTags": {
        "data": []
      }
    },
    "links": {}
  },
  "included": [
    {
      "id": "68",
      "attributes": {}
    },
    {
      "id": "663",
      "attributes": {},
      "links": {}
    },
    {
      "id": "917",
      "attributes": {},
      "links": {}
    },
    {
      "id": "1133",
      "attributes": {},
      "links": {}
    },
    {
      "id": "1150",
      "attributes": {},
      "links": {}
    },
    {
      "id": "1870",
      "attributes": {},
      "links": {}
    },
    {
      "attributes": {},
      "links": {}
    },
    {
      "id": "571204",
      "attributes": {
        "company": "Lamb Weston Holdings, Inc."
      },
      "links": {}
    },
    {
      "attributes": {},
      "links": {}
    }
  ]
}