{
  "data": {
    "attributes": {
      "publishOn": "2025-12-28T01:28:28-05:00",
      "isLockedPro": false,
      "commentCount": 0,
      "videoPreviewUrl": null,
      "videoDuration": null,
      "themes": {
        "deep-value": {
          "id": 115452,
          "non_theme": true
        },
        "high-quality-business-model": {
          "id": 548906,
          "non_theme": true
        },
        "margin-expansion": {
          "id": 142841,
          "non_theme": true
        },
        "overvaluation": {
          "id": 142911,
          "non_theme": true
        },
        "relative-valuation": {
          "id": 115332,
          "non_theme": true
        },
        "magnificent-7": {
          "id": 777536
        },
        "inbound-seo-optimization": {
          "id": 608068
        },
        "alpha-rich-opportunity": {
          "id": 114692
        },
        "alpha-rich-investment-style": {
          "id": 114682
        },
        "more-tags": {
          "id": 698258
        },
        "us": {
          "id": 326,
          "non_theme": true
        },
        "information-technology": {
          "id": 45
        }
      },
      "title": "Apple: Quality Vs. Price",
      "summary": [
        "Apple delivered record Q4 2025 revenue, net income, and EPS, underscoring unmatched business quality and execution.",
        "AAPL's services segment now dominates profit generation, with 28% of revenue and 75.3% gross margin, transforming its business model.",
        "Despite strong AI investment and China recovery, AAPL trades at 33x forward P/E—leaving little margin for error and limited upside.",
        "At current valuations, AAPL is a SELL for risk-averse investors; selective accumulate only on significant weakness near $195/share."
      ],
      "isPaywalled": false,
      "structuredInsights": null,
      "lastModified": "2025-12-28T02:02:28-05:00",
      "isModerated": false,
      "availableTranslations": [],
      "closestTradingDate": "2025-12-29",
      "beforeOpeningHours": true,
      "isEarningsSlides": false,
      "isExclusive": true,
      "isTranscript": false,
      "excludedByTag": false,
      "transcriptPath": null,
      "likesCount": 0,
      "disabledMessage": null,
      "disclosure": "<p id=\"a-disclosure\"><b>Analyst’s Disclosure:</b><span>I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.</span><span id=\"top-business-disclosure\"> I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. </span></p><p id='a-disclosure-more'><strong>Seeking Alpha's Disclosure:</strong> Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.</p>",
      "articleActionableItem": null,
      "inEmbargo": false,
      "isNoindex": false,
      "isNoarchive": true,
      "content": "<p data-eci=\"true\"><figure class=\"getty-figure\" data-type=\"getty-image\"><picture> <img src=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1705316992/image_1705316992.jpg?io=getty-c-w630\" alt=\"Apple Store at 5th Ave in Manhattan, New York City\" data-id=\"1705316992\" data-type=\"getty-image\" width=\"1536\" height=\"986\" srcset=\"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1705316992/image_1705316992.jpg?io=getty-c-w1536 1536w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1705316992/image_1705316992.jpg?io=getty-c-w1280 1280w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1705316992/image_1705316992.jpg?io=getty-c-w1080 1080w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1705316992/image_1705316992.jpg?io=getty-c-w750 750w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1705316992/image_1705316992.jpg?io=getty-c-w640 640w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1705316992/image_1705316992.jpg?io=getty-c-w480 480w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1705316992/image_1705316992.jpg?io=getty-c-w320 320w, https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1705316992/image_1705316992.jpg?io=getty-c-w240 240w\" sizes=\"(max-width: 767px) calc(100vw - 36px), (max-width: 1023px) calc(100vw - 132px), (max-width: 1199px) calc(100vw - 666px), (max-width: 1307px) calc(100vw - 708px), 600px\" fetchpriority=\"high\"> </picture><figcaption><p class=\"item-caption\"> </p> <p class=\"item-credits\">ozgurdonmaz/iStock Unreleased via Getty Images</p></figcaption></figure></p> <div class=\"inline_ad_placeholder\"></div> <h2>Summary</h2> <p>Apple's (<span class=\"ticker-hover-wrapper\"><a href=\"https://seekingalpha.com/symbol/AAPL\" title=\"Apple Inc.\">AAPL</a></span>) <a href=\"https://www.apple.com/newsroom/2025/10/apple-reports-fourth-quarter-results/\" rel=\"nofollow\">Q4 2025 results</a> revealed a company executing its business flawlessly. However, with the stock trading at 33x forward earnings...which is substantially above its historical 23.5x average...current prices leave no room for<span class=\"paywall-full-content invisible\"> disappointment. For risk-conscious investors, this means patience and, perhaps, avoidance. For longer-term investors willing to accept volatility, accumulation on weakness.</span></p> <h2 class=\"paywall-full-content invisible\">Apple Intelligence: Q4 Results Tell Us About the Future</h2> <p class=\"paywall-full-content invisible\">Apple's pivot toward artificial intelligence is no longer theoretical. Q4 2025 signals that the company is making a big capital bet that will reshape its future through 2026 and beyond.</p> <p class=\"paywall-full-content invisible\">Capital expenditure surged 34.5% year-over-year to $12.7 billion, with <a href=\"https://seekingalpha.com/article/4835951-apple-inc-aapl-q4-2025-earnings-call-transcript\">CEO Tim Cook</a> explicitly framing the company's next growth cycle as \"AI-driven and services-centric.\" That is a significant shift in priorities.</p> <p class=\"paywall-full-content invisible\">The construction of a 250,000-square-foot server manufacturing facility in Houston for Apple Intelligence and Private Cloud Compute infrastructure, expected to open in 2026, signals management confidence in its AI-related revenue opportunities. Over the next four years, Apple plans to hire approximately 20,000 people, with the vast majority focused on R&amp;D, silicon engineering, software development, and AI/machine learning.</p> <p class=\"paywall-full-content invisible\"><strong>The Critical Question for 2026:</strong> Will Apple Intelligence features catalyze hardware upgrade cycles among the installed base? This is an assumption that is embedded in the current valuation.</p> <p class=\"paywall-full-content invisible\">Early signals are encouraging but not complete. <a href=\"https://seekingalpha.com/article/4839509-apple-iphone-17-cycle-setting-up-a-classic-holiday-beat\">iPhone 17 demand exceeded supply expectations</a> at launch, with demand 14% above iPhone 16 launch levels. However, distinguishing between artificial intelligence adoption driving upgrades versus simple appeal of new hardware remains analytically challenging. The January 29, 2026, earnings report will be crucial. Investors should scrutinize management commentary on AI feature adoption rates, Services attachment to new devices, and willingness-to-pay premiums for AI-capable models.</p> <p class=\"paywall-full-content invisible\">Looking ahead, Apple needs to demonstrate that AI features translate into measurable Services upgrades and hardware velocity acceleration. If <a href=\"https://seekingalpha.com/news/4512022-apple-expects-record-december-quarter-revenue-with-10-percent-12-percent-growth-amid-strong\">management's forward guidance</a> of 10-12% revenue growth in the December quarter (Q1 2026) materializes, and if iPhone revenue achieves double-digit growth, as projected, the AI thesis gains credibility. Conversely, any moderation in iPhone growth rates would tell us that AI monetization is moving slower than the market thinks it is.</p> <h2 class=\"paywall-full-content invisible\">Financial Performance: Margins Holding Despite Headwinds</h2> <p class=\"paywall-full-content invisible\">Apple's Q4 2025 results demonstrate high profitability in a complex environment. Total revenue reached $102.5 billion, up 8% year-over-year, capping a fiscal year with <a href=\"https://www.sec.gov/Archives/edgar/data/320193/000032019325000077/a8-kex991q4202509272025.htm\" rel=\"nofollow\">record total revenue</a> of $416.2 billion. Diluted EPS reached $1.85, up 13% year-over-year on an adjusted basis.</p> <h3 class=\"paywall-full-content invisible\">Services: A Fundamental Transformation</h3> <p class=\"paywall-full-content invisible\">The most significant finding in Q4 was the fact that services, rather than hardware, emerged as Apple's dominant profit driver. <a href=\"https://seekingalpha.com/article/4838312-apple-q4-strong-results-explosive-upside\">Services revenue surged</a> to $28.8 billion, up 15% year-over-year and now representing 28% of total quarterly revenue. Services gross margin reached approximately 75%, double that of hardware. And everyone knows how expensive Apple hardware is compared to its peers.</p> <p class=\"paywall-full-content invisible\">Services now accounts for 42% of quarterly gross profit versus 41% from iPhone. This is transformational. Apple is no longer primarily a hardware company with attached services but rather a services company with attached hardware. This means the company will get recurring, high-margin revenue with pricing power, predictability, and stability. That is something that the hypercompetitive and fast-shifting hardware universe cannot match.</p> <p class=\"paywall-full-content invisible\">For 2026, the forward guidance suggesting Services growth will continue at rates \"similar to fiscal year 2025\" implies 14-15% year-over-year expansion. This is achievable, but I should point out that it assumes no significant competitive pressure on App Store economics or cloud services. Investors should monitor services margins closely in coming quarters because any reduction below 74% signals rising competition.</p> <h3 class=\"paywall-full-content invisible\">Gross Margin Expansion and the Tariff Ceiling</h3> <p class=\"paywall-full-content invisible\">Gross margin reached 47.2%, expanding 70 basis points sequentially despite absorbing approximately $1.1 billion in tariff-related costs in Q4. Management projects tariff costs to increase to $1.4 billion in the December quarter, yet guided gross margin between 47% and 48%.</p> <p class=\"paywall-full-content invisible\">One thing of concern is that management apparently does not believe it has much room for raising prices. Cook explicitly stated that Apple chose to absorb tariff costs rather than raise prices to consumers. That suggests management views its products as having hit a pricing ceiling. That is understandable given the premium Apple already charges for its products.</p> <p class=\"paywall-full-content invisible\">However, if tariffs escalate further...which IS a material risk flagged in forward guidance, it means that Apple will face the prospect of margin compression. A 10% tariff increase translates to an additional $2 billion in costs. A big headwind.</p> <h2 class=\"paywall-full-content invisible\">Product Performance: Divergent Trajectories Emerging</h2> <h3 class=\"paywall-full-content invisible\">iPhone: Strong, but Growth Rates Are Decelerating</h3> <p class=\"paywall-full-content invisible\">iPhone revenue totaled $49.02 billion, up 6% year-over-year, marking a September quarter record despite supply constraints in China. This represents a notable slowdown from Q3's 13% growth. Management attributed supply problems to production delays rather than demand weakness. iPhone 17 availability was limited to the final week of the quarter... yet despite that, iPhone sales still grew 6% sequentially! That is impressive.</p> <p class=\"paywall-full-content invisible\">Looking forward, management has spoken of \"double-digit\" iPhone growth for Q1 2026. If it turns out to be true, it will validate the idea that AI is going to be the next thing driving Apple's growth. If iPhone achieves 10-12% growth as the full impact of iPhone 17's AI connection materializes, that narrative holds. BUT -- if growth moderates to mid-single digits despite this, investors should be ready to discount Apple Intelligence's monetization hopes.</p> <p class=\"paywall-full-content invisible\">That said, it should be noted that the initial demand signals are strongly positive and support management's claims. <a href=\"https://seekingalpha.com/news/4522123-apples-iphone-sales-in-china-surged-22-in-month-after-iphone-17-launch\">iPhone 17 sales surged 22%</a> year-over-year in China in the first month post-launch, with the new lineup representing 80% of iPhone sales in that market. U.S. and China demand for iPhone 17 is tracking 14% above iPhone 16 launch levels. However, these early figures often inflate to a normalized baseline within 2-3 quarters. The December quarter will reveal whether this elevated demand is sustained.</p> <h3 class=\"paywall-full-content invisible\">Mac: Momentum, but at What Cost?</h3> <p class=\"paywall-full-content invisible\">Mac revenue reached $8.73 billion, up 13% year-over-year, driven by sustained popularity of MacBook Air with M4 processors. Nearly half of Mac buyers were new to the product, suggesting the M-series refresh cycle and lower starting prices (MacBook Air now starts at $999) are expanding the addressable market.</p> <h3 class=\"paywall-full-content invisible\">iPad and Wearables: Why Are \"Wearable\" Sales Stagnant?</h3> <p class=\"paywall-full-content invisible\">iPad revenue remained flat at $6.95 billion, suggesting market maturation and saturation. Wearables, Home, and Accessories remained flat at $9.01 billion. The absence of growth in these categories is notable. iPad's flatness may reflect the maturation of tablet markets, but the lack of sales growth in \"wearables\" is concerning. It suggests that competitors are effectively outcompeting Apple in the smartwatch and audio categories.</p> <h2 class=\"paywall-full-content invisible\">Geographic Expansion: China as the Litmus Test</h2> <p class=\"paywall-full-content invisible\">China's Q4 revenue declined 4% year-over-year. However, Apple was suffering from a serious problem with the supply of units. Management explicitly stated that Q4's China decline reflected supply constraints, not demand weakness. The data supports this. iPhone shipments in China surged 17% year-over-year in Q4, and monthly iPhone sales growth reached 22% in the first month post-launch. <a href=\"https://seekingalpha.com/news/4523165-apples-iphone-commands-25-market-share-in-china---bloomberg\">Counterpoint Research estimates</a> Apple achieved 25% smartphone market share in China as of October 2025...the highest level since 2022.</p> <p class=\"paywall-full-content invisible\">This is astounding given how much more expensive Apple's products are compared to local competitors like Huawei, Oppo, and Xiaomi. It demonstrates that Apple's premium brand positioning remains intact and that consumer demand for the highest level of innovation, as opposed to copycat products, is genuine. That argues for the idea that Apple can compete with expensive products, as it has in the past, despite intense local competition from cheaper, less innovative variants.</p> <p class=\"paywall-full-content invisible\"><strong>Forward Implication:</strong> Management's guidance for China to \"return to growth\" in the December quarter (Q1 2026) seems credible. As supply constraints normalize, expect mid-to-high single-digit growth in Greater China. This provides a tailwind for calendar 2026 that wasn't present in 2025. However, that will be true ONLY if the current trade environment remains stable. Further escalation in U.S.-China tensions or protectionist policies could reverse everything very abruptly.</p> <h2 class=\"paywall-full-content invisible\">Tariff Risk: From Manageable to Material</h2> <p class=\"paywall-full-content invisible\">Tariff costs are now a serious financial headwind. Q4 absorbed $1.1 billion in tariff-related costs; management projects $1.4 billion for the December quarter. Over a full fiscal year, this could exceed $5-5.5 billion...material to profitability.</p> <p class=\"paywall-full-content invisible\">Apple says it has diversified manufacturing through a \"China Plus One\" strategy, with the majority of iPhones sold in the U.S. now manufactured in India. However, iPhone parts production remains heavily China-dependent. Compounding the risk, India itself is now the subject of tariff threats, complicating diversification efforts.</p> <p class=\"paywall-full-content invisible\">Management flagged tariff escalation as a \"material risk.\" A move from current tariff levels to 25-30% rates across relevant tariff lines could translate to $2.5-3 billion in additional annual costs. Apple could face seriously reduced profits as a result unless the company can raise prices to offset the cost increases, and its behavior, as noted above, indicates that management thinks it has already hit a price ceiling on what consumers are willing to pay for its products.</p> <h2 class=\"paywall-full-content invisible\">Valuation is the Core Problem</h2> <p class=\"paywall-full-content invisible\">Apple trades at a 33x forward P/E ratio. That is substantially above its 10-year historical average of 23.5x. Other relevant metrics:</p> <ul class=\"paywall-full-content invisible\"> <li><p><strong>Trailing P/E:</strong> 36-36.5x</p></li> <li><p><strong>Price-to-Sales:</strong> 9.83x</p></li> <li><p><strong>Forward Price-to-Sales:</strong> 8.71x</p></li> <li><p><strong>Price-to-Free-Cash-Flow:</strong> 40.69x</p></li> </ul> <p class=\"paywall-full-content invisible\">Apple's 36x trailing P/E is comparable to Microsoft at 35x, both commanding substantial premiums to the broader tech sector.</p> <h3 class=\"paywall-full-content invisible\">What the Market is Pricing in</h3> <p class=\"paywall-full-content invisible\">As it is doing with some other companies, like Nvidia, the market is pricing Apple for perfection. But human beings are not perfect. And management is human. People make mistakes and don't always carry out their plans perfectly. Pricing stocks for perfection is a serious mistake by market participants.</p> <p class=\"paywall-full-content invisible\">Here is the problem...current valuations assume:</p> <ol class=\"paywall-full-content invisible\"> <li><p><strong>AI Monetization at Scale:</strong> That iPhone upgrade cycles, thanks to the incorporation of AI, accelerate 10-15% from baseline.</p></li> <li><p><strong>Tariff Insulation:</strong> That tariffs either remain at the current levels or are renegotiated downward. Further escalation is NOT priced in.</p></li> <li><p><strong>Services Growth Persistence:</strong> That services growth will continue at double-digit rates (14-15% CAGR) at least through fiscal 2027 despite increasing price competition in both App Store categories and cloud services.</p></li> <li><p><strong>Geographic Expansion:</strong> That China returns to a fast-growth trajectory and emerging markets deliver double-digit expansion through calendar 2026.</p></li> <li><p><strong>Margin Stability:</strong> That gross margins remain above 46% despite capital intensity rising and competitive pressures persisting.</p></li> </ol> <p class=\"paywall-full-content invisible\">This is too much to assume. Miss any single element, and heavy downside pressure emerges rapidly.</p> <h3 class=\"paywall-full-content invisible\">Fair Value Assessment</h3> <p class=\"paywall-full-content invisible\">Based on fundamental analysis incorporating forward earnings power, capital intensity, and competitive dynamics, in my opinion, Apple's current fair value is approximately <strong>$195-205 per share</strong>, representing 20-24% downside from current levels and implying a forward P/E of 23-24x.</p> <p class=\"paywall-full-content invisible\">This valuation assumes:</p> <ul class=\"paywall-full-content invisible\"> <li><p>Organic revenue growth averaging 8-10% through fiscal 2027</p></li> <li><p>Gross margins stabilizing in the 46-47% range (net of tariff headwinds)</p></li> <li><p>Services growth moderating to 12-13% as the base expands</p></li> <li><p>Free cash flow conversion maintaining current levels despite elevated capex</p></li> </ul> <p class=\"paywall-full-content invisible\">At a 23.5x forward multiple applied to base case earnings, Apple would trade around $200 per share. This represents fair value...not distressed value. A stock appropriately priced for an excellent business, which trades at historical multiples.</p> <h2 class=\"paywall-full-content invisible\">Risk Assessment and Investment Recommendations</h2> <h3 class=\"paywall-full-content invisible\">Key Downside Risks</h3> <p class=\"paywall-full-content invisible\"><strong>Apple Intelligence Monetization Fails:</strong> If the December quarter earnings reveal that iPhone growth moderates to mid-single digits despite AI features, it signals weak monetization. Downside to 28-30x multiples ($160-170) would be likely. Maybe lower...</p> <p class=\"paywall-full-content invisible\"><strong>Tariff Escalation:</strong> A move to 25%+ tariffs forces gross margin below 46%, triggering multiple compression. Downside risk: 15-20%.</p> <p class=\"paywall-full-content invisible\"><strong>Services Growth Deceleration:</strong> If Services growth falls below 12% year-over-year, the business model narrative deteriorates. This category now represents the bulk of profit dollars.</p> <p class=\"paywall-full-content invisible\"><strong>China Demand Reversal:</strong> A slowdown in China after the initial iPhone 17 reception would undermine management's growth outlook. Near-term downside: 10-15%.</p> <h3 class=\"paywall-full-content invisible\">For Risk-Averse Investors (1-3 Year Horizons)</h3> <p class=\"paywall-full-content invisible\"><strong>Rating: SELL</strong></p> <p class=\"paywall-full-content invisible\">At 33x forward P/E, Apple represents elevated risk. The risk-reward is balanced or negative. Current valuations require flawless execution. A significant miss on AI monetization, tariff escalation, or services attachment will drive significant downside. Consider building positions only on weakness below $200 per share (approximately 23x forward).</p> <h3 class=\"paywall-full-content invisible\">For Long-Term, Risk-Accepting Investors (5+ Year Horizons)</h3> <p class=\"paywall-full-content invisible\"><strong>Rating: SELECTIVE ACCUMULATE ON WEAKNESS</strong></p> <p class=\"paywall-full-content invisible\">Apple's structural transformation toward Services, record installed base, and credible AI infrastructure investments position it for multi-year growth. The company's balance sheet is fortress-like, returning $24 billion to shareholders in Q4 alone through dividends and buybacks.</p> <p class=\"paywall-full-content invisible\">However, committing capital at current valuations, I think, is a mistake. Target entry points:</p> <ul class=\"paywall-full-content invisible\"> <li><p><strong>Attractive Entry:</strong> $195 per share (approximately 23x forward P/E), representing 20-25% downside from current levels</p></li> <li><p><strong>Compelling Entry:</strong> $170 per share (approximately 20x forward P/E), representing 35% downside</p></li> </ul> <p class=\"paywall-full-content invisible\">At these valuations, Apple trades near or below historical averages while still incorporating the idea that AI will drive sales of newer phones and other devices, the structural shift to services, and the expansion of its installed base.</p> <h2 class=\"paywall-full-content invisible\">Conclusion</h2> <p class=\"paywall-full-content invisible\">Apple is a high-quality, well-run company with record revenue, record profitability, services expansion, a record installed base, and credible future guidance. Management's execution has been exceptional. The company is allocating capital intelligently toward AI infrastructure, and management has demonstrated disciplined capital allocation for a decade.</p> <p class=\"paywall-full-content invisible\">However, market prices reflect this quality too aggressively. At 33x forward earnings and 40.7x free cash flow, there is little room for disappointing profit expectations. But there is a lot of room for downside risk. The market assumes perfection. Missing any critical assumption...AI monetization, tariff escalation, Services growth, or China momentum...will trigger a rapid downward repricing of this stock.</p> <div class=\"before_last_paragraph-piano-placeholder paywall-full-content invisible\"></div> <p class=\"paywall-full-content invisible\">BUT, Apple also remains in a unique class of overvalued tech stocks alongside Nvidia. Downside emerges quickly upon any management misstep. Upside is limited at current valuations even if management exceeds expectations.</p>",
      "quickInsights": [
        {
          "question": "How does Apple's AI strategy impact its growth outlook and capital allocation?",
          "answer": "AAPL's aggressive AI investments—up 34.5% YoY—signal a pivot to AI-driven, services-centric growth, but hardware upgrade demand from AI features remains unproven."
        }
      ],
      "twitContent": "Apple: Quality Vs. Price $AAPL $AAPL:CA #finance #markets #stockmarket https://seekingalpha.com/article/4856022-apple-quality-vs-price?source=tweet",
      "isReit": false,
      "videoData": null,
      "marketingBulletVariant": null,
      "marketingBio": null,
      "audioDuration": 1160.4,
      "originalTitle": "Apple: Quality Vs. Price"
    },
    "relationships": {
      "author": {
        "data": {}
      },
      "sentiments": {
        "data": [
          {},
          {}
        ]
      },
      "primaryTickers": {
        "data": [
          {
            "id": "146"
          },
          {}
        ]
      },
      "secondaryTickers": {
        "data": []
      },
      "otherTags": {
        "data": [
          {},
          {},
          {},
          {},
          {},
          {},
          {
            "id": "146"
          },
          {},
          {},
          {},
          {},
          {},
          {},
          {},
          {},
          {
            "id": "326"
          }
        ]
      },
      "coAuthors": {
        "data": []
      },
      "presentations": {
        "data": []
      },
      "updates": {
        "data": []
      },
      "corrections": {
        "data": []
      }
    },
    "links": {
      "schemaImage": []
    }
  },
  "included": [
    {
      "attributes": {
        "company": null,
        "userId": 337451,
        "tagId": 12454,
        "bio": "<p>A. B. Goodman is a licensed attorney, securities industry dispute resolutions arbitrator, a writer of articles addressing issues of current interest, and a novelist. He is the author of the forthcoming action-packed Wall Street murder/mystery thriller, \"The Bank.\"<a href=\"https://amzn.to/3WPJdmr\"></a></p><p>He holds a B.A. from Emory University, where he concentrated on history and economics. He also holds a Juris Doctorate degree from the University of California at Los Angeles Law School and is a member of the Bar, licensed to practice law in several jurisdictions. His career has consisted not only of prosecuting cases on behalf of clients, but in judging the claims of others. He serves as a member of the roster of neutral arbitrators of the National Futures Association (NFA) and the Financial Industry Regulatory Authority (FINRA).</p>",
        "image": {},
        "deactivated": null,
        "memberSince": 2009,
        "isRss": false,
        "contributorSince": 2008,
        "followersCount": 2261
      },
      "relationships": {
        "user": {
          "data": {}
        },
        "userBioTags": {
          "data": [
            {}
          ]
        },
        "authorResearch": {
          "data": null
        }
      },
      "links": {
        "site": null,
        "linkedinUrl": null,
        "twitterUrl": null
      }
    },
    {
      "id": "146",
      "attributes": {
        "fundTypeId": 0,
        "isDefunct": false,
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {}
    },
    {
      "attributes": {
        "fundTypeId": 8,
        "isDefunct": false,
        "isBdc": false,
        "isReit": false,
        "isEtf": false
      },
      "relationships": {},
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "name": "High Quality Business Model",
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "id": "326",
      "attributes": {
        "company": null
      },
      "links": {}
    },
    {
      "attributes": {
        "articleId": 4856022,
        "createdAt": "2025-12-28T01:28:28.000-05:00",
        "typeId": 3
      },
      "relationships": {
        "article": {
          "data": {}
        },
        "tag": {
          "data": {
            "id": "146"
          }
        }
      }
    },
    {
      "attributes": {
        "articleId": 4856022,
        "createdAt": "2025-12-28T01:28:28.000-05:00",
        "typeId": 3
      },
      "relationships": {
        "article": {
          "data": {}
        },
        "tag": {
          "data": {}
        }
      }
    }
  ]
}